{"0": [], "1": ["Looks overpriced, at this price, in UK land-rover has produced Evoque (paying the British labour costs) and I would expect this quality for much lesser price, (considering India having lower costs of production). Automatic gearbox could be a electronic, seat memory missing, could have been a bit more longer giving some luggage space after the 3rd row seating etc."], "2": ["It's syangon rexton and it is over priced ... too much expensive... it will be wise to buy Hyundai Tucson than this SUV.... other korean and Japanese suv are more better than this ... if you can buy toyataRAV4 this will be the best option of choice ..\nNANA", "It is sufficient every features. But in safety features 2 airbag is not sufficient . It should be 6 airbags like 4wD . Other wise it look some think less ... . In terms of safety features.", "Most of the reviews were felt more on looks and definitely not about the ride quality!! This car could have been much better and this is overpriced for the ride quality. Car jerks and shakes at the top speed. Ride quality is just okay.", "Best in class having many more functions, giving a competition to fortune and endeavor. Best in class it is having electronic adjustable seats. But it lacks on sun roof. Good grip of steering. It make you feel such a power in your hands Car engine is silent till 60km/hr. After this it sounds little noisy. DRL's are a today's need provided though. Alloy size is perfect of 18 inches. Cruise control, traction control, hill assist etc are provided. You can have a test drive.\nNANA", "Mahindra alturas G4 the car is expensive &ride quality should have been better in exterior looks average compare to fortuner but better in space quality finish.features are best in segment engine would have more powerful off-road capabilities are not tough enough compare to others in segment but Mahindra has improved his ability qualities"], "3": ["Alturas G4 by Mahindra. Its a feature loaded car. Weldone by mahindra. The quality of the interior is excellent. You can't expect better than this.PROS- In Alturas G4 yo have 9 airbags, sunroof, ventilated seats, Napa leather upholstery, 360 camera, auto wipers and headlamps, automatic boot opening, cruise control, hid headlamps, led fog lamps with cornering light, front and back sensors n many more. CONS- no panoramic sunroof and less features in 2wd. Riding Experience is very nice. Though there is stiffness in the suspension but its required actually for off roading. Performance- It will give better mileage from there competitors. Maintenance- No worries as company is giving you AMC. You can take maintenance cover in a lesser cost. I have taken 4 year amc in Rs 26500/-. Its a hardcore SUV and you won't find any problem. One thing which mahindra have to improve is they have to create experts in there dealership who only sells alturas g4. Its a luxury car and you cannot sell it without the knowledge and experience. People who are selling alturas g4 they actually don't know the USPs of the car. Mahindra is offering buyback and amc as well which I don't think that people knew about it because of lack of knowledge in the dealers. Take quality people and give them the knowledge. Rest for the car, one word awesome.", "I happened to short list ALTURAS G4 from its rivals of TOYOTA and FORD for the best of my own reasons as follows: FORD : Not much of special features comparatively, which are necessary in this sophisticated year 2019+, which makes ALTURAS handling to the best, and just with electric 3rd seat and panoramic sunroof with optional 4WD and also 4 to 5 kmpl less millage then ALTURAS due to its 5 cylinders and torque, which is not much required always in the city. TOYOTA : Not even a single special feature comparatively, just mere plastic dashboard which are too old for this decade and even a low segment suv or a car got better interior then this. 2.8 liter engine with low torqur comparing to 2.2 liter ALTURAS with more torqur, which difference can be easily found out while driving. If not for its higher millage in long drives, nothing much special about it. ALTURAS G4 : PROS: After my first test drive out from the above, i decided upon 4WD model, ( with my experience out from my age of 50 and 14 cars till date ) and its loaded with more then expected features as makes the driver and the passengers feel much more comfortable, which are not even in my MERCEDES BENZ C 250 - 2018 model and also in the E class. 1. Special features like AUTO HOLD is an exceptional feature which are very necessary for an AT model suv or a sedan in the city to drive with no pain. 2. Fully automatic door open and close including the boot and rear view door mirror, with window up and down with the remote is fore most and outstanding feature and feels ease with magical mind and mood setting. 3. Ventilated electric driver seat with 3 memory settings make the driver and co -driver makes the long drive much more easy and comfortable. 4. Voice Navigation with touch screen infotainment is amazingly wonderful with day and night colour change, with all latest medias like whatsapp, micra sd slot, usb slot makes the passengers feel like sailing. 5. Bumper to bumper Full LED lights makes the car like diamond in the dark. 6. Multiple power output in usb or 12 v available all necessary places to fix and play or charge anything with to enjoy uninterruptedly. 7. Enjoy the sun with open sunroof in the early morning drive. 8. Rain sensing wipers are exclusive with many modes and very useful and like wise the night sensing headlights with adjustable heights not available with any rivals. 9. Floding the 3rd row seat with make 3 persons to sleep well or to load a little home for a long drive. PERFORMANCE: its just 3 months snce i've taken delivery of the suv and i've driven 17,000 km. Driven with ease and comfort to KORDUNGLA PASS, the highest motorable road in the world with an altitude of 18380 ft ASL with - 5 degree temperature. Done 3500 km non stop drive from srinagar to chennai with detour. All tough and hard rock, river bed terrains covered with no compliants, no noise, no fuss, all to the ultimate satisfaction. CONS: 1. Due its body on ladder frame makes the little bumpy in the path holes and in the higher speeds. 2. Millage in city is less than 9 and on highway 11 to 12 kmpl only inspite of 2.5 liter engine. 3. Looks and rebadge of mahindra could have been made bit better. 4. Tyre size could have be made little wider for better handling during high speed. MAINTENANCE: Feel shamful to say but need to accept the truth, for the ventures done till date, i ve spent only Rs.3500/- as my first 10000 km service with oil and filters change, and feel needless explain any further. I feel proud to submit this review, their may be difference of opinions and the choice varies person to person depends on the mind set, but still for india with low budget premium suv, ALTURAS G4 is THE MAGICAL BEAST ON THE ROAD for myself, out from my childhood crazy fantasies for cars and out from my 14 cars with a 6 + lacs km driven experience. If anyone needs any further clarification please do send mail to : sa**ish_35**o*e@yahoo.com\nNANA", "Most of the reviews were felt more on looks and definitely not about the ride quality!! This car could have been much better and this is overpriced for the ride quality. Car jerks and shakes at the top speed. Ride quality is just okay.", "Best in class having many more functions, giving a competition to fortune and endeavor. Best in class it is having electronic adjustable seats. But it lacks on sun roof. Good grip of steering. It make you feel such a power in your hands Car engine is silent till 60km/hr. After this it sounds little noisy. DRL's are a today's need provided though. Alloy size is perfect of 18 inches. Cruise control, traction control, hill assist etc are provided. You can have a test drive.\nNANA", "Mahindra alturas G4 the car is expensive &ride quality should have been better in exterior looks average compare to fortuner but better in space quality finish.features are best in segment engine would have more powerful off-road capabilities are not tough enough compare to others in segment but Mahindra has improved his ability qualities", "Buy ford endeavour best in all areas, add 2 lakhs more in Ur budget u get better car like ford endeavour with bigger engine, more features, reliability or u can go for fortuner n Skoda Kodiak . Ride quality is worst in this car, back and side profile are not good as compared to rivalry SUV as I mentioned above", "Looks good but ride quality and suspension is not up to the mark,has too much of body roll and pick up and gearbox is okay ,comfort level is good, third row is almost unusable. Very huge and bigger than fortuner difficult to drive in cities and to park misses auto park and has lots of segment new features and u can also consider isuzu max which is closest rival"], "4": ["Alturas G4 by Mahindra. Its a feature loaded car. Weldone by mahindra. The quality of the interior is excellent. You can't expect better than this.PROS- In Alturas G4 yo have 9 airbags, sunroof, ventilated seats, Napa leather upholstery, 360 camera, auto wipers and headlamps, automatic boot opening, cruise control, hid headlamps, led fog lamps with cornering light, front and back sensors n many more. CONS- no panoramic sunroof and less features in 2wd. Riding Experience is very nice. Though there is stiffness in the suspension but its required actually for off roading. Performance- It will give better mileage from there competitors. Maintenance- No worries as company is giving you AMC. You can take maintenance cover in a lesser cost. I have taken 4 year amc in Rs 26500/-. Its a hardcore SUV and you won't find any problem. One thing which mahindra have to improve is they have to create experts in there dealership who only sells alturas g4. Its a luxury car and you cannot sell it without the knowledge and experience. People who are selling alturas g4 they actually don't know the USPs of the car. Mahindra is offering buyback and amc as well which I don't think that people knew about it because of lack of knowledge in the dealers. Take quality people and give them the knowledge. Rest for the car, one word awesome.", "I happened to short list ALTURAS G4 from its rivals of TOYOTA and FORD for the best of my own reasons as follows: FORD : Not much of special features comparatively, which are necessary in this sophisticated year 2019+, which makes ALTURAS handling to the best, and just with electric 3rd seat and panoramic sunroof with optional 4WD and also 4 to 5 kmpl less millage then ALTURAS due to its 5 cylinders and torque, which is not much required always in the city. TOYOTA : Not even a single special feature comparatively, just mere plastic dashboard which are too old for this decade and even a low segment suv or a car got better interior then this. 2.8 liter engine with low torqur comparing to 2.2 liter ALTURAS with more torqur, which difference can be easily found out while driving. If not for its higher millage in long drives, nothing much special about it. ALTURAS G4 : PROS: After my first test drive out from the above, i decided upon 4WD model, ( with my experience out from my age of 50 and 14 cars till date ) and its loaded with more then expected features as makes the driver and the passengers feel much more comfortable, which are not even in my MERCEDES BENZ C 250 - 2018 model and also in the E class. 1. Special features like AUTO HOLD is an exceptional feature which are very necessary for an AT model suv or a sedan in the city to drive with no pain. 2. Fully automatic door open and close including the boot and rear view door mirror, with window up and down with the remote is fore most and outstanding feature and feels ease with magical mind and mood setting. 3. Ventilated electric driver seat with 3 memory settings make the driver and co -driver makes the long drive much more easy and comfortable. 4. Voice Navigation with touch screen infotainment is amazingly wonderful with day and night colour change, with all latest medias like whatsapp, micra sd slot, usb slot makes the passengers feel like sailing. 5. Bumper to bumper Full LED lights makes the car like diamond in the dark. 6. Multiple power output in usb or 12 v available all necessary places to fix and play or charge anything with to enjoy uninterruptedly. 7. Enjoy the sun with open sunroof in the early morning drive. 8. Rain sensing wipers are exclusive with many modes and very useful and like wise the night sensing headlights with adjustable heights not available with any rivals. 9. Floding the 3rd row seat with make 3 persons to sleep well or to load a little home for a long drive. PERFORMANCE: its just 3 months snce i've taken delivery of the suv and i've driven 17,000 km. Driven with ease and comfort to KORDUNGLA PASS, the highest motorable road in the world with an altitude of 18380 ft ASL with - 5 degree temperature. Done 3500 km non stop drive from srinagar to chennai with detour. All tough and hard rock, river bed terrains covered with no compliants, no noise, no fuss, all to the ultimate satisfaction. CONS: 1. Due its body on ladder frame makes the little bumpy in the path holes and in the higher speeds. 2. Millage in city is less than 9 and on highway 11 to 12 kmpl only inspite of 2.5 liter engine. 3. Looks and rebadge of mahindra could have been made bit better. 4. Tyre size could have be made little wider for better handling during high speed. MAINTENANCE: Feel shamful to say but need to accept the truth, for the ventures done till date, i ve spent only Rs.3500/- as my first 10000 km service with oil and filters change, and feel needless explain any further. I feel proud to submit this review, their may be difference of opinions and the choice varies person to person depends on the mind set, but still for india with low budget premium suv, ALTURAS G4 is THE MAGICAL BEAST ON THE ROAD for myself, out from my childhood crazy fantasies for cars and out from my 14 cars with a 6 + lacs km driven experience. If anyone needs any further clarification please do send mail to : sa**ish_35**o*e@yahoo.com\nNANA", "It is good looking car from exterior and interior excellent music system and auto gear shift also a new type of speedometer Sunroof feature is also very nice and this car is having comfortable seats ..", "Buying experience was hassle free , riding car is also good car has a stiff suspension, feel confident even on corners as the steering wheel is awesome lots of body roll on corners as it's an SUV fuel economy could have been better Mercedes gear box is a treat to use overall a good car but potential buyers should go for Ford Endeavour this should be considered as second option", "The price more than 30 lakh which is not worth it...buying innova cresta is better than mahindra alturas...but the interior of alturas is fabulous than the exterior and comfortable too.", "Alturus G4 the name itself is coming humongous to compete the lineup . This huge car is the perfect fit for the people who are looking for big thing. The Mahindra has come up with this monster to gift the people who like huge car .", "3rd ro not comfortable and vsibalt not clear and compare other car it's best option bicose other car price very high in this segment. E.g..fortuner and ford endvr. It's luck so nise.", "Best one, this is best in almost every cars at this range and at this time. Everything is fine under this car top class things that have been used to manufacture this car. Its leather seat is awesome. nice ac and nice look.\nNANA", "It is the beautiful SUV and more function in its segment also the more powerful engine in its segment. And in this cost best package I love this car. This suv longer then in its segment The competition of this suv is fortuner and. Ford endeavour All of the function is good And gearbox this SUV is Mercedes\nNANA", "What makes the Alturas G4 all the more interesting is the fact that it is being launched in one of the most important SUV segments in the country, the full-sized, seven seater premium SUV segment. Effectively, the Alturas G4 is up against heavyweights like the Ford Endeavour and Toyota Fortuner, which need no introduction as two of the most popular SUVs in the country. This means the Alturas G4 clearly has its task cut out already. A quick spin helped us acquaint ourselves with it.", "I must say good attempt by Mahindra fortuner and endeavour are old now not facelift nothing so this one is fresh design. Mahindra alturas is very bulit and very rich in feature list as compared to both of them . It’s 2018 so feature and equipment plays important role so just go and test drive yourself. Only three cars are on this price point popular ford endeavour, Toyota fortuner and alturas"], "5": ["It's just amazing car with very good comfort mileage looks power size of car everything is just amazing thanks Mahindra for this amazing car it's far far better than Fortuner... Alturas is very underrated car people should purchase this...", "Value for money with strong presence as compared to rivals. Mahindra should market this big giant and it will definitely cover the endeavors absence. New logo and change with front grill along with tech features come soon.", "Grab this beast before it's too late. This suv is a diamond in coal market. Sadly people ignore it and I have a for turner also. Bought this, believe me this is just far far better than Fortuner. Grab this suv before it gets discontinued. The only disadvantage I feel about this suv is last row windows are too small", "1.buying experience is quite good 2.interior quality is best under ratted but best in segment 3.looks are best alloys are too beautiful 4.servicing is too good, maintenance is also best.", "It was definitely a value for money car. Go and grab it. It was a far better car than fortuner and Innova. I don't know why the sales figure is so low but this car is just awesome. I have driven it to Leh and it was just a amazing experience.", "Alturas G4 is an amazing full size SUV, loaded with class leading features and offers comfort, power, styling and performance, all in a single package The car offers acres of space , tremendous power, great performance and an exceptional list of features to make it an overall winner.", "Nice car value for money very much comfortable and have all features and premium Interior with Quilted covers and very powerful engine and best value for money car Mahindra is best.", "Wonderful car really value for money, very high quality of interior , powerful engine and good driving comfort. I love the interior of the car and very good ground clearance. I found it more comfortable than Ford Endeavor and Fortuner. Very nice built quality with high standard quality.", "It's a best in segment car at affordable price and it is a very capable for off-road I have done off-roading with my Alturas and it moves easily by obstacle. Interior quality is also very Royal and touch and feel of material is excellent and about mileage it offers a mileage of 10-12 in highway and city. Its very fun to ride car.", "Power packed Suv. No comparison with Fortuner. Competes with Endeavor. First Indian brand reliable, value for money with excellent features. Good in comparison to features wise with fortuner.", "Previously I was driving Audi A4 and fortuner, I sell both and Purchase alturas G4, I didn't feel like I am driving any Mahindra car, feel is like luxury car like Audi and I visited Srinagar by continuously driving and spending more than 25 hours in car, but I didn't feel any tiredness after driving that long. It goes very smooth and never slip in Gulmurg at black snow road by using winter mode and 4x4 feature. It is made for long drive, you can take it any where in the world.", "Worth buying, its value for money... it's far better than other SUV in its segment..driving this monster was far better than driving Toyota Fortuner..u pay far less than Toyota Fortuner but features which Mahindra have provided is far better than Toyota. Luv the car n luving the experience. the only problem is that the split between homegrown carmaker Mahindra & Mahindra n Ssangyong may create problem on servicing n its spare parts..hope Mahindra won't disappoint its customer..", "One of the best car in SUV segment beating Toyota fortuner and Ford endeavour in every feature with low pricing smooth driving experience loaded with rich and premium features very comfortable riding best is ventilated seats and engine from Mercedes so that makes the mind full of energy while driving and of course the safety features like 9 airbags and traction control esp is a lot comforting while riding on a highway", "This is such a great SUV in this price range...it's comfort...it's ride...it's features are really best...since I'm owning this I'm so happy and satisfied...it's maintenance is also not as costlier as other cars in this segment.", "Alturas is the best in the class vehicle.it has unique features in its segment.I think it's better than its rivalries.it is a value for money car and it is cheaper than its rivals.mahindra's service and maintenance is cost-effective.performance is best because it has 178 bhp 2.2l engine. its gear shifting little lazy.low turbo lag. It has long wheelbase.very comfortable for road trips.", "The suv is a mammoth and gives immense road presencez Surely turns head wherever you go. The amount of features are worth every penny you spend on the car. The quality of material is top notch and is above class.", "This car is Value for money car and low maintenance car . It's very very comfortable for driving in city and also a fast running SUV car which can give a very good experience on Long Drives .", "I take pride to be the first owner pan India. It's the best in class and way better on overall parameters in comparison to highly-priced SUV'S. Service is/are the only area of concern.", "Undoubtedly Mahindra is a company or words, and gesture, the humble staff at all dealership are throughout, it's the usp of it. Riding this Big Ben Alturas G4 4 WD is unexpectedly awesome, didn't even thought that Mahindra could reach this level of luxery on Wheels too. Wasn't having full knowledge until meeting and sitting personally. Not too heavy on pocket being Mahindra vehicle for maintaining, and service centres are all over India, so never to worry service as well. The 1st ever car i can't make out any mistakes or left behind thing, you name it & they have it types, all inclusive bundled package of happiness fir the while family, i must say.", "1. My buying experience was so good. They delivered my car in a very beautiful way. As per my request they have also change the interior colour to red. 2. Riding experience was awesome the 4WD system have excellent performance. Even the road the road was not so good but the inside the car there was a very little like 0.001% disturbance. 3.From look wise, the seven U shaped front grill have love by my heart. And the performance was like so damn cool. The speeds up very quickly as compared to other vehicles in this segment. 4. Service was very good and nice done by Mahindra. The most amazing fact was that it costs very cheap for the maintenance of this vehicle. 5. Pros - So Many. No words to explain it. Cons - The Engine was not starting properly but after servicing the problem was solved by mahindra.", "Nice and silent travelling experience. Spacious and comfortable Had a excellent experience while offroading in the hilly terrain . Good air conditioning and lots of features help driving comfortably.", "4wd feature is awesome and off roading with this beast is way too terrific. Missed the panaromic sunroof. Went to spiti valley Himachal Pradesh with this. Crossed rivers, mountains very easily. The dashboard is luxurious and it give feels of an premium suv. I would suggest go for it.", "I bought this SUV after considering & test driving the Fortuner & the Ford Endeavour. No contest. The first test ride of the Alturas surprised me with the almost silent and powerfully responsive engine. Quiet and powerful with handling at par with the Endeavour and far ahead of the Fortuner. The second thing that struck me was the sheer luxury quotient of the vehicle interiors. Superbly packaged, classy and extremely comfortable - including such bits as the ventilated seats (front only) & high quality of finish. The sheer range of equipment provided is far ahead of the competition. I bought this SUV in end March 2019. It helped that the sales personnel knew all the tech details that we queried them about. Good experience. In fact the sales team kept in touch even after the purchase. Recently, we drove from Indore to Mumbai and back - short holiday. A minimum of 12 plus kmpl on the highway and the vehicle handled beautifully - none of us who took turns to drive felt any tiredness at the end of the journey. Smooth and silent we were surprised that the engine spun at 1500 rpm at 100 kph! And we had loaded it up with 4 suitcases plus an assortment of carry on bags, etc. No problem. Plenty of space at the rear. The 1000 km servicing before our trip was efficiently done - basic checks, tightening of nuts and bolts & washing. The entire vehicle appears to be imported. So far - superb & impressive experience. Cons: Would have preferred a fwd looking camera to see lower fwd areas. The high bonnet is tricky when negotiating narrow areas / tight turns.", "This car is look very attractive i love this car and they give u more power and advance features if u compare Alturas G4 to author company car in this segment u can't find it with this loaded feature that mahindra give u in G4 so, i think that u should move with G4 and take a test ride with G4 then u show what mahindra give u in this segment and perfect 7 seater car with power full engen and smooth drive with high quality interior and best class comfort that provide by mahindra with safety and different things ,so this car milage in NH approx 15kmph4WDAT version and 1st service after 10000 km So guess u shod go it to take a test drive Mahindra Alturas G4.", "", "", "Buying experience wasn't smooth at all. Mahindra should find better ways to keep customer safe and immune from dealer woes. Better keep this car under seperate dedicated dealership, else this can be show down in longer run Ride The car engine is good and responsive, gear shifts could make you feel the sense of it's OEM, the Daimler. Soft suspension so better than peer Fort'r and Endy, NVH is almost nil. Vertical and horizontal movements are well controlled. The car is not a so quick one when compared to the power to weight ratio, still it can outride the much BHP powered Endy for a run Looks Macho and Large. Smooth n light steering feel + 360 video + park sensor, and seating position makes judgements while driving easy. Softer suspension shows a little front dive feel at sudden braking, but not an awkward or unsafe feel. Overall a good performance. All safety features present with anti roll technology and 9 airbag system Service is at every 10K KM's and there's no periodical date line. 3 year or 1 lakh km warranty So many pros with so many features at par with a Merc, like seat cooling, key less entry, driver seat memory, selectable 4 wheel drive, sunroof and the list goes on to bring smile, Few notable Cons : second row seat base cannot be adjusted to front or back Thrid row passenger knee will be near chin, due to low seat height Third row both Passenger AC vents are located in one side Third row doesn't recline Headlights could have been LED with bright white light", "This car is very good and comfortable for all of us and this car is competitive to fortuner as my skills it is excellent from FORTUNER. This car give competition to all the cars at the range of 20 - 40 lacs", "awesom cars by mahindra its taken ame full view ofof comfert then there areis automatic gear and then there areis so good looking andso good designed by our engineer andin also available on showroomthe thnkx mahindra", "This car is really good in performance and I really liked the car it is the highest selling car in India in minimum price first I would like to thank Mahindra for this good car. It is the car which has been bought in my family 5 times.", "3.amanzing performance car have very good safety futures ,great look n worth for money.but 2200 cc is not enough for this type of car but ok ,mileage also pretty good n good for off-roads", "Alturas G4 is car which i even shown This type A royal look car If even a middle man drive tht nd when he came out form tht all peoples surrending him Look Like a King ??????", "Awsome car is that this car soo many safety feature that is awsome i loved this car when ever i drive this car the personality of my that was awsome really this this car awsome i lv", "", "", "Buying experience: Amazing very good Mahindra company I am proud to it's Indian company made.\nRiding experience: Riding experience is awesome, for Indian roads\nDetails about looks, performance etc: This car look wise out look is comparing Audi Q5,and intirier look like banz matic 4 , totally gorgeous.\nServicing and maintenance: Sevice is better then Hyundai, and maintenance is better than Jeep compass\nPros and Cons: I love this car and refer to all my friends.", "When you drive this SUV, ...it feels like you are flying.... A very spacious, comfortable, very good handling... Feels safe....... Features are awesome... Height is very good.....", "It's very good and interior design very nice. Low budget range very good car like luxury car and very comfortable. Better than Toyota fortuner. More than gear and 8 airbags. Nice looking and sun roof in including three rows of sets fully automatic and air conditioning luxury car. I very very like this car.", "Buying experience: In this price or some high price like fortuner came but this new car has surprise to everyone because in some less price we get a nice car and more features and function.\nRiding experience: Excellent seat position and totally comfortable seats. What i say about drive it was amazing that if you traveling for very fare distance than also you will enjoy and no any uncomfortable you will feel\nDetails about looks, performance etc: This car having much features than other car in this segment so i am telling you only that features you don't get in any car this car having 9 air bag ,360 DEGREE CAMERA, Automatic adjust driving seat, best quality of leather seats, mercedes Benz gear 7 speed to change gear quickly and to drive fast speed , automatic opening of back door when you go near by taking key and having more features but this feathers attractive and it is for our safe also.\nServicing and maintenance: Good service of mahindra no any issue please don't lesion what the public talk or some YouTube channel who say negative things about this car to make you afraid.\nPros and Cons: I love this car very much because no any car was in this segment to make loose and give that much features and price is also less so go for this mahindra new car and don't afraid", "Would definitely love to make this purchase asap as found the vehicle perfectly suited to my needs the fit and finish is world class and the vehicle is easily better than comparable vehicles . The fortuner and the endavour and the innova crysta pale in comparison the fact is it carries the feature rich legacy of Xuv 500 to another extreme", "mahindra broke the rs 10 lac ceiling with the Scorpio , the rs 20 lac ceiling with the xuv 500, and that time mahindra ready witha new superstar with in 30 lac with full of luxury.it take a strong product to break all the price barrier.All manufacture are in shock. what a ride, what a luxury. if i compare his luxury with other so other cars price tag is near about 40 to 45.... how mahindra do it. but i believe only mahindra do and done it. keep it up mahindra . its a milestone ....", "Very nice car and features are excellent and very interested features 360 degree camera and engine powerfull. Interior are so beautiful this car very safety car iam interested to buy it perfect price this car wheels are beautiful i love this car I buy it alturus G4 4 WD mahindra is very nice company.", "", "Mahindra always thinking about Indian costumers, budget. So this is also step-up line... So I want to buy this for my family hope any discounts for me .... Waiting till mid of this year..... Also I suggest this car my buddy he also happy this inshallah I Will be to buy good luck g4 for this year...", "Looks are very appealing, Performance is also awesome in and off riad Servicing and maintenance, very good because mahindra has best service station in every states ND districts Pros Mahindra G4 is value for money ,it has many features ,first in segment and best in segment. The price is very catchy among its rivals 4WD variant is quite good luxury SUV Stylish SUV gives better option for customers Cons It should have been given auto park assist Mahindra should also provide more features in its base variant because base variant has only limited features Body roll is also there Alloys are only18'' it looks small Panaromic Sun roof is not there", "Mehindra is a good working in altus g4 nice product valu for money in car fast in pick up interior design in good looking comfort seating plan altuuras g4 services in medium ac is good in car trying me again", "Yes i want buy this car this car look awesome as comparison of other car I think this car much better for ride a long path there black color so attractive and there performance is so much good there service much easy and maintained is so easy there pros is look good and drive easly any where and cons is no there", "This is the one of the best Suv car in India in the best price than endeavor and Fortuner.T he Mahindra give Lots of best feature in this car like automatic seat adjust and many more.\nNANA", "This Mahindra Altrus G4 is an amazing car. I take a test drive of it and it is good in every field. The drive quality is really awesome. The features in this car are quite impressive. But one thing that disappoint me is the sunroof which is ordinary I think this car should have a Panaromic sunroof.", "It is one of my dream suv, I love all of it features inside the vehicle and it not too expensive compared to other companies vehicle on same feature, i am going to buy as soon as possible in this year", "Great car at this price point. Compare with other cars in this SUVs segment, great value for money car specially for those who wants to buy a big luxury SUV in under 40 lack price bracket. Great features .", "", "", "I must say its better than fortuner what an relaxy and noise free cabin it has. I had driven continues 300km no problem at all no engines noise just silent cabin Best part is i got 7 lakhs cheaper than fortuner top model", "Very good car . Mahindra car is very amazing cars. Now new upcoming alturas 4wd car is wonder full car . Price better then ever whole brand. Amazing feature of car. Most powerfull engine. My dream car", "i think it is better than fortuner and has tons of features... loved it.. xuv 500 has lots of features and has ambient light setup so for this model ithink they wont compermise on specs and features.. best in class and is economical compared to the competitors on its segment. it also got panoramic sunroof.. well done mahindra", "I have purchase new alturus this is very amazing suv i like this . Experience on my behalf this car is very good like driving skills, very usefull features , and very strong point 9 airbag , in this segment suvs not prefer 9 airbag only alturus gives 9 airbag .And price also good.so i suggest u if you planed new suv in this segment u by this.", "It is Mind blowing .... Dreamy SUV in my life.... On Indian Road... We know Raods of India , is Fabulous idea for purchase of our Own Iandian Made Company Car is honour of all Indian , we are not behind the world... Thanks Anand Mahindra sir... giving opportunity to Indians . We need Change as per Situation .", "Fabulous car at that price. Its amazing i heard about the features about it and i felt extremely happy.Wonderfull car for off road driving.I would like purchase the car as early as possible.I liked the car very much.Its the best car which i had never seen at that price with all features.So i would suggest all to buy Mahindra Alturas G4 4WD AT.", "", "", "This is Mahindra’s new flagship, the second-gen Rexton, which has been named the Alturas G4. This premium product is meant to give the brand a new lease of life in the segment contending with the full-size seven-seat rivals like the Toyota Fortuner and Ford Endeavour. It is offered as an automatic in both 4X2 and 4X4 trims.", "Ride quality of this car is fabulous but fortuner owner will not take it as they give 3 lakh extra and don't get comffy car at that price bracket handling of car is on the grea t side , steering becomes hard as hard u apply the throttle, immense power than fortuner and the quickest of the three . Someone planning to buy this car will b very good decision and 3rd row of every car is best suited for kids but adult of size 5'3 can seat comfortably and for under thigh support u can pay 3 to 4K for getting good under thigh support", "The Mahindra India is very consistent in launching new and trendy design sports utility vehicles with advanced technology features and high reliable performance factors. The new Mahindra Alturas G4 4WD AT exteriors feature HID headlamps with LED daytime running lights, LED fog lamp with cornering function, chrome front grille, LED tail lamps and rear spoiler with LED lamp. The interiors feature an eight-way adjust driver seat with memory function, instrument cluster with 17.78cm TFT LCD, Nappa leather interiors in a tan and black scheme, dual-zone automatic temperature control, and infotainment system with 20.32 cm touchscreen display, six speakers and steering-mounted controls. The safety features of nine airbags, electronic stability program, traction control, active rollover protection, hill descent control system, emergency stop signal system and park assist system are featured as a standard.", "Worth the money, packed features which is best in its class, really like the style and exteriors, very well managed space, luxury interiors with best quality materials, great styling compare to other rivals like fortuner and endeavour, will definitely win awards in a row, would be a best seller all the time", "This car have very riched features. Amazing look every youth like this car more about this car I like interior of this car very unique . All colour of this car is very good suit for our status. More over I explain this car is very good I like it and I want to buy this car because trust of mahindra company..", "This is very good car in this segment really this is very amazing i loved this car fortuner and endeavour not defeated this car in any option like driving skills, safety features,interior looks suspension ,brake ,picup,and very good point mileage, and they also hive 1 lakh km warranty is very good . so i suggest u with my personal experience if u purchased new suv so ur first choice is alturus .", "I think this SUV has best in class features because the company has provided it with Mercedes Benz gear box and has great stability on road. And this car comes in black upper finish This car has ventilated seats This car comes in 2 variants 2WD AND 4WD The buyer should purchase according to their need but there is not more difference in their price approx 4lacks deference is there.", "Better than Toyota fourtuner, very good riding experience, amazing driving experience , good performance in all type roads, very good comfort and space , exterior and interior of the SUV much better than other suv, features is excellent great riding quality, value for money product by Mahindra.......", "Stunning car in this price range, luxary car from mahindra, superb interior with wooden finish, colours are really premium, engine is smooth, no problem on gear box, should recommend everyone to buy this who finds a good luxary car in this price range. Thank u mahindra for this stunning car, I expect to buy this on 1st January.", "More spacious and beautiful than a toyota fortuner or a ford endeavour. Though i own a new generation fortuner but the Mahindra Alturas was more fun to drive. Amazing value for money. Surely looking forward to buy one for offroad thrills ... As i said the predetor has just come and the hunt has just started", "Acc.to a single test drive any of us can not judge a life, and longterm performance of any vehicle. But after entering in the cabin of the car everyone should fell like.......is not sitting in mahindra,it properly feels like the Mercedes gls. Engine is also very refined and well tuned, we hardly hear the outside voice in the cabin whether its of engine, tyres and any other type of voice. Ride is bumpy as compared to its other rivals. But afterall don't feel uncomfort.", "Very good SUV better than fortuner very exilate futures low price other XUV cars very smooth drive long root is comfortable suv vary exilate futures dimand cat alloys is very good boot open is exilate futures 2 opson 4x4 and 4x2 is very good option this car is Mahindra Velue for money SUV car good job Mahindra thanks"]}