{"0": [], "1": [], "2": ["Justified price! This car is capable enough to get you through hill stations handily though it lacks some amount of power on highways. The car is decent in its space and toughness however a 4wd would have been a plus, Overall a good package for a person looking for a utility vehicle for bad roads."], "3": ["Justified price! This car is capable enough to get you through hill stations handily though it lacks some amount of power on highways. The car is decent in its space and toughness however a 4wd would have been a plus, Overall a good package for a person looking for a utility vehicle for bad roads."], "4": ["I want to buy b4 variant .it looks fabulous . I have never seen such type of suv of other brand. Also feeling excellent while driving.", "This is an awesome SUV one with mid-segment income can buy. It is loaded with multiple features as other high segment SUVs have. However, there are lots of improvements like adjustable steering wheel, touchscreen infotainment system, rear ac vents and more when added, will increase the vehicle's popularity among it's prospective buyers.", "It is my favorite car while driving I feel very comfortable awesome and off-roading with this car is unbelievable. Bolero looks very nice in this segment Really Mahindra was providing the best vehicle to citizens of India", "Mahindra Bolero is a nice car and it is very special for every Indian.The maintenance cost is very nominal and mileage is also good.The Mahindra Bolero doesn't have features.But it is a good car for rural areas because it passes big and small patches very easily.And the build quality is also good.It will not give you comfort as other cars offer.", "Nice prices to value it is helpful to checking all features and price it is wonderful application using to all the subscription it works best."], "5": ["Good drive and control, very good look. I like this car. Good colour options.", "I want to buy b4 variant .it looks fabulous . I have never seen such type of suv of other brand. Also feeling excellent while driving.", "It is my favorite car while driving I feel very comfortable awesome and off-roading with this car is unbelievable. Bolero looks very nice in this segment Really Mahindra was providing the best vehicle to citizens of India", "Mahindra Bolero is a nice car and it is very special for every Indian.The maintenance cost is very nominal and mileage is also good.The Mahindra Bolero doesn't have features.But it is a good car for rural areas because it passes big and small patches very easily.And the build quality is also good.It will not give you comfort as other cars offer.", "Nice prices to value it is helpful to checking all features and price it is wonderful application using to all the subscription it works best.", "Driving experience is good, and car look were is almost good and servicing and maintenance low, buying experience is good and budgeted cars this car is a Family car, and seats is full.", "While booking the Mahindra team was full supportive and fast delivery, this car is such an gem of steel with wheels, Infact you will have great commanding view with confidence, i just modified with music system and seat covers in order to maintain better state... This car could have tried to come with black colour, cornering headlamps, rear a/c vents, sound insulation, touch display and good arm rest for driver and co driver as well... Definitely this could kill other SUVs in the market. If u like to go with the ruggedness at some places try to have test drive with this beauty, you will never change your decision to other...", "I am have 2006 bolero this car very low maintenance cost and best for both off-road and City road. I request to Mahindra for please give Thar Diesel engine and give more feature and safety."]}