{"0": [], "1": [], "2": [], "3": ["Great decision to choose Easy to drive Commanding position Value for money Easy and pocket friendly Full like suv car Though and reliable Most of valuable features are missing"], "4": ["Gives a better driving experience its well good for low budget 7seater Its some what less comfort. Bolero neo with new look impressive Than older one......", "Most value for money suv a big and dashing look and rwd drive gives u a very good experience interior gives you a very luxury feel at this price no company gives you this type of big suv and features in any other car", "Mahindra Bolero Neo is fantastic in look.My brother going to purchase it.It's exterior and interior is absolutely good and so comfortable.It's amazing performance and good in mileage also.It's logo give new look to it make it more eye catching look.It's interior is also very good and has much space and more comfortable.It's dashboard,gear box, display is very good.", "Reliable and value for money very good and comfortable car, Powerful Torque Engine, Excellent mileage."], "5": ["This is a real Sub 4M SUV amidst all enlarged Hatchbacks. Strong built Ladder chassis with body on frame set up, Neo gives you a wonderful driving experience. Bigger seats gives you enough comfort in the front row and a big bench seat gives ample space for 3 persons to sit freely. The engine power is very good and low end torque is amazing. Visibility to the driver is very clear and one can feel like placed very high in the driving seat. Mileage is 10-12 in ghats, 14-16 in cities and around 18 on highways. Touches 20 based upon one's driving. Big and spacious cabin, strong AC Unit, very useful info on instrument cluster, decent music system makes it a real winner. I had completed 10000km with my Bolero Neo N10 Napoli Black. I am completely satisfied and happy that I made a right choice over all other enlarged Hatchbacks. but not the least, off roading capabilities were amazing and can strongly recommend this as a semi off roader.", "Most value for money suv a big and dashing look and rwd drive gives u a very good experience interior gives you a very luxury feel at this price no company gives you this type of big suv and features in any other car", "Mahindra Bolero Neo is fantastic in look.My brother going to purchase it.It's exterior and interior is absolutely good and so comfortable.It's amazing performance and good in mileage also.It's logo give new look to it make it more eye catching look.It's interior is also very good and has much space and more comfortable.It's dashboard,gear box, display is very good.", "Reliable and value for money very good and comfortable car, Powerful Torque Engine, Excellent mileage.", "Will purchase soon Looks and performance Driving experience is excellent, buying experience driving experience details about looks and car performance is nice servicing and maintenance is also low cost."]}