{"0": [], "1": ["Car is very good in driving ....but My kuv100 k+ battary is found crack after three month . I have Many complaint to customer care and dealar but no solution. I want that company will replace my battery. I bought this car on 22/1/2019", "Car look is good but not good for back side and very bad mileage 8 kmpl in local and 13.5 kmpl in highway. This car is my 1st car and car experience is to bad. This car is not for valuable product.", "Low mileage I m enjoying car but mileage very poor service also not responsible car out looking good rate also good car comfortable nice A/C very good.first only complete but mileage is very low.plz do good mileage after complete the second service.buying experience is good. Is any change to increase the mileage? Only negative thing in the car is mileage.", "Brought the Car in 2017., Since from the day its more horrible in door noise and the rust complaints till now. its bitter to drive the car in such negative. service is pathetic in.", "1. Buying experience: It is always good with any seller, I mean you are giving the business by putting your hard-earned money in their pockets. 2. Driving experience: There will be loud noise always entering in your cabin, the engine lacks that punch, fuel economy is poor. The only good thing is the air conditioning this is extremely good. 3. No complaints about looks: You will love the look, that beefy and chunky look. 4. Service and maintenance: Here come the points where you will have nightmares, pathetic service centres full of liars and crooks always hungry to loot you. They are literally harassers. Pathetic Pathetic Pathetic.", "Worst car ever..! Main problems:- 1.No mileage (10kmp in the city) petrol variant 2.No pickup 3.No proper service at the showroom. 4.No spare parts are available. 5. Steering is hard. 6.Engine noise. NEVER TRY TO GET THIS CAR... NEVER EVER DO THIS DARE..! THERE ARE LOT PEOPLE OUT SUFFERING from THIS VEHICLE...", "Full of tensions bakwas car vert bad milage bad bad bad bad very bad i have drive only 10000 km and its make much noise in cabin so i had a very bad experience of this mini suv ghatiya invention hai mahindra walo ka ek dum bekar i don,t want to ise it i want to exchange it with other one plz do something anand mahindra sir", "I have just borough five months back and twice changed Clutch box and charge is very high. First time it got fail 300 km and Second time after 3900km. We are facing frequently this issue and not getting proper response from service center.", "Review after driving 70000kms. Poor milage in diesel just 14kmpl. Problem in gear shifting and gear box since very beginning. Problem in Clutch, wire breaks very frequently. Hand break is just for namesake. Car shakes and vibrate a lot. One should not even dare to think about buying KUV. Anabd Mahindra should look into it Don't buy this Car!", "Mileage very poor myk2 petrol mileage 8km/l inly without ac. Service staff not cooperated. Very roodly behaved with me and not receive any complaints of against kuv 100. He told your driveing is poor .", "No fuel economy Bad after sale service No pickup No mileage Hight vibration Problem with gear shift Issue with paint Issue with speakers Only gives you feel of driving SUV I advise to go with other options available in market, soon I am doing the same,,,", "Worst car in its segment, poor milage, pour pickup and very much noise in cabin. I have too much bad experience of this car. Don't buy Mahindra cars ..... Mahindra cannot fulfill their promise to the customers, I had driven this car atleast two years . We are not doing comfortable drive till date so we are requested to all my friends never buy any car from Mahindra Because they will not full fil their promise of the customers", "The shittiest car ever I'm writing this review after driving 60,000 kms in 3 years Please save your hard-earned money don't buy this car. 1. This car viberates a lot it feels like you are sitting in auto rikshaw 2. When you drive it above the speed of 100kmph it starts shaking. 3. It has a unique position of hand break and at same time it is useless it has been third time that hand break has come off from console. The moment you get it fixed very next day it is like as there is no hand break. 4. Major issue with gear box i have got it fixed twice under warranty. Because of this failure i was about meet with life threatening accident. 5. Pathetic customer care and car service. They force you to give 10 star after servicing your car. Over all it is tin ka dabba. Paison ko aag lagani ho thrn buy kuv", "This car good but average is 16-17 only company is saying 25.36 and ac not cooling proper and ind sometime date problem and heavy noise of of engine and vibration also on this engine", "Hi, I bought KUV 100 2 years back, and since than i am facing Fuel avg. and pickup problem which company is not able to resolve yet by saying that the car is perfectly fine and doesn't need any improvements. Pickup at 1st and 2nd gears are so horrible that it feels like i am driving a hatchback with CNG installed, where my car runs purely on petrol. Maximum Average i have attained till date is 9-9.5. And when ever i go to Mahindra stating about there average issue, they have only one solution for it, will take you to a long express-way ride for 200 KMs, driving at a maximum speed of 70-80 KM/H at 5th gear, which is the most ideal condition and the will show compare that provided average to the one of city driving conditions. Space and interiors of KUV are too at the bitter side, where there is no second row space for passengers (feels like you are sitting in santro/alto) and the interiors are also just ok, could have been better. One positive area of the car is its looks, and there too its all depends on personal choices. As it has a different stance, where many like the looks of it and many doesn't. So it all depends on personal choice where i liked the looks of the car bcoz of which i purchased without going through reviews, as i have one Scorpio also from last 7 years and i am very happy with Scorpio and thought the same at time of buying KUV 100 but now regrets my decision. And suggest every one not to go on just looks, read proper car reviews before buying one. At Service and Maintenance part, the cost is low where its almost two years, i have gone through just services with 20k of meter clocked till date. Suggestion- Not to go for any Mahindra Petrol product.", "Poor Riding experience... Too much bumpy, hopeless servicing and maintenance... The servicing center mechanics broke the AC filter and windshield on the 1st servicing. Waiting to replace it. Regretting why I bought this car... the only good thing is waiting in the service center lounge for 4-5 hours to hear them asking me to come tomorrow... they know how to waste my days....", "The most worst car in the world, if u needs to change any spare you should wait for 2 months, and resale value is too bad if u get this car for 8 lakhs, it will go only for just 3.25 lakhs within 2 years and also just 30000 kilometers run, please don't get this vehicle, don't get any mahindra vehicle except Bolero and Thar, this is my friendly advice", "Exchange value is very low in market also in mahindra showroom. More vibrations from engine side and rear side. in long drive , steering is hard .body is heavy so protection is good .on driving jerking is feeling due to this journey in rear seat is very bad so ommitting tendency is feeling especially in children", "This was my love at first sight,so i bought it in april 2016 when this was launched. Pick up was very poor.on highway this car could not over take .there was problem in breaks .i met accident due to breaks.in two years problem of mixing of engine oil with coolant has been corrected by service station for which i had paid once.presently it is in service station for problem in engine.it is stopping on road.i feel if i die in accident on road .this will be for this car.", "Don't buy this car I have kuv100 6+ from past 5months my car at service center due reverse gear issue, I have given more than 10 times for the same issue but still not yet resolved, I have lodged consumer forum, and now I got no that my vehicle door has damage by service people at service center, and they are not informed about the damage, without my knowledge they are painted the car, check the below deference Kindly check before delivery of your vehicle again and again It happens at sheerish auto bangalore", "Don’t Buy this car It’s my personal experience Poor Quality Poor Mileage It’s only good for short time drives Worst for long drive Most worst thing in this car is it’s seat Quality, Very cheap seat. Body look is nice . Interior look is nice That’s it .", "Exterior Very good exterior look. Paint quality is good and good looking head lamp, bumper. I like the exterior very much. The DNA is maintained.\nGood LookPoor mileage, Bad plastics, poor performance", "The design seems to be overdone from the side, however, it does look good from the front. The rear bumper does not stick out, this could hamper the body if there is a crash from back. MAIN ABOUT THIS CAR IS SO POOR MILAGE PER LTR IS 11 IS TOWN' AND HIGHWAY 13 per LTR.Mahindra KUV100 petrol variant does not give you the pleasure of driving on long distance, seems to lag. However, this is great as a commuter car inside the city and does its job. The turning radius is longer compared to Maruti Swift, being an SUV-inspired KUV100, this could have been thought out. As for the reversing the car, the visibility is quite low due to the c-pillars, it looks crowded and a rear parking sensor and camera would have taken care of this issue. Apart from the above drawbacks, some little details like OVRMs, when moved against, you find it hard. If a biker hits the mirror, a possibility of breaking it is possible. Also, the fuel tank is 35 litres is smaller compared to Swift's 42 litres and Hyundai Grand i10 43 litres.", "I brought Kuv 100 k6 diesel variant on Oct'2017 wb66xXXXX but after 8th month it has start a starting problem. When I crank the key engine has stop after some vibration. 2-3 time I go to showroom but they are unable to short out my problem. Some time when I plane to go out side hometown I am very scared. I am very mutch fade up.\nNANA"], "2": ["Ought to have more boot space. Too much space is there inside the bonnet. Just an additional 100 mm body length behind rear axle would have made it elegant and utilizable.", "Mahindra has given a good throw for the budget segment car this time. I don't recommend this car to anyone who has more than 6 lakhs budget. This car is a personal choice, like if you have a low budget and want a feel of suv, especially if you have tired of usual medium and mini hatch back then I recommend this . for 6 lakhs. It gives apt performance and has so many parallel flaws which you will not get bothered about it later as it gives us an amazing ride quality (long drive as well). As Mahindra cars aren't good with petrol engines it's giving moderate mileage, but the engine picks up so fast and quick and have a moderate off-road capabilities. So the impressive things are: Good ride quality Elevated seating Very spacious, perhaps huge for a car at this budget Super powered and build quality is 10/10 Passenger seats are too way comfortable Some off-road capabilities and good service Good and efficient hydraulic power steering so that it won't slip away at high speeds Stylish looks Powerful AC chamber Heavy vehicle Major issues: Poor mileage (hardly 13 & maximum 15 which is rare ) Bad engine insulation, so the vibe will reflect on gear which is very disgusting like the old Mahindra Major If these two major problems can be solved it's a very good car The same EV is coming and it will be good only if the price won't go high", "Low mileage I m enjoying car but mileage very poor service also not responsible car out looking good rate also good car comfortable nice A/C very good.first only complete but mileage is very low.plz do good mileage after complete the second service.buying experience is good. Is any change to increase the mileage? Only negative thing in the car is mileage.", "Seat quality is not good & comfort for long drive. In this car no locking system of seat they promote accident. Seat fabrics & cushion also not good. I purchase this car and complaint about seat quality and other issue but till date not solve my problem. This car looking wise is good but not comfortable for long drive.", "Mileage is only between 9 to 10 kmpl without AC. In 8 months 4 times I had a problem in starting my car and had to take help of Road side assistance to start the car. Had sent my car to workshop for identification of problem, they said everything is ok but same problem is persisting. Too noisy inside", "Exterior Car Looks ugly from the side view, Front and Rearview Looks ok, There are no many colors available, you have to change your mind.\n There is no 6th seat, Could have been added some more legroom both front and back seats, Missing foldable seat.\nPerformance with little noisePoor boot and Luggage space, From side view the car look ugly, Dont think of 6th seat", "I bought kuv 100 by first owner i read many reviews about it n think its value for money in fuel efficacy but after driving i totaly disapponited by averge of this car when i went to service center they say it incerses after 1 st service but after service its same as before service it make me frustrated so i dont no what to do...."], "3": ["Good and comfort , stylish value for money, in comparative, really local for vocal rear style could have done better seem Mahindra will do some changes in rear look as the front look is aggressive.", "Good car space which is best and its one of the unique feature.", "I bought that car, looks good ,excellent pickup, low maintenance cost and service also good , this car is very good . Mahindra gives very good service and excellent support with excellent service team.", "Car is ok to buy as offers value for money in the segment with Mini SUV looks. It has good joystick type gear knob. Car is fun to drive and has a spacious cabin with good inside space.", "Never buy this vehicle... Other cars in segment offers better... The worst clutch and gear box of all other cars... It's a very bad experience with this car... Driving from past 4 years.... I would never suggest anyone to buy this and I'll convince not to go for this car", "I am getting mileage 10 at City at my kuv 100 k6 petrol solve that problem systems are so good and comfortable sits driving also smooth maintenance also good car looking also a good style.", "Its was good initially. but now its like without power vibrate the car like anything its diesel k 6 2016.i ran this around 35000 kms. No resale value turning radius and stearing control is also not that good clutch is very hard gear gets stuck from day one they have changed every part in recall now my car is not even under warranty again m getting problems with gearbox clutch stearing reck is also not good. the suspension is good but a lot of body roll. built quality is good", "I have bought 2016 model but it's mounting of engine ere totally wrong, vibration too high, starting hardness, backside suspension sock up mounting is required copied other vehicle and use vvt engine.", "Kuv 100 k6 I used this car past 2 years I fase more problems Brake ,engine oil & coolent mixing for past 2month before then Clutch not working for some times so Gear not work ple find the application...", "Please change back side and back spesh and inner Desh bord Ko ki hight kam karo and feul average not good in petrol verison iner space and comfort good front look is good but back side digin not good other configurations is very good", "Buying experience: Using kuv 100 next k2 for last 7 months, bought from Supreme motors, Howrah with hassle free experience\nRiding experience: 14 inches Bridgestone tyres are quite road friendly and with nice grip. Though at high speed, I get certain bumpy rides\nDetails about looks, performance etc: K2 is a base model with all manual adjustments. The best thing is the car doesn't look that small in comparison to other similar hatchbacks and has quite nice ground clearance\nServicing and maintenance: Poor servicing and always have some battery issues with this car( as I have seen others also suffering the same)", "Buying experience: When I bought this car, I was not sure that the space wise about this car could cause a lot related to comfort. It doesn't have enough space in the boot which is huge disappointing.\nRiding experience: Very good experience but it has road noise which discomforts the journey.\nDetails about looks, performance etc: Looks great but it can be more better from the rear side.\nServicing and maintenance: Low maintenance car and really comfortable to drive.\nPros and Cons: I love the interior comfort of this car and there are many things to be ignored of this car one of them is engine noise and boot space", "Great awesome masterpiece suv type best in space style comfort price and can be a major exception for the suv buyers very much like suv and best in looks jumpers also so well managed and calibrated brakes awesome lights new design attract more and more customers no risk of touching on roads no matter how much the weight it carries", "This car looks great but we take about setting capacity is not 6 person it's only for 5. And when I buy this car so it is easy to approach in this segment this car fetchers are very good not believeabl. I am getting good service after sell. But car on rode given average only 11km to 12 km per liter. If midium class people like to buy suv type car so buy this car.", "Its good to buy a Mahindra vehicle always Riding could be much better it lacks the feel of steadiness in a car of Mahindra Looks are not flashy but especially in variants smaller than K4, 15 inch tires gives a sense to the car i ll suggest one can go for Aftermarket alloys to give a grt look to the odd ball looking car Services are best from Mahindra Dealears due to there expertise and a very vast Service network Pros Suvish feel in the budget of a hatchba k Good Stirage space and airy Cons Looks are still a problem Lack of refinement Could be more better and classy", "Buying experience : Good Riding experience: Because of hegiht, we get a better view. Easy to change gears.. Engine make more noise compare to other cars. Details about looks, performance etc: It looks good. Interior is also not bad. I must say its specious from inside. On Highway gives 17-18 km mileage for petrol version. But within the city, you hardly get 10-12 Servicing and maintenance: So far they have provided good services ( First 3 Free Services). Its new in market so cant say about maintenance right now. Recently my car's fuel pipe line was cut by rat. I was searching that part in the market near to my location. I did not get that part in any local store. Its a big drawback of KUV 100. Even I was trying to get help from them on toll free number(on sunday), I did not get much information. Service centers landlines were just ringing and no one was there to pick up call. So I must say in terms of Service & Maintanance, its going to be more worst. I am really disappointed.", "It's good amazing. But need a Automatic. If you have any idea automatic (kuv100 ) making new version. I really exchange my kuv 100. I have new kuv100 2017 model car. Also price it's too cost petrol car. Because now petrol over to over every day I mean money. Middle class family members need financial problems. So please just suggesting my review.\nNANA", "I purchased before 1 month ago, looks good. Not comfort to drive because steering is hard. Avg is ok. Interior is good. Heavy material used. Company have to improve smoothness of drive. Otherwise all over ia good. Response also good from dealer. Price of car is also good compare to other car. Avg car ok\nNANA", "The vehicle is good in all aspects except the following. Poor mileage. Of course the boot space is enough but a mere 10 cm increase in body length would have got 300Ltrs and a catchy side view. The car charger should have been on the driver's side of dash board so that th legroom for middle seat be improved.", "Mahindra KUV 100 nxt, good and powerful car. Looks stylish and? muscular, Mileage around 23 kmpl on highways. Young combination of hatchback and suv. One of a kind. 6 seater. Armrest and gear shift on dashboard is unique and good. I highly recommend this car to all those who wants SUV and hatchback.\nNANA", "Car is good power is excellent every thing is ok. No douggt car is best but millage in petrol varient 12 to 15.1 km/l maxmimum that I absorb both hightway and off road. Today other car gives more then 20 so why kuv not, car is good but in disel vareint and the wheel tyre is 14. It should be replaced to 15 because car is big so why tyre could not. Many thing that we absorb after 5 months from the date of purchase.\nNANA", "I was fooled at the time of booking itself by the sales executive Mr Vinod of Sireesh auto, Rajajinagar Bangalore. I since they didn't have the Diesel white car, they managed to brain wash me to purchase white petrol car.\nNANA", "Hi friends,\nI buy Kuv nxt k8 petrol And drive 1000 km yet It's good looking car Nice space as well Good Sefty features And feature loaded car 7 Inc infotainment is highlight in nxt But only problem is fuel economy is very poor but still I love to drive Kuv nxt it's gives fill like SUV And performance is also nice If u looking mini SUV in low price Kuv nxt is best option.\nNANA", "Version: K2 + Mahindra accessories.\nCost: 5.5 Lakh on-road (Bangalore) (including all Power windows, Central locking, Music system, reverse parking sensor, Fog lamps).\nSpaceMileage", "Riding/driving like very good handling even any condition/road, only thing that left side poor viewing. Advantage for tall person design SUV look in diesel more mileage and comfort. Suspension are well design for bad roads. value for money but, resale very low. Service cost also low.\nNANA"], "4": ["Good car good mileage good space and power steering power window airbags is good and ground surfing is good best drive is long drive but no problem and comfortable space must price.", "Car is of good shape in this segment. It is good and pocket friendly. Good service, mileage is not too good but nice power and stable with 6 persons, no lagging on long drives and all is very good. Side mirror is little bad while turning towards the right side.", "Buying experience is great at Mahindra. Looks is average & maintenance is mediocre. It is a D75 Diesel Pros: Ample of Space, tall stance, roughed, features, fuel economy is reasonable Cons: Boot space & average looks", "Buying experience is good, showroom executives are very good, driving experience is also good. Looks is good from front and rear view but side view not that good. Performance is moderate, relax driving but not punchy engine, interior fit & finish is not good, have rattling in dashboard over potholes, servicing & maintenance is good. colour quality is not good. Overall good car for first time buyers who wants good space and SUV like driving feeling.", "Cons: Mileage is pretty low 12 to 13 km/l hardly. Maintenance takes 6 k every visit. Hand brake is uncomfortable to use need to keep car in 1 St gear in parking. Pros: Build quality is pretty good, it's very easy to put gear hence in near by steering , drive quality is awesome. It's very fun to drive . Overall good for family and trips with friends . Boots space is 220 which is less for 4 to 5 members, I had to put carrier above to solve this issue. Front extra seat is good for children and lean person I don't recommend it for adults for very long drive.", "Car is much better in driving...but service light issue is come in only 5000 km ..I have complaint many times to customer care and dealer after that catalic converter is found faulty ..car is in under warranty but no solution ride this car only 15000 till now ... Mahindra warranty is very poor compare to other", "I bought new kuv 100 nxt K8 and I feel too the good after driving so comfortable for me as me height is 6.3 little bit engine noise inside but better feel like SUV pick up is good interiors are better than other seats are comfortable driving is good enough instruments are nice lights speakers good space for the person sitting behind the driver's seat", "It's a very nice compact SUV I love its exterior design and comfort for passengers. Also a trusted Indian brand Mahindra. When I used to drive this car it feels like smooth as butter on highways and even in the city.", "Looks are cool in dual tone colour, compact and easy driving in city, petrol avgs around 14 in city, maintenance easy only drawback is limited features even in top model. Happy to have it.", "Ye aachi car hai agar Aap lo budget me suv ka maza lena chahte ho gaadi me space aachi hai but bootspace thoda or hota to behtar rahta any way ye value for money hai mileage v hiway me 22 + hai diesel me", "I was the car for which I waited for many days but after buying it I feel that my choice was not good but the car Better than what I thought and its fuel economy is the poorest.But it is a good car.", "Kuv100 k2 plus petrol I drivers 7000 km it is bust car for middle class family look is very perimum Suv bust to use in off roding I reach top speed is 150 km it mileage highway 15 to 16 decent on speed I love this car best to buy goood", "Nice car Service good Maintenance low, Seat 6 Performance good Top speed 160 I like kuv ?? NextGen My family wali car Specifically New fiction engine powerful Mileage 16 Nice car\nNANA", "It's look so cute car ride fabulous I really want to buy that car car riding experience is so nice i plan to buy that car Early . That car servicing and maintenance are easy and not costly.", "On this price smooth and comfortable car... Mahindra brings to us very handy .. I told everyone use that Test that  Hatesup...\nNANA", "Buying experience: If you had been to maruti showrooms and compare with Mahindra. Not the best of customer centric approach.\nRiding experience: KUV is a under rated product I don't know why. This is very good vehicle to drive and with full of features at a very competitive price\nDetails about looks, performance etc: Looks from front are awesome, VDRL gives sharpness to the KUV. Breaking is excellent and gives full control when driving.\nServicing and maintenance: Service is unlike any SUV, cost of service is similar to a small car like celerio.\nPros and Cons: Safety features, breaking, front looks, seating location at a height gives it a strong presence on road as pros Cons are cabin noise at high speed", "It's car is feeling SUV segment It's looking is very nice interior and exterior Is me six logo ki bhetne ki jayghe hai Is ka sound system is very nice Transmission system is uesr friendly hai", "Buying experience was great , dealer negotiated on price and also provided some extra benefits. Ride quality was awesome ,looks like fun to drive car for me, minimal body roll, properly tuned suspensions to soak bumps. Looks are modern and stylish, diesel engine performance is good, no need to downshift gears for overtaking, mileage is about 19-22 depending on city or highway drive. You get all latest features that a person needs.. Services in starting are free .. but then also the cost is genuine and parts are also not costly. And also it's Indian company product which is well built. Safety prospective is also covered with abs and airbags.. I fell very satisfied after purchasing xuv100", "I'm not a reviewer so I'm going to tell details according to heading shared by page. Buying experience I have Maruti car but buying experience was quite different for that in the form of presentation, delivery, handover, also they gifted us flower plant with a good pot. it was not just like that experience also body language of Mahindra persons was so good. Riding experience Quit good, no noice, I've bought this mini suv in only 4.85 lac so in this price it is very very good. I've seen a review of this car's with top model that says it is not a good car with 7-8 lac budget. The review should be given with lowest model also. Details about looks, performance etc. Looks good from front, on off roads like village roads with only mud and water car gives no issue, i have used so many times in these roads performance is impressive because on those tracks I've seen only large SUV's scorpio, XUV, TUV, duster. Servicing and maintenance Cost is also low in one year I have paid only 1300. Pros and Cons *Good performance, engine is same in cc like *Baleno, swift, breeza, thoda uper niche hoga but 4.85 lac ki kuv car and 7+ lac ki all others car hai to price difference matters. *Good after sales service. *Easily get pick up. *Low maintenance. *Good pricing 4.85 lac, in this price u can compare it with Maruti vagan r, few of wagon r model r too costly and small and not appealing like this kuv. *Good visibility, I have trained my wife with this car even I have a Maruti car just because of good visibility and easy on clutch. Not found any cons till now just because of price and size and power because of its engine is same in cc with Baleno, swift I have compered cc only on sites with rounding off.\nNANA", "KUV100 NXT, basically I m an engineer it is my first car, riding experience is awesome I drive for the first time non stop about 730 km from Azamgarh to Nainital awesome experience, mileage was? jhakassss, maintenance cost is till now only 2700 Rs.all in short best car in low budget with SUV feel.\nNANA", "Most releavent to midium size family as this car has 6 person sitting capacity, we dont have any other car in the market with same featured and mahindra is most reliable indian brand.", "I bought this car for its powerfull diesel engine and compact size for city driving. I am completely satisfied with it but mahindra could make better interior quality. Pros- Better engine power. Comfortable for 6' tollboy. Smooth suspension. Has also ABS & EBD with broad tyres in its segment. Comfortable for city driving or parking in little space. Cons. Engine noise is little more in deisel variant. Engine noise and vibrations can feel at 120kmpl. Body rolling is present. Real milage of diesel engine is about 17/18 kmpl where mahindra claimed 24kmpl. There are some noise sometimes in interior Trims and dashboard in pothholes driving. Overall buid quality of mahindra is above average. ????", "Value for money.best in driving.more comfortable looks are too good.feel like drive a solid car on road. On highway its superb in drive for long tour. Milage is not so much but compare to comfortable its in budget. If you want to drive a rocking car you should take a test drive of it. I bet you feel a good experience", "Its a great experience.Very cute car! What can you do for a small car.Small car and cool car.Its pick up performance is a little bitIs a little less.But goodThank you to Mahindra that this car has been made and kept making such a car.Good for the middle class people.Mahindra Engineer is very diligent and he deserves thanks", "It good mini suv. Looks good. good specs. I am bay base model. What now I am wari why no take top model. Can Any one advise me hv also Mahindra KUV100. Want to install touch screen stereo with bluetooth. But KUV100 has single din head so double din stereo cant be installed Are Single Din stereo with touch screen display available ? And yes..we few kuv owners have whatsapp group for kuv.\nNANA", "Look is amazing. Interior designed as classic as we need. Ultimately ride was so smooth and experience was awesome. Front look is just like XUVs which attract viewers and we were appreciated for having a kuv car. Foot space is too much as comforts. Need remote lock in this car so that could enhance the feature for being perfect.", "Firstly to tell about the buying experience was not that pleasant . The riding experience was very good . We have driven it in off-roads many a times , it is a rough competetor in offroading even in monsoon .The looks of the car is muscular and stylish mainly in dual tone with good interiors better than that of the Maruti Suzuki and you have good safety in this car which is very important . you have features like touch screen infotainment system , automatic climate control ,airbags and the car is very comfortable five people can comfortably sit in this car and you have a good legroom and you have many bottle holders and you have extra storage but the boot space is not that sufficient when you have lot of luggage and there is dual tone dashboard which is stylish and the gear placement is good and the engine is quite powerful but the mileage of the car is not that convenient but overall the car is very good and I would like kuv to be in the top ten hatchbacks as it is way better than its competetor igniz which is no match with the kuv", "I am from Tunis , Tunisia , I bought my Mahindra KUV 100 K8 Nxt about three weeks ago . It is spacious enough , comfortable and well equiped . It has a good and smooth riding ( we can drive at the fifth gear in low speed 40 km / h at around 1400 rpm smoothly ) . During some heavy rains about two weeks ago , I was able to cross flooded zones rather easily . At the moment I drove approximately 900 km and I am very satisfied . the mileage noted is 12,5 kmpl ( test conditions : 100% use in urban area , 80% use of airco , two persons transported , good weather / average 30° Celcius , low wind ) . Since I am driving a new car with only few hundreds kilometers I've never been above 3000 rpm .", "Very good car. Suspension are good and height of car is best. Few disadvantage of this car is such that the steering is not smooth like Hyundai cars and clutch is hard. The dashboard height is high. And when power mode is switched to On then the average of car is so much reduce. Over all whole car is good.", "Awesome I m loving it thanks mahindra It's ride like king of the road I strongly recommend everyone to take test drive before you buy other cars in this budget there is nobody give you this much of happiness which this is provide It's really familiar xuv I again thanks to mahindra team for to provide these much of happiness.\nNANA", "I took base model at the time company offered around 50,000 offer When I drive around 400 km for the first time Reading quality was in sitting comfort is very very good I think seat height is you're not up to the mark how are you everything was good to hundred kilometres and it also working very fine butfourth gear hard overall remaining gear is very Smoot.\nNANA", "Mahindhra service is very good. I had a waiting period for 4 months which was too long. Riding is smooth and best offroader. Looks are very good and mileage is not that sufficient but still performance is very good. The gear next to the infotainment system is like smooth shift. I appreciate mahindhra for making such a wonderful car. It is very comfortable for long journeys. I have also sat in Ertiga and have gone to long Journeys,but it is very uncomfortable. KUV is best for long journeys.\nNANA", "The showroom salesmen promise you free services like is standard in all available cars, beware there are no free services from word go. Don't get fooled to believe these salesmen. The excuse is that on the manual it is mentioned free service means no labpur charges, unfortunately the manual only comes afyer your cheque is cashed and everything is paid for. The salesmen later acknowledge tgeir mistake but won't reverse charges. Beware of these fraudulent practices.", "my ride completed 10000 km, no issues yet, i want to share my experience during my trip to coorg. i was going in 40 speed in traffic, swift was overtaking me. unnoticingly i went to right side as i hit to swift. there was a big dent to swift above the left front wheel. but minor scratches to my kuv. thanks for the build quality.nice car still need to improve in some areas.", "Amazing car, Features are awesome Stereo is really good Muscular body Cool shape Really comfortable Love this car Good companion Budget best car I'm giving u the best review Mine is k6 If u want alloy wheel go for K8 Best for long route ABS system added Markable details Strong bass stereos Bluetooth availability.\nNANA", "Superb family car, it’s spacious and have good mileage though. Gear on dashboard makes easy to handle and the handrest comforts when on a long drive. Trust me, it has more space than other cars like Swift, Celerio and Amaze etc. Take a test drive with your family, you would get to know all the pros and cons. In my case there is no cons :)\nNANA", "", "", "", "I have Kuv 100 k4 + 6 str diesel car on one way highway 24.6 km/l milage. Speed mentain 60 to 80 .very good handling. No costly mentinance. Good car i have use last 2 year. In 2year mentinance cost first service 1270 rs. And second swrvice 3260 rs only. Good ground cleariance and good bild quality", "Muscles with bold looks, styling and performance. Spacious and run like boss on the road. Turns heads on the roads. Super combination of power and mileage. Feature loaded and understands indian road conditions well. Good suspension, feels like breeze on the highway, smooth and silent killer on the road. I myself own silver K6+ petrol with Highway mileage of 17-18 and city mileage of 14 - 15.\nNANA", "I brought my new kuv 100 nxt on 5 th Jan 2018 india garage mount road Chennai with help Mr Dilip so far travelled 2600 kilometres. Super strong n good road grip? Good spaces in the cabin can easily sit 6 people s inside the car n good mileage maximum. Speed I touched 140 without any vibration good car in the budget.\nNANA", "Super strong mini SUV car. K2 six sitar petrol long distance I am getting 16.5 kmp .l am very pleased to drive this car.City distance 13 to 14 kilometers per liter.My brother purchased kuv 100 petrol car .Then I have decided to purchase this car .I have carried seven persons with Driver at long distances about 250 kilometres. I am very happy to long journey", "KUV 100 next is really super. This car is high in its features. where no car can come closer to this car. India is made of all roads smooth, rough and many (curve )gats section roads believe it crusies like mini SUV. It's does not care any pathholes or curves. Pls do not believe in any car gurus in you tube. If you want feel it test drive now. I am sure u book Ur Mahindra nxt.\nNANA", "Most wonderful car I have ever driven. Small yet very powerful n smooth. Better than Sedan.. n very good for semi urban places. Also very good value for money.. good interior n gear position makes it best compact SUV. Surprisingly good to drive in bad roads n terrains. Experience it. m sure u will like the performance.\nNANA", "Im a proud owner of this new KUV 100 nxt petrol car purchased from M/s. Sireesh Auto pvt, Rajajinagar,Bangalore. Buying experience was extremely good. I extend my Thanks to the entire team. Sales consultant Mr. Samuel Vinod is professional marketing person, besides his unmatched service ans customer care. 2. So far i hv driven several vehicles with happy. But Im very happy with comfort of driving this vehicle. It has all the major features which a hi end vehicle is supposed to have. I driven few hundreds kms, so far i got 17+ km per litre. But good road grip. 3. New kuv 100 nxt looks good both exterior as well as interior. With 8 L, certainly its worth."], "5": ["This is a best family car and six seater so i like it and we can say off-road vehicle and it's interior and Design is very different and it's average is so cool and price is also good.", "Good car good mileage good space and power steering power window airbags is good and ground surfing is good best drive is long drive but no problem and comfortable space must price.", "Worst car compared to other company car in this segment kuv100 is very low and poor quality parts used i have fed up with Mahindra company in 5 years i have spent lot of money in replacing parts like radiator for engine heating in just 15 thousand kms run in 5 yrs. /Ball joint and suspension/ And coolant water leakage in dash board Worst company Mahindra and its products", "Car is of good shape in this segment. It is good and pocket friendly. Good service, mileage is not too good but nice power and stable with 6 persons, no lagging on long drives and all is very good. Side mirror is little bad while turning towards the right side.", "I have driven around 10000 kms and also 500 kms at a stretch, performance is awesome. It is a petrol engine with superb performance. Awesome experience beyond expectations. Fell in love with my car. Comfortable at long drives with great performance.", "I am using kuv100 k8 petrol since 2016 November, i am happy with my car, comfort nice, nice interior, only issue is low millage, but overall experience is good, have no reason to sell", "I used this car for last 2 years & driven more than 25000 km, it's amazing, in terms of power it's very good specially lower end torque in a petrol N.A engine is very good, driving & handling are also good, road grip are impressive. I usually drive this car for personal touring , throughout the country, I never face any problem with this one. Built quality are very good, I am driving since 1995, as per my experiences Mahindra make this car under a very low budget are really very good. According to weight, power & performance the mileage of this petrol motor definitely considerable in comparison with others car. In simple words the car is BEST IN CLASS...", "Over all good experince but in hilly areas bit lag. Buying experinces is gr8.driving experince is also good for long tours also it is amazing. Looks is very compact nd stylish suv at this budget. Service nd maintainace is also nominal.", "The car is nice and the build quality is good I hadn't still now didn't ride the car I just bought it from the showroom yesterday It looks is almost like SUV and it's engine is 3 cylinder but no sound is coming in the cabin. AC is working nicely It's gear and handbrake is in a nice place. It is six seater car but the front you can put down and use it like a arm rest and cup holders", "1.awesome 2.Its smooth and good 3.Its really fabulous looking 4.quiet normal price 5.6 seater available is good for family travel Cons:Reverse camera is not available only sensors available", "Very good car with power window power steering and a gear like a joystick alaround a nice car a good mileage and engine the price is also quite smart the service also very good.", "Recently I bought this car KUV NXT K8 TOP VARIANT. pros: it's a Rugged compact SUV mainly the height of the car is awesome even we will not feel any back pain even after driving from Hyderabad to Banglore which is about 600 Kms I didn't feel any strain Mahindra has done great work in the engine compartment the noise levels are really low sometimes I feel like the vehicle is on or off even standing outside very smooth engine being a 3 cylinder engine, and the built quality is Awesome superb car worth buying Cons: Mileage, on the highway I'm getting 16 to 20 if I drive below 100 that's good being a petrol vehicle and now the problem is in the city in city sometimes I get the average of 12 or 11 in traffic and even in normal roads city with gear changes and all And personally i feel power steering would have more smooth like swift even the kerb weight is higher than Swift but it's my personal feedback that steering smoothness and the response would have improved otherwise nothing much cons the vehicle Is superb loved it worth buying", "Carbis very good in interior and exterior. Sitting comfortable and driving experience is best and superb family muscular car Bad thing is milage only but it is accepted sitting is six person", "Love the car may car diesel model k2 20 km average A comfortable trip to Gujarat and Rajasthan nice cooling ac wov the 6 siting experience and comfortable car. Med in India.and support to Indian Brand.", "Usually, I wanted a hatchback which has an SUV stance. I went to see ecosport.but what we call is the comfort I didn't get... Then I saw the tvc of this cub... I was shocked that Mahindra has worked a lot on this car they were launching it then..... it was launched on 10 October 2017 and I booked that car on 21 of October I got the car by 15th of September........ The riding experience of me with this car is like we have gone very far places as I went to Rajasthan, Ladakh, and many other places... It has a powerful engine which gives it a classy performance... Looks are far better than than the successor of the car...... the bumper is more superior the lights are more powerful.and when we unlock the car in a dark place it looks sassier. Servicing and maintenance of the car I maintain the car very much but when we go to the service station the behaviour of the service manager is not good amongst the other. Pros- value for money Budget SUV Problem less Comfortable Cons- I don't have any cons.", "I bought Mahindra kuv nxt k8 on March 15, 2020, I feel like sitting in a big SUV even interior is also feels big and comfort and the car is fully loaded with all features mileage is also good kuv k8 petrol gave me a mileage of 17.4 something on highway driven with the speed of 90 to 100 but in city mileage reduced to 13.8 to 14.5 something which is okay and I love the refinement and smoothness of engine sometimes I feel like the car is on or off because it's petrol vehicle anyways I'm happy with this car especially white colour looks aggressive and nice for me", "Super car I m so happy this car comfort is very good and many security system this car this car maintenance to good I love this car looks to good light word very good I love it this car", "I thought that this is very useful I am having even Lamborghini Aventador but I like this car more than my Lamborghini Aventador.people thought that this car is not very good but it is better than my bogetti also . This car is the best car in the world and you should also like this car . Best car in the world . You should like this car more than any car.", "I purchased the car on 22dec 2019. Excellent car road grip is good. Millage is also good. I drive it for 5000km no vibration. Good performance. GROUND CLEARANCE IS MORE. Safe car tire size is good", "Taken test drive its really amazing, i like vehicle muscular looks and best features, driver seat height adjustment is very useful, even its 8 way adjustable. Electrically adjustable rear view mirror is the best feature, Rear wiper and defogger is very use full in rainy season.", "Kuv 100 is a good looking vehicle But the pickup is bit slower And the comfort is very spacious and luxurious And the maintenance is ok Kuv 100 k2 Is the value for money variant It gives confidence on three-digit speed", "Very stylish car with a sitting capacity of 6 persons. Fantastic when you drive it on the highway. Maintenance cost is very less. However, the average is not that great as claimed. Overall a perfect car which fulfils all your needs.", "I bought kuv 100 2016 crossing over 110000 km successfully no major maintenance excellent car fine Mileage 24 km at maintaining speed 80 km above 100 it will give 21 Amazing vehicle in Mahendra Stylish dashboard & spacious boot space falcon engine sudden pickup & less noise in Interior Thanks to Mahindra", "Its the best car in affordable price. Stylish look. Value for money. This car is best for family and also for single person to feel like a king. I fall in love with this car in 1st look.", "Amazing look makes this car totally different.. Also brand Mahindra is surety of faith.. Everyone like to drive Mahindra's different model.. Mostly bolero and Scorpio... I suggest for brand Mahindra.", "I dont have any Experiance by this car, but I driven this car its very comfortbile to ride this car , It's looks also very sexy super, service also given and well,But it was nice this car.", "Awesome experience driving the car on ghats and highways. Very much comfortable to drive this baby. The power steering gives u the unleashed pleasure of driving.gears are super comfortable to handle unlike any usual car gud leg space", "I bought my monstrous babe in Jan 2019. I felt the car is one of the best model in the competitive segment. The car has lot of value for the money. No one can dare to challenge the cabin space in this segment and comfort. Say swift, i20, i10, ignis, baleno. In comfort and space kuv 100nxt stands tall. No engine noise inside the cabin. Gear shifting is very easy and comfortable with front armrest @seater. Armrest is provided both for front and rear passenger which makes kuv 100 an added advantage this inbuilt comfy is not given in any other brands. The kurb weight is good. Since the kurb weight is high wobbling at high speeds or any high speed vehicle passing kuv,keeps it calm and steady, kuv has the highest kurb weight in its segment i20 has 968kgs whereas kuv weight is 1200kgs. Road view for driver is excellent. Music system is very good with 2 tweeters and 4 speakers. Mileage is good. but maruti, hyundai cars gives good mileage than kuv 100. But mileage is least bothered when this beast is in front of us. This is the car where the real riders would like to ride this humangous steel. None of the competitors can give such a comfort and 6 seater car in this segment at this price. Kudos to the team mahindra. This car is worth for money.", "", "I USE THIS CAR SINCE 8 MONTH,NO PROBLEM VERY COMFERTABLE BEARTH OF MONEY BEST CAR IN THIS PRICE SEGMENT.ONLY THREE THINGS DISPOINTING ME 1.FRONT GLASS TO SMALL 2.DESHBORD VERY UP SIDE FROM DRIVING SHEAT,3.NO SPACE FOR CARRIE MOBILE AND OTHER THINGS.", "It is a best car for who lookin economical aa will as sporty car it is for personal use as will as family use also used for commercial purpose for booking in marriage because it is looking too beautiful from my angle and also other", "Buying this is good than others cars. While I was driving I feel Happy ..I feel comfortable ..car look like decent and color was hosum.. the service and maintenance was good ....good engine", "I bought diesel kuv on 2016 Mileage is very good & nice interiors space # home feeling Riding experience is amazing crossing 1 lagg Killo Metres With very economical maintanence Mileage is maintaining 2 Rpm it will give 25 jumper lit Service is very good & prompt at Madurai TVS MAHENDRA Totally very nice & good car", "Mini Scorpio 6.20 lakh only is budget me superb car swift,polo,tigor,etc. compare kr lo top speed 160 mera out of Delhi Jana Bahut hota h ??great mileage superb pickup??Ek bar test drive kr k Dekho it’s Really good", "As compare to another vehicle in this same serious kuv is much better than any other vehicle. It will the strong car in this segment.i personally recommend to all for feel the amazing driving experience with kuv 100...", "KUV100 is a spacious car. Ample space in front as well as back seats. Although boot could have been a bit bigger. The performance of the car is great and is perfect for a daily city drive. The fuel economy on road in diesel is about 20kmpl. Overall a worthy buy if you are looking for a compact hatch with SUV looks. I would prefer the diesel one if you're a daily city driver.", "Totally satisfying to car. Dreamed to buy my first car this one only. It is very attractive and super car for family use. Most safe and stylish for ever for all kind of age group people.", "I purchased my car in December 2018. I love driving this mini SUV. It's high stance gives great visibility. Engine performance is also good. The milage is little bit low than company's claim. I am getting about 15 km/ltr still my vehicle's first servicing is due.", "Very good experience. Actually we saw in cardekho and just asked for the details we had tata indigo for past 15years which was one of the member in our family and we were very happy with it . But just for a change we were searching but we were thinking no car will be equal to our old car . After we asked for detail the marketing person satish from yelahanka branch called us and within 3days he bought the car to our place which is 60kms from yelahanka. After test drive we were happy. Nice car nice service already 2services finished and good. Even this car has become our family member . And he will turn 1year on April 2.", "It's a nice car buddy. It's an amazing car and I am not sure about its seats is it 6 str or not but it is then also a good car if you want to purchase it u can buy it for sure same like kwid but more features", "2*the middle-class RR that was so amazing that mileage super so much and interior very then see the cover and musical system and dashboard is very royal look view and the live wheel is so good and the suspension is so good\nNANA", "This is the best car long or short journey with the aa family and this car is very useful ,this is my dream car there is very comfort journey in this car for long driving or go to the long tour", "A great value for money utility hatchback vehcile which will make you fell that you are driving someting big and premium, ofcourse in its segment. Sturdy body, best in class seating height,width and a 6th person seating in middle of front seat which by folding down serves us a luxurious armrest until u don't decide to seat a person in middle of front row. Side profile look of this can be a bummer for some diserning eyes due to its hatchback 3.7 meters overall lenght and good height, to that sprinkled with some body curves lining giving it a muscular look which looks weird to many. Its 3 pot 1.2 litre diesel motor is quite refined and turns out smooth drive quality, until and unless u wont rev hard which most of us wont be doing for sure as this is not a hard rev or racing specific car. Fuel efficiency is good and within city my Diesel kuv 100 nxt always give me 18 - 19 kmpl in any case. On highway i drive 90 - 110 and it returns mileage of 20 - 22 kmpl which is great considering its 5 gear car with healthy amount of kerb weight of 1135 KG. Drive quality us bit cushionney as its long travel suspension are tuned on softer side. Overall being in a hatchback i feel quite safe, comfortable,confident and proud. Its a best bang which your money can get and i strongly suggest to go for Diesel Kuv as its Mahindra's first in house built pertrol engine is something which has yet not able to prove itself on promises and expectations. Great, Value for money Utility vehcile which will serve all purpose from congested narrow roads to long highways.", "I had recently seen at showroom, nice car with good storage, Price is little high only. If Mahindra can give offer in good price i will immidiate change my car maruti alto 800to new SUV... I'm very eager to take test drive. After all it's Mahindra vehicle. No problem in future,live long with good life alsways", "I love this car as my gf. I love this car . My future present car is this Very good design I love its all colour I love soo much this car , sound , navigation all features Red is the best colour Power of the car is soo good Torqe of the car is also good Groundclarance is also good Wheel is also good i love this good", "One of the best car in city. Great ground clearance and fabulous mileage or something like pick up the good ones that have been great going. Family car for 2019 with all amenities.", "Actually, I am very glad to say that I have future plans to buy this Car. Am so excited because in the first look of this car I am flate just waw. Love at first sight. God Bless me that in future I bought this beautiful car. #Love_Mahindra_Kuv\nNANA", "Very nice,good suspension very good aesthetic look ,boot space is very large as compare with other cars.fuel economy is very reasonable. Attractive interior and dashboard also.its a family car.", "Very impressive. A few distance ride gives a unique feeling. Had a short journey and found the ride very comfortable smooth and joyful. Interior gives the premium feel. Exterior is impressive.", "I purchased new Mahindra KUV1OO K2 Nxt Diesel 6 seater for about five months ago. The car is well designed by Mahindra for a small family purpose. Easy process to buy Very comfortable riding Small car with high performance No complaints on services and maintenances Getting 24 on long trips. I am very much impressed with my car.", "This car was really amazing. Top in riding, best in millage, nice in look. Overall super car for best price. The millage of the car was about 23 km/lt. I like this car very much. This car has more spacious compare to other cars those are purchased in this price level. There is no noice in cabin. We enjoy smooth riding.", "Simple is Value for Money and made in india by Indian Manufacturer. Style and performance is good. Engine performance is much better. Good infotainment system stylish interior as well. Main reason to buy is high dence steel which is not use other manufacturers M S is using the tin that's why I ignor Thier product.", "As we know the name Mahindra itself is the best brand name in automation , always give the SUV type cars , one of them is KUV100 NXT K2. It's the best/budget car . It's really young SUV . Live young , Live free. Owsum car . I loved it Recently , few days ago I purchased the small SUV by Mahindra that is KUV100 NXT K2 . I think it is really a small/compact SUV .", "My dream car is mahindra kuv100. I want to buy this car as soon i have too money to buy it. Exterior : exterior is charming in this car,tall and macho Look is enhanced with the diamond cut alloy wheels and drls and also Enhanced double barrel tail lamps. Interior :interior is too classy and modern. First of all is the touch screen infotainment system, sound is too good. Ice blue switches ilumination is midblowing in night and mood lighting is awesome. That,s all abaout it.", "I bought this car from Sireesh Auto in Bengaluru, and buying experience was good, their were a experts explained everything about car and they delivered car in time and date, all the buying process went on smooth. I first went, long drive all the way to Dharmasthala with my family, from Bengaluru . My driving experience was awesome, good pickup, Best in class comfort, good mileage, eye catching exterior looks, nice interior with joy stick gear knob. Totally I will give 5 out of 5 and I recommend this car to buy in this segment.", "i purchase this car 17 months ago the car is good then other in performance and pick up is excelent i have done two service and milage is 16 with out ac i have k8 petrol it is a mini suv good job mahindera and space is excelent i fell comfortable while driving it a good india car all safety features are in it", "Great work by carwale and it's 3asy to find the cars and it's Spence as well as it's specification Sometime it's tell to compare the two or more cars and prosperous things also and most important think is that carwale help to know more about the cars and company model even this is also needful for getting more ideas", "I purchased this car about an 1 year before i completely satisfied for buying this car but some minor problem i faced like dashboard noise etc.. But the performance of this car is amazing i really appreciate with this car the maintenance cost for this car is not more so any one should pay the coat of maintenance.. I like this car very much", "On the day of first I started kuv k4 plus 6 seater diesel started from showroom on 23rd march 2018 it's my first experience to drive mini SUV like kuv 100 it's really half Road young SUV it's very charming to drive right now I almost done 35000 km but still my car is new one service maintenance and all things good and mileage is around 22.5 in Highways drive with air condition and 19 average in city drive with the air condition I thanks to Mahindra to give this wonderful car car like air kuv 100 variants in future I expect more from Mahindra Regards Ashraf", "I bought this car in november 2017 and i had driven 8500 kms in one year and it's agressive suv look attracted me to buy and it's loaded with powerful engine and i love to rev the engine and mahindra's service is also good i didn't found any problem in my car.I went to service centre just once for 1st service and it was good. The only thing i don't like about this car is it's plastic quality (ext.) and milage(14 city,18 highway) but if you drive nicely then you can get about 20 also as i got milage of 19.78.And rest all is fine. Thank You", "I Purchage this car and my review is Excellent regarding Its Speed up to 160 kph but excellent speed experience There is no vibrant car and smoothly Running and there is not Not about Disturbingly And also Arm rest sheet also comfortable and also good experience regarding mileage also 29 kmpl", "In the first look I loved kuv100. I purchased the car 2016 its being 2 years I pretty happy with the performance. Most important is car engine and look. Engine is so powerful that u cruise through roads. Its a powerful car. Pros Value for money Powerful performance Great eye catching look 6 seater option Cons NA", "", "", "", "", "", "", "", "This is the best car in its segment. All the bad reviews are either by competitors or ppl who dont know how to drive. FIRST of all. Mileage. Ppl have been cribing about low mileage. My friends, its 1200 cc car. At the speed of 45 ur car should in 4th gear and not in 2nd or 3rd. I hope the msg is clear.. my kuv100 petrol purchased in sept 2017 gives a mileage of 16 in city with ac. So change ur gear shifting. I m 6 feet 1 inch and with driving seat full behind and have a straight posture without worrying abt viewing the bonet and see the driving experience. Its awesome. Once u get the judgement u will not have to worry abt seeing the bonet. Now i challenge u if u say space is conjusted or handling is not good. Handling is alll abt ur sitting position. Abs and ebds in all variants. Wat else u want. Looks r not less than a suv. Maruti has been supplying non safe cars all these years and ppl r still fools to buy them. Buy this car. Its awesome..", "Nice looking and very comfort vehicle.Amazing driving experiece. I booked KUV100 Next K8 Diesel 6 seater.Because of SUV type vehicle we can drive this car eny where whether it is hill or rugh area , no problem. Because of 6 Seat whole my family can go enywhere without any difficulties. Comfort sitting is possible for back seat passengers also.", "It is the best of Indian car maker mahendra's good performance satisfactorily millage comfort Best thing it is value of money best choice for baying this Good handling light steraing Don't think just go for it Fst thing its rigid body which will help you by provide sefty to the people in the cabin two air bag and abs Front look is great rear look also good Very specious Good millage economy Less survice cost Good reliability Thank you mahendra & maker of india"]}