{"0": [], "1": ["Had Booked Marazzo in Feb 2021 Through Peters Car Galaxy Mariner Maroon M6 plus 8 Str. It's around 4 months and no sign of our delivery and there is no response from the company, we did continuously follow up but no response. First they told that the colour Mariner Maroon is not available so I changed the color, even after changing the color also there is no respond. If the company is not able to deliver the car why Mahindra is marketing this car and also taking booking amount. Every one has a dream of this car if this way company is ruined our dreams for owning the car. I hope this review reaches to the concerned person of the company and hope to get delivery ASAP.", "Better Make it with 2 litre engine for better performance. 1.5 litre engine not matches to SUV vehicles. As I driveled the vehicle it needs extra power. If changes from 1.5 litre engine to 2 litre engine sales will improve. As my findings there is no pickup while driving in hills area. Better this vehicle to be change with powerful engine.", "Never refer to my friends & relatives to purchase marazzo car. . Sitting is not at all comfortable, there is always some sort of body sound coming inside the car even the showroom engineers don't know the fault. We own 12 marazzo cars (taxis) are there is constant turbo failing problem. Also no availability of car parts and other components. So it's my advice to never buy this car ever in life.", "We used this car till 7000km but we had very worst experience.. Because the engine noises, road clearance we can't able know why it is bad.. And also the hill station ride was very worst. Don't plan for hill station rides. During this hill station rides increasing the temperature it will take half hour for getting normal level.. We sold this car because of these reasons. So if u can buy this car u don't select to go to hill station."], "2": ["Very poor quality interior material used in the car, has to change the same parts for few time in last 1.5 years. Driving experience was good, silent and smooth car, Mileage is not good enough, car is comfortable and spacious, captain seats are good", "Look of the car is awesome. But somehow after some year paint gets dull. Performance is very good. Seating comport is awesome. Also there is good sense of premium like features.Value for Money.", "I want Mahindra to re launch this car, with face-lift 1.8 litre engine and with some more safety features and look.I bet Toyota Innova Crysta will never stand in front of this one.If Mahindra maintain the price tag with all modern features on it and price tag with 20 lakh.", "Marazzo needs engine improvement. When car is loaded with full passengers and some luggage it's pickup and power seems to be lacking. Car did not run as fast as expected Company should focus on powerful better engine. Also with coming trend Automotive versions because in slow traffic shifting gears is also a big problem for such a big car. Rest car is perfect .", "I am not satisfied with the price of this vehicle. M&M should not increase price of this vehicle! Although, as per expert review this car is enriched with features but since sales figure is low, customer could think for better option! This is my personal opinion! Mahindra should offer some great offers to attract customers!"], "3": ["Easy to Drive smoothly, While driving feel like Omni bus Driving... Experience. Comfortable.", "Petrol engine is optional to provide face-lift version, and infotainment system upgrade, and ventilated seats is must , and sunroof, rear wheel compulsory and automatic transmission", "Pros- value for money, comfortable in long journey, very good space in its class, good option in low amount of money. Cons- less powerful engine, suspension doesn't work comfortably due to its long body.", "Buying experience was good. Driving also good. This car giving awesome Mileage .. Main problem is ground clearence. You can't drive in off road.. If you drive only highway then u go for it.", "I am not satisfied with the price of this vehicle. M&M should not increase price of this vehicle! Although, as per expert review this car is enriched with features but since sales figure is low, customer could think for better option! This is my personal opinion! Mahindra should offer some great offers to attract customers!", "It has a lot of body roll while driving on off-road. It can't compete with Innova. Avg. is good. I got 16kmpl on highway. Space, interior and exterior are better. Power is less. The service centre is very bad. It doesn't feel like Innova. I know the cost is less than Innova but we don't get satisfaction while driving on off-road.", "Just the engine is small which makes pickup a problem. Rest all is excellent. The comfort is mind blowing. Features are also good. It could be improved by mahindra motors. The body is too heavy which cannot be handled by such a small engine."], "4": ["1.) I have purchased this car a long time ago & My buying experience is too good because all stuff of showroom really Great. They provided me all the guides as like a child. 2.) My driving experience of this car is just Amazing. 3.) This is one of the best looking car because when I drive this car on the road, people stare at my car. 4.) After sell service is too much good. 5.) According to my opinion this car is perfect for a man. This is really Great value for money car.", "Petrol engine is optional to provide face-lift version, and infotainment system upgrade, and ventilated seats is must , and sunroof, rear wheel compulsory and automatic transmission", "Pros- value for money, comfortable in long journey, very good space in its class, good option in low amount of money. Cons- less powerful engine, suspension doesn't work comfortably due to its long body.", "Buying experience was good. Driving also good. This car giving awesome Mileage .. Main problem is ground clearence. You can't drive in off road.. If you drive only highway then u go for it."], "5": ["In this segment Marazzo is best in mileage and rear ac. I bought this car in Ramani Mahindra Tirupur where hospitality and customer service is excellent. I ask Mahindra team to showcase the Marazzo once again in advertisement. . .", "I bought this car from Haryana. Huge car . Easy to drive . Attractive looks. Lots of space in cabin. Good car for a long drive . Satisfied with service centre. Low cost maintenance. Just loved it.", "Excellent to drive this car, good space, overall good, safety for driver and passenger and long journey, I suggest everyone to buy this car for safety & luxury.", "Every thing was excellent. For long drive this is excellent and I have driven in 160 km speed but there was no any problem. Very good control, super road grip with driving comfortability.", "My Marazzo BS6 M6+ is over an year old. I have driven it for 9000 kms now. 80% driven on Highway. Now I can say that the car is one of its kind. The comfort it offers on the Highway is immaculate. Absolute stunner. The car is equipped with all essential features . Engine is nice and powerful. The only thing I miss is the boot space. Otherwise this car can surprise big names on the highway. I seriously Congratulate Mahindra on engineering this car. The suspension, braking, stability, space. Absolute spot on.", "Mahindra Marazzo is a family car. It is valuable. Price, buying experience, driving experience and performance experience is superb. Servicing and maintenance charges are big. Pros and cons. Height is very low for this car and foot step is not adjusted.", "Pros- Very nice car, comfortable car, value for money, compare to Innova Crysta Cons- Very expansive & non electric power steering", "Buying experience was very good. Very comfortable car. I referred to many of my friends, great driving experience both highways as well as city drive. Turning radius of the vehicle is very short which makes driving is very easy.", "Pros : 1) Spacious 2) comfortable 3) Driveability 4) Mileage 5) Safety 6) Decent power 7) Truly a 7 seater Cons : 1) low ground clearance at front 2) non reclining 3rd row seats", "Good car, more comfort, good fuel efficiency, it's good for long drive . Service cost is very less as compared to another other cars. It's looks like a shark. I love this car.", "Excellent car to drive and seating comfort is nice with excellent driving experience. Marazzo is good for long drive and to travel thousands of kilometers with free ride.", "Very nice car .it is beyond my expectation.my all requirement is fulfil. stylish fuel economical low mantainnance car.my dream come true and all requirements pertaining to car is complete with marazzo.", "I buy a MarazzoApprox 8-9 months ago. the Marazzo give Ultimate experience, This Is very Comfortable, Very Smooth In driving.", "This SUV is very spacious and very comfortable. This is the best SUV in luxury and bold design in this segment. I liked it very much. Especially it's very for the back passenger is really awesome", "Buying experience easy and on-time delivery. Very smooth driving less noise. More comfortable and mileage is good. Maintenance cost is very less .good service and follow up assistance in Mahindra service. Cons base model doesn't have an audio system. Pros big space we can drag all the seats. Superb mileage.", "Just got one drive in uncle's marrazo car Really very spacious and huge built quality Nice ride quality great for family with 8 members.very good going mahindra car makers. Thank you", "Marazzo is a very comfortable car. First of all this car have sufficient safety related equipment. And it's look is very cool and significantly awesome. Had a great experience with this car.", "The car is superior and so much interior quality with powerfull engine and comfortable. Marazzo is the best .When I driven in this car I feel like that I am in sky .For long distance this car is very comfortable .", "Best 8 seater car. I'm totally impressed with design and comfort and also value for money. Best for family package package. And also long drive with friends and family. I love this car totally", "It is a good experience to drive this car. Everything is good as compared to other cars of same range. Marazzo is giving the texture of life in every aspect e.g in leg space, comfort, huge space, roof mounted cabin ac which no one MPV will give in such a price. The only one thing which I notice is its ground clearance. If u are living in far-flung areas, hilly areas where the roads are not in good condition then it is not a good choice for you. This car is meant for smooth roads, Highways. On long and hassle free trips it's really a driver friendly vehicle. One can really enjoy the family trips in such MPV.", "This is the best 7 Seater Car as compared to any other brand, With reference to Price Milage, Driving, Looking Dashing Outer and Interior also. I am really impressed.. I love it.", "1.We had bought a new marazzo m6+ 8 seater car at Velachery showroom 2. super amzing power steering 3. Nice and Amazing exterior and space comfortable 4. Low maintenance cost at this range 5. we love this car at this price and cons is not available of 6 airbags at top end model and sunroof", "I own a Mahindra Verito D4 2012 Model Vehicle. Based on the Mahindra Vehicle Experience recently I brought a Mahindra Marazzo M6+ (BS6). The Vehicle is a rare combination of Comfort, Safety, Power, Practicality and Essential Features. If you are looking at a Comfortable Family Car for 6-7 People at a reasonable Price, This vehicle has been made for you. The comfort in this vehicle is unbelievable. The Vehicle has a commanding road presence. The vehicle doesn't have a Power lag, it can comfortably drive 7 adults. This in not a Feature loaded vehicle, but it certainly doesn't missout on essential Features required in a car. The Vehicle is a pleasure to Drive. A Pleasure to be seated as a Passenger. Easy and Fun to Drive. The Car is not for People who look for excessive Power.It is a near-perfect Family Car. There is a minimum noise level in the Cabin of the Car. I have used a Mahindra Vehicle earlier so the trust and my requirement has driven me towards Mahindra Marazzo.I certainly expect Mahindra Marazzo to give me the same experience or even better than my Verito. The only problems i noticed in my short run so far are There is somebody roll, Not too heavy but there is acceptable Body Roll. Boot Space is very less. I personally felt if the Car can be reduced on the price marginally on each variant it has the potential to become a great Value for Money proposition with adequate Marketing and Word of Mouth. If you plan to buy a Marazzo for personal use i Highly recommend a 7 Seater Variant, as an 8 seater will again become a normal car. Whereas a 7 Seater will give you the Luxury of your Living Room. Take a test drive of the Vehicle (Highly Recommended) to experience my recommendation in the price range of 14-16 Lakhs. Will consider Reviewing the car again after a Year. Note: Car buyers please take good care of any car you buy and it will take care of you and your family.", "Overall experience is good Cabin space is more than Innova Engine performance is decent Built quality is acceptable City plus highway average fuel consumption is better Mileage around 14 Seats are comfortable Suspension on stiffer side Body is there", "If you want space in your car, where you can keep anything you want then please go for it. This product is definitely a value for money. It's a great and one of the most refined car by Mahindra, as it has many luxurious features and material quality in a good value as compared to others. When you drive it on the highway, it just feels like you are sitting in a speedboat. You feel like you are driving on water. its power is amazing when you shift gear to the top. Marazzo has developed on ladder framework, It also looks much bigger, more muscular, more stylish, more powerful and the MPV promising features which are also beautifully packed in this car such as It is the more spacious, comfortable and fuel-efficient car. It excellent package by Mahindra.Go for it. 10/10"]}