{"0": [], "1": [], "2": [], "3": [], "4": ["This is my second Scorpio. I bought the first one in 2011 SLE. I loved it very much and drove for 1.5 lac kms (across India, Nepal), but after 10 years the maintenance cost was getting high and after a mid highway clutch failure, i made up my mind and sold it. Sick of high maintenance i bought Maruti XL6, although it was excellent car but i started missing the commanding high drive position. Sadly I lost XL6 in Bangalore floods and when I had to buy a new vehicle i again went for Scorpio Classic. Man what an excellent improvement, thanks Mahindra for introducing Thar engine. It's very refined and does not feel like riding a mad horse, but a tamed one :-). The mileage has improved a lot. In full tank the old Scorpio used to go for 550 kms, the new one easily covers 700+. The stark difference you feel is low engine noise (almost none if you compare with old Scorpio), the gear does not give tingling in hand :-), yes it used to vibrate so much. Although it's old model, I recently made a Bangalore-Hyderabad-Ellora-Indore and Indore-Pune-Gokarna-Bangalore and people on road kept asking me the price and how good it looks. The only things I wish could be improved are: 1. There is no water bottle holder or mobile or wallet holder in front. My 2011 Scorpio had 4 water bottle holders and damn good space to hold other things. 2. The rear leg space. After XL6 and my wife has WRV, i feel really crammed up in the back seat. I thought of getting it modified but the way seats are attached it does not seem possible. Sincere request to Mahindra to improve these 2 things.", "One of the best budget suv having more seating capacity. We are searching for cheap and best car then it is one of them . It's amazing that the passengers inside the car is also happy to ride this one.", "Overall good experience.The mileage is good as per expectation and near about 14.5kmpl I got.It is comfortable journey.Power is enough for all area like hilly area.Torque is also good.", "Service and maintenance should be improved.Mileage should be improved and the cost should be made a bit lower in comparision to other SUVs.Talking of Look it is fantastic and gives high class look.", "Pros : Gives you dominating Road presence, spacious interiors and a commanding position is obtained on the Drivers' seat, long drives do not make you tired and lower back position is well maintained. Good view of the front is available. The vehicle responsiveness for steering at higher speeds is commendable. Cons : Monotony on the Dashboard, feature less cabin as you don't find push button start/stop, ventilated seats, air purifier, a very small touchscreen that is not great in screen sensitivity, bottle holders on the doors are too small that even legs will touch them on the back seat, cabin lights are big drawbacks & LEDs are absent inside. Centre arm console cannot hold glasses and it is of a medium quality.", "Good mileage is the best car is good no bad review i am using before pas three year recently i am exchange with Scorpio classic. Black colour is good .....no bad effects on this price."], "5": ["Very good experiences, very good car , very comfortable, it was awesome, mind Blowing, Mahindra is very good Company, but spare parts and services is very very expensive, compare to other companies car.", "Mahindra Scorpio is one of the best SUV in India, with excellent build quality. I had the opportunity to drive it and i really enjoyed it. It has outstanding stability, good suspension, comfortable seats, commanding driving position and minimum body roll. It is value for money as it has high seating capacity. The life of this engine is among the best today and it can run for 500,000km without any problem as compared to 250,000km with the previous engine.", "it was a really great experience driving Scorpio. it was very smooth, gear shifting was very smooth and overall drive was very cool. i went for a long drive approx.. 200 kms. you will not believe performance of the car war on a another level.", "Awesome suv and suitable for Indian road as it is rough and tough suv of India and it is actually the king or father of all suv's .I love this suv because it win my heart by its performance.", "I have short listed this. For my next purchase which I am going to purchase in month of April 2023. I have drive my younger brother car. It's really marbles. Still it's good only Minimum expenses of engine oil and other mandatory chances. Not much difficult to drive.", "Its superb i will enjoy it a lot and my family member also love this rode i strongly recommend this to everyone.", "Buying experience is so good and everything ok.. service cost is low and looking so crazy and super Power feel like that... IS recommended for buy this rocket.. black edition is so nice", "I had an amazing experience driving this car.. I would recommend you to buy this car for sure to experience the fun by yourself. Very tough and safe car and has an amazing stability and features.", "Driving experience was awesome. Muscular & manly looks are the main reason behind everyone purchase. New logo also suiting the car. Mahindra has made this product for forever like.", "1. Buying Experience:- The buying experience was quite but although it had a long waiting period . I had to wait 3 months to get my car . but i understand the amount of pressure companies have. Apart from the waiting period it was quite a nice experience ,everything else was smooth. Except they had issue with my address but the staff was very helpful so it was sorted. 2. Driving Experience:- the experience was wonderful the way it didn't loose the control even in bad terrain won my heart. 3. Performance:- (i)Bad road exp.:- This car has body on frame chassis set up unlike other which are integrated on the body, basically it is bottled up on the body. Which improves the bad road handling and even in city it doesn't even let u feel the speed bumps and passes it like a plane road without letting you knows what's going on down there. (ii) Torque feedback mechanism:- The best part about Scorpio's engine tuning is the torque it produces , not the best to be honest but fairly good enough to make u feel superior. It gives around 1800 so you may not be the first one to win the game but you will be the 2nd or 3rd to win it. (iv)Steering:- The hydraulic steering lets u fell the terrain and gives u the most appropriate feedback including tires grip", "Driving experience was very amazing and unique, most of thing this vehicle body role was amazing and black colour is most favorite colour in our country and no more words.", "I got this from Bangalore Bannerghatta branch, it's a class vehicle which you really fill great while driving. Look wise it is upto the mark.... As of now haven't got any cons , happy to say this vehicle is filled with all required things what you need... Close your eyes and go for it.", "Very nice car it is amazing maintenance is very low and it's looks like a bride and it's driving experience amazing very smooth and controlling power is very amazing so I like it..", "The Driving experience is very nice and Mahindra Scorpio Classic is the bigger car and road presence is awesome like a king and Mahindra Scorpio Classic driving pleasure is very nice.", "Nice SUV performance is very good and maintenance free look good and interior is very good ,long journey very good driving and not feel tired feel free like very good SUV car.", "Very Nice To Drive Very Powerful Feeling Of King while driving Best in class engine and design Every vehicle Is feel very low compared to Scorpio Very nice Nice Mahindra had done", "Its experience is very good. Very smooth driving. Interior is very good. Its royal feeling vehicle. Very good comfort level. Look and feel extra ordinary. It is really good for long drive.", "Scorpio classic is best car in 9 seat option Suspension is improve n also mileage is so good its 18 km/l. Bs6 technology engine is so smooth n silent 6 speed gear also smooth shifting n new logo front n back is awesome n new shape front grill n back tail light best. City n highway mileage is good 18+ mileage in smooth driving", "Driving experience is really good, while you drive Scorpio the feeling we can explain it's only you can experience. All he basic features whatever is required for a car this car is having all yhe features. If you want to drive a royal car then go for it.", "Amazing car height is also good and in black colour Scorpio is seems very amazing it is for a big family car seven or nine seater capacity I love this car and best value of money."]}