{"0": [], "1": ["Base model diesel price is so high .it will cost 0n road around 13lakh that's it...now I have to buy other car because my budget is 13 i don't buy petrol....sad but true....i have 3 to 4 options...creta,seltos,Kia Carens, brezza and Scorpio and ...but price of base model on road ..is around 14.50..my budget is 13 ...I hope ..Mr. Mahindra sir ...next time means after 5 years decrease the price under my budget ...", "Took a test drive from Koncept Mahindra, Lajpat Nagar today_ Mode: Petrol Z8L AT Issues / Cons: 1) Car inside smells badly of Petrol, could not bear the drive for 5 mins, it made it difficult to sit inside with AC on 2) No captain seats on lower versions 3) Extremely unusable / cramped 3rd row 4) 2nd row too seems uncomfortable with driver seat positioned back 5) Boot space unusable 6) Not worth being Big Daddy of SUVs. 7) Smaller cars /Mid size SUVs / MUVs give better comfort. 8) Could not feel Sony system with 6+ speakers...Local speakers would produce better sound 9) Mileage as per the instrument cluster was just 4 km/l, May be due to being test drive vehicle, I am not sure. 10) Higher models look extremely expensive, though AT pricing is yet to be announced.", "Back looks of new Scorpio are really bad and not even anywhere near to the previous generation. Doesn't justify his name. The big daddy.. Third row seat is too small and if it's in use there is no boot scape. Even if you will fold it, boot space isn't too good for practical use. So it's a 5 seater actually...", "Very bad experience The Mahindra Scorpio is not very updated in the creature comforts department when compared to modern age SUVs. ... The cabin of the Mahindra Scorpio isn't as spacious and even the seats aren't the most comfortable ones we have seen in the segment. ."], "2": ["Since 15 days of delivery still waiting for registration.I drove100 km,but vehicle lags instant pick up. Reverse camera lags which can cause accidents.You have to be fast and precise.While reversing camera disappoints you.", "Waste of money and every one's dreams.. now a days below 10 lakh cars has been had 3rd row AC vents.. but still Mahindra didn't consider customer comfort. Too much price. Worst ac. The bolero also has a same problem.", "An adequate experience overall, not like a gem as stated by Mahindra. Everything is pretty Average, fuel economy is low, like 8-10 in city and 12-15 on highway. Lacks automatic transmission.", "The major drawback is the 3rd row, which is almost useless. No A/c vent in the third row and the vent on the second row is also on the floor. No Boot space. Typically, a 5 seater.", "Cramped third row seats, this wouldn't suit at all for tag line big daddy of SUVs. no sliding in second row is another poor design. Slowly they will increase the price like anything and will say value for money cars.thirs row seats sits on high rise floor and looks old-school type of seats. When you look at competitors they are providing flat bed of seats when folded. Ground clearance is 187mm is less for such a SUV when compared to other SUVs. This low ground clearance will definitely scrap the underbody or get hit because of Indian road heightened speed breakers if driver unnoticed them. Because of height of the car length looks like smaller from side profile.", "Everything in the new Scorpio N is fantastic but the third row space rear view of the car is something I don't like copy paste from the Volvo. There is no AC vents for the third row for such a big car is pathetic. Pricing is cherry on the cake but for only first 25k bookings. After 20 years Mahindra did a good."], "3": ["Loved front look and interiors but did not like the back look ... the back seats should have been side facing for better use of space and retaining usefulness which existed before , also 4x4 should have been given with z6 variant.", "Waste of money and every one's dreams.. now a days below 10 lakh cars has been had 3rd row AC vents.. but still Mahindra didn't consider customer comfort. Too much price. Worst ac. The bolero also has a same problem.", "An adequate experience overall, not like a gem as stated by Mahindra. Everything is pretty Average, fuel economy is low, like 8-10 in city and 12-15 on highway. Lacks automatic transmission.", "The major drawback is the 3rd row, which is almost useless. No A/c vent in the third row and the vent on the second row is also on the floor. No Boot space. Typically, a 5 seater.", "Cramped third row seats, this wouldn't suit at all for tag line big daddy of SUVs. no sliding in second row is another poor design. Slowly they will increase the price like anything and will say value for money cars.thirs row seats sits on high rise floor and looks old-school type of seats. When you look at competitors they are providing flat bed of seats when folded. Ground clearance is 187mm is less for such a SUV when compared to other SUVs. This low ground clearance will definitely scrap the underbody or get hit because of Indian road heightened speed breakers if driver unnoticed them. Because of height of the car length looks like smaller from side profile.", "Everything in the new Scorpio N is fantastic but the third row space rear view of the car is something I don't like copy paste from the Volvo. There is no AC vents for the third row for such a big car is pathetic. Pricing is cherry on the cake but for only first 25k bookings. After 20 years Mahindra did a good."], "4": ["1 very good presentation 2 comfortable for long traveling, it looks very beautiful. cheap maintenance 5 ok not good not bad", "The overall experience with the car is superb.The power delivery in the petrol version is really good.The Mahindra Scorpio-N is a nice car with the best features and looks.It's a very comfortable car with good performance.", "A nice car feels good while driving.A long ride on this car would feels you very great.Must buy and atleast have a test drive.", "Absolutely monster in all ways.... Performance, looks, interior, exterior, built quality in all segments Mahindra and Mahindra did well. while driving it feels that one travelling a huge monster. riding experience is also good. Just go for it.....!!!!", "The new Scorpio n had good and comfortable riding. Body roll was so less. I currently drive an xuv500 w10 and i must say Scorpio n had better comfort and road presence. All over the car could have better third row if the car was made a Lil longer. Also among all the colours the black one definitely made a mark whereas other colours mostly give the car a taxi look. Choose Scorpio n over the classic anytime. But if you are not a very huge fan of off roading then just simply go for XUV 700 it is way better in terms of feature and value for money.", "The new Scorpio n had good and comfortable riding. Body roll was so less. I currently drive an xuv500 w10 and i must say Scorpio n had better comfort and road presence. All over the car could have better third row if the car was made a Lil longer. Also among all the colours the black one definitely made a mark whereas other colours mostly give the car a taxi look. Choose Scorpio n over the classic anytime. But if you are not a very huge fan of off roading then just simply go for XUV 700 it is way better in terms of feature and value for money.", "Driving experience is nice premium quality of bodies service and maintenance no idea its super car its test drive experience its have no sound and sound less and price is too good.", "Mahindra Scorpio-N is best car in among.. comfortable drive, modern look, feel heavy.. name it SUV daddy is exactly which is deserve to be call as like that. But one thing is that back side open must change/modify, it is open from side, it should be open up ward with automatic just like Fortuner and endeavor and third row seat must adjustable by moving or sliding 2nd row.", "Took a test drive. Cons. Killer looks, from front and side High seat Ac cooling superb in 2nd row also Very light steering in city Sunroof is very big though not panoramic 18inch machine cut alloy Big ORVM Petrol automatic, very good pickup Pros. Biggest pro, why i had to skip buying this car is. Driver seat is very congested, door handle penetrates right knee, left knee also gets penetrated by plastic on left. Driver seat Not for wide people. I thought Scorpio is made for large built people, but it is not. Back side look very disappointing 3rd row seat. Why 2nd row not sliding to give more space to third row? Why 3rd row is not 50:50 split? And if we have back door sideway open with door handle inside, then why not jump seats provided? Why no ac vents in 3rd row. Fabric used in boot space is very cheap quality. Verdict. Not for wide built driver. And this car is good from front till 2nd row, 3rd and back is full of design flaws.", "Serving and maintenance, looks, performance and the most i like is safety and precaution in Mahindra car .because safety is the first and foremost for each one of us. Others what they said i don't care but safety is the first and important.", "What a car, mind blowing, superb style superb quality overall superb car, it is big daddy of all suv, I am big fan of Mahindra Scorpio new, it compete to Fortuner and harrier and other costly cars,"], "5": ["Mahindra Scorpio n is on of the best suv's, with unmatched road presence and incredible maneuverability that just simply increase the experience and make it more convenient driving is really comfortable it is value for money product in my opinion.", "Nice car good interior, mileage than previous models and the metal quality is also. Our family will be safe.", "All in one Power House with Comforts and features. You can't even think of such vehicle at this price range. Worth 30L to 40 L. Loved this. Thanks to Mahindra & Mahindra Team. Go ahead every one....", "All good best performance for a up family. The plastic cladding of car is very story.no doubt mileage is far better than others cars of its worth. I am happy to have this new features car.", "Wow Just Wow I purchased scorpion Z4 Variant Petrol Automatic mileage in city 10km/l highways 17km/l cruising speed between 80km/h to 120km/h . Mind blowing Mahindra No one will match at all at this price point . Ride gently automatic transmission defieneltly mileage is good . Drive below 2K Rpm till you complete 2000kms definitely mileage , off roading and no body roll like old Scorpio and comfort is on next level ,unbelievable . don't buy Hyundai and Kia instead of that buy Mahindra Scorpio N Road presence is Like Mamooth , pick up, mileage , road presence no match at all at this price and 5Star Global Ncap ratings . Mahindra rise .", "Scorpio N is just a option for a middle man to feel like fortuner and endeavor. Enjoyed a lot while driving, its speed is just awesome and felt a great comfort and more spacious. And the texture is most beautiful.", "Excellent in look. Buying process is very easy you can track updates on app. While driving you can feel special when people mark your car. In z8L model they providing normal hand break it will be great if they can update with automatically operation button. Option for sensor stop should be there because in traffic you constantly get alert.", "Overall good experience in every department exterior and interior are top notch moreover performance is top-notch with safety features, customers can rely on this car without any hesitation.", "It's not just a car it's a social status in up and Bihar. With good mileage and performance. It's so smooth while driving. So comfortable. Servicing and maintenance are affordable.", "Mahindra is best car company of India. very comfortable SUV. Mahindra car average is better then other car company. Mahindra car is the best car of India.", "I really love this year.. it was my dream to buy Scorpio.. finally got it with new model and design. I am very happy. 2022 really good for me.. coz my dream park at home with new model.", "Excellent delivery experience. Got it in 3 months. Drove 3000 KM, Perfect drive, no issues till now. Road present is awesome! Went on two trip to o Himachal, off beat drives, absolute bliss!", "Scorpio n is a very powerful popular massive suv it made for off rodding . Attractive stylish for heavy personality . It is firs choice for young age . Mahindra is a very famous for suv . Mahindra's technology was very good", "Value for money car and ground clearance , comfort and pricing is better than Toyota Innova , road presence is excellent in Scorpio n But in third row they would have given ac vents, in future Mahindra should recall their vehicles for third row AC.", "Driving experience was awesome. And service is also good. Absolutely zero maintenance. I love that Scorpio model look and smooth drive. Its totally awesome car i ever seen in my life.", "Mahindra Scorpio-N is one of the best SUV in India,with excellent build quality.I had the opportunity to drive it and i really enjoyed it.It has outstanding stability,good suspension,comfortable seats,commanding driving position and minimum body roll.It is value for money as it has high seating capacity.", "", "Mahindra Scorpio driving experience was very good.Smooth driving.There is no any abnormal engine noise.One thing very unhappy,waiting period is very high.First my choise was Mahindra XUV 7OO.But same thing,waiting period was also long.", "The car looks great with a sporty yet off roader look. Really comfy and spacious inside. The sunroof is small but still ok. There a lot of features and the app is really great. Ultimately it's a great car with a lot of features.", "Awesome car...perfect suv and powerful suv ...muscle car it is..must go for it. a huge massive sunroof and a premium interior. With all features and with great ground clearance...", "1) Buying experience was Okayish as you all know about Mahindra Showrooms 2) Driving experience is just wow . I have driven Safari Dicor Fortuner Scorpio S11 but I must say this is the most pleasant car 3) I'm very fond of the front & side looks as it looks very muscular & has great road presence , However I may need some time to get used to Rear look 4) Performance is awesome the engine is so powerful & refined you don't hear noise inside the cabin 5) The service is okayish , Mahindra has improved but still needs some time to reach that level 6 PROS : Shear Road Presence. Powerful Engine in this segment Modern Features like Adrenox Sunroof etc Comfort 4x4 System ( also only RWD in this segment CONS :- Rear look isn't that great Long waiting period Camera Quality And Mahindra After sale Service", "I have not bought yet but my friend did. I drived it for few kilometers and my experience is awesome .when I was in driving seat I am feeling so much confident ,experience of joy , experience which is beyond words. I prefer red colour. There should be a blue color variant also.", "I've waited this beast since long, then i got this and first of all i just love this beast in this price range, you can't get any other car or suv like Scorpio N in this price range. You can also compare with Fortuner and the best part is that this car is big daddy of SUVs", "", "", "Good looking, heavy, nice suv, value for money l like very good product, good mileage sitting position is very good.", "Great Vehicle. Handling, Comfort, Power And Looks Are Awesome. Great Value For Money Vehicle One Can Buy With Money. Steering Is Very Light, Braking Is Linear And Smooth. Handling Is Also Great, You Will Not Fell You Are Driving Such A Big SUV, You Will Feel Like Driving A Small Car. Great, Outstanding Vehicle For Those Who Have Budget Upto 60 Lacks INR.", "Super car... Dream car... Can't affordable Fortuner they can buy this.... Bigger in size and value for money... Feel luxury... Silver colour is most favorable.......................", "I would like to draw your attention towards the driving experience .It was totally amazing driving Scorpio N . It was like that I was driving some very premium suvs of very luxurious brands I am also planning to buy Scorpio N.", "This car is dream of me so high quality abs system i saw the first time he is so nicely clear front mirror so i think this is most important and popularity is very high and the last is car has 28 version so high quality sound box in jbl and tyre is Mrf he is top and best result and best discount offer all the time.", "Experience is very very excellent good performance the driver very smooth and very and feature or so good. The car is best of Mahindra Scorpio N. Looking so good and big daddy for Mahindra.", "Its amazing suv. That's really father of all suvs My buying experience is good Car drive very smoothly and good Its look very amazing and good looking.", "", "", "", "", "", "I didn't get this car but front look is massive and rear is normal side view gives old Scorpio model and 4×4 is very very liked version for all Scorpio lovers once buy it didn't change to another car it's really wonderful view", "I only did a test drive , driving experience was great , looks and performance were top notch , did not know about servicing and maintenance, pros the size, looks, performance etc .", "Did a test drive of the AT version, here my first impression 1. Road presence unmatchable at this price point 2. Driver Seating position is High, gives you great view of the road 3. Attractive front grill, not so good looking back, but not a deal breaker for me. 4. 2nd row got good amount of space 5. 3rd row cramped, not for someone who are looking for people mover. Go get Kia Caren with 6 airbags and 3* safety 6. Not feature loaded, but enough to satisfy and keep your owning experience good 7. Plush interior...felt better than Alcazar and Carens 8. Drive it for couple of km, super refined, easy to drive and linear power delivery 9. Built to last 10. Thuds from doors were reassuring.", "Buying experience is so awesome and this car makes you feel luxurious, if you want luxurious experience then this is best way to feel it with Mahindra Scorpio N. Driving experience was so so good I feel like no one can gives me this feeling to drive a SUV like this. There is no pros and cons you can go for it.", "Yes it is Big daddy Good work by Mahindra great road presence. Very smooth driving moreover great stability at high speed but third row AC vents is missing and if second row seats get sliding function then third row get little extra space. In my opinion overall good package good interior This SUV is big success for Mahindra.", "Looks macho, ride quality n driving dynamics are brilliant. There are few cons like front and rear camera aren't really crisp, there is no Ac vent in the 3rd row. 12V socket has been provided in the 3rd row instead they could have provided in the 1st row or the 2nd row. It could have been helpful for self air filling and or to vacuum clean the floor.", "This car competition with all new Tata harrier and Creta Fortuner venue and other Suv's. Scorpio is very glimpse in looking and comparable and value for money and Scorpio is suitable for off-roading.", "Something that was missing since ages in the Indian car market.......we have it now..........it provides both luxury and capability along with masculine rugged appeal.......simply go for it....... don't need to buy extremoverpriced Fortuner anymore now........highly value for money product......", "By your advertising it looks excellent and best. I am very interesting to buy this wonderful horse. Because I have driven Scorpio classic may year .Now I am driving Toyota Fortuner. It is amazing.", "No 1 car i see looks awesome performance superb , comfortable logo was so AOWSOM i love this and price is also so affordable specially i like red,green,black colour just love this.", "Scorpio is the best model of Mahindra company because this company is very expensive that's why Scorpio is my favorite car in the world , Scorpio can also drive at khanjar land.", "Value of money. Driving smooth, looking for awesome, service good and AVALABE all time, .............i love this suv..my crush this suv...looking for king............................", "I experienced a good feeling about Scorpio N because when I was sitting in the car it was very comfortable . It is good to drive. It's look is amazing. And services are good. All things of the car are amazing.", "Excellent car with trendy design. Looks fantastic. True suv of all Suv's , the big daddy if Suv's. Very high features from the base model itself feels fantastic. Finally this Scorpio-n is unlimited.", "Best vehicle under 20 lakh for up Bihar ...it can kill people heart with its just one look...best car for a middle class India. Good styling good handling. Everything is good in it..", "This is unbeatable car really how big it was but awesome it's my dream car (I want this car) I love it. This is what a car I can't explain it!", "Next level car in D segment with affordable price and we can direct compare with Toyota Fortuner and jeep meridian Mahindra Scorpio N best in all over and off-road capabilities have.", "Best value for money at this price range . it gives highest commanding position. at 12lakh 200bhp no other companies will provide . And also street presence is unmatchable at this price range. thank you for reading my review.", "This car looks too good and attractive. Everything is good of this car according my knowledge . Colours are also look very attractive. Big space for big family. Overall Performance is brilliant of this car."]}