{"0": [], "1": ["Please don't buy this car it's one the most uncomfortable car I've sat in. People who wants to buy the car for off-roading it's not worth spending this much money in an off-roading car/jeep whatever it's called, it's just a waste of money and nothing else. Though, the engine is very powerful the riding comfort is zero and seats are no less comfortable than a Tata truck.", "If it's an off road vehicle or cruze vehicle but it must have a decent boot space so that instead of personal luggage the owner can place off-road instruments easily in the vehicle after having all the four seats full. Rest the vehicle is perfect as per the price the only thing which look problematic is boot space."], "2": ["Mahindra Thar has following benefits over the Mahindra scorpio.Cheaper than the Mahindra scorpio.More customizable than the scorpio,owing to the minimalistic body design.Open top lends a more bad look to the car.", "Very good and nice. Car runs very smoothly in petrol version. Some more improvement in this this SUV is required. Vibration issues are still there. 5 door SUV is coming but may be expensive.", "Mahindra Thar 2020/21, is capable of becoming the best car, if the company decided to pay attention to very basic quality controls. Looks like they were in a hurry to just launch the car and totally ignored the basic checks. Instead of putting all their efforts in a overly hyped up PR, they should have concentrated on some of the basic stuff. Within six months of purchase, the tail gate door already vibrates and makes quite a noise. Everything inside vibrates while driving and makes you wonder, if someone was sleeping on the job while making this car."], "3": ["Mahindra Thar has following benefits over the Mahindra scorpio.Cheaper than the Mahindra scorpio.More customizable than the scorpio,owing to the minimalistic body design.Open top lends a more bad look to the car.", "Very good and nice. Car runs very smoothly in petrol version. Some more improvement in this this SUV is required. Vibration issues are still there. 5 door SUV is coming but may be expensive.", "Mahindra Thar 2020/21, is capable of becoming the best car, if the company decided to pay attention to very basic quality controls. Looks like they were in a hurry to just launch the car and totally ignored the basic checks. Instead of putting all their efforts in a overly hyped up PR, they should have concentrated on some of the basic stuff. Within six months of purchase, the tail gate door already vibrates and makes quite a noise. Everything inside vibrates while driving and makes you wonder, if someone was sleeping on the job while making this car.", "I have 2013 Thar, best off road car especially for travelling coffee estates. In the new version back door with windows would have been best for family use. Not satisfied with this version", "New Thar is a perfect off-roader available in Indian market. Both Petrol and Diesel vehicles are state of the art. Mahindra could have priced it between 9 to 11L for better reach as it is going to be parked in buyers garage as an option. Obvious reasons are: 1. 3 doors not convenient for family specifically for aged if you have to occupy rear seats. 2. Hand Rest for rear passengers are missing. 3. Glasses are fixed so if engine is switched off rear passengers would be in problem. 4. Very less boot space. Makes it fit for 2 not for 4. 5. Roof of the upper end is made with fiber. It appears huge compromise, looking into the price. Mahindra has definitely worked hard and made it a dream 'Off Roader', but to make it a compulsory choice above has to be looked seriously, else I could have had it!", "I bought new 2020 Thar diesel variant. which was about 7048 km driven, some shocker noise is coming from rear side. today it's ac was not working, it was repaired by company goodwill after request.", "Good car but 4 seater hai or thodi mehangi hai itne price me humare pass isse much better option hai. Ye sirf off-roading k liye better hai. Agar iska price 8 ya 9 lakh on-road price hota to better tha", "No challenge to new Thaar as it's the one all waiting n it's real upgrade from Mahindra. Driving is superb n you don't fill like you are driving 2k cc SUV in city... Simply awesome experience. It's not offroading now but daily use car. Only issue is pricing... Overpriced as you have many options with these pricing like Creta/Seltos/Harrier/Hector even XUV 500", "Price is a bit on higher note Rest no comparison Thar is a unique Vehicle no other brand has manufactured its premium competitor yet."], "4": ["Best car for Mahindra lover in this budget you can expect not much more. This car is fuel efficient like other small suv cars. When you drive this car you feel you are driving Mahindra Scorpio.", "The car has all the required features but needs 4 doors because for some people it is not easy to go in the back seat. Overall it is one of the best 4*4 car in India. We have visited so many places in Rajasthan and it feels very exiting to travel on it.", "Thar is my favorite car and their price is also good. All feature of the car fulfill our all needs. Car look is also great than rest of cars and the logo of Mahindra is so cute.", "Not a family car Can't comfort four occupants as other similarly priced SUVs would...... poor petrol efficiency....... the best affordable off-roader in the country....... Dashboard visibility is very good, nibbling through city traffic is tough n also through narrow roads and yes you are seated quite high .. Cons back camera comes as an accessory... It is indeed a driver's car for me ... As i will be happy using 130hp in my daily driving but I will take mt. N .power output is good to keep me happy... On my test drive was narrow roads construction area.........", "The Thar was seriously very beautiful looking...and the engine....oh my goodness just one of the best engines I have driven. It can go at any terrain. The variant I drove was the petrol automatic which was a splendid powertrain.", "It's a very good car overall. Riding experience is so good. It's my 2nd car drive after alto and felt why it worth more than double of it. Power feels on your legs and a very good off-road experience as well.", "My experience with dealership was very good. I love Thar for its ruggedness. But the interior and comfort could be better. I have done off-roading with it. The only con of this car is that the rear seats are not comfortable.", "I purchased this car at a Mahindra dealership in Gurgaon, and costed around 21.3 lakh bucks. The driving experience is fine, though I feel it is a bit noisy. The suspension is good, and the car makes heads turn on the streets. It gives me around 14-15 km/l, and is good for my daily 22-24 km journey. The seats are comfortable, the cooling is good, transmission is smooth. Apart from the noise, I didn't find any other cons.", "This one is good but if you are low budget you chose other one because this is only good for off road that is why. I don't recommend and if you like off-roading and you live village like area you can buy.", "I was very happy when I bought the Thar because it is just like a dream for me to buy this. It is used but very nice. My driving experience towards the Thar is very comfortable and I love it very much.", "Good but Can be better for sure. needs a ton of improvements still. This is one of the best models available in the mid range segment, its not a very friendly design for a family car, but a good option incase of a long road trip.", "Talking straight on the driving aspect from behind the wheel, Dashboard visibility is very good, nibbling through city traffic is tough n also through narrow roads n yes u r seated quite high .. Cons back camera comes as an accessory... It is indeed a driver's car for me ... As i will be happy using 130hp in my daily driving but i will take mt. N power output is good to keep me happy... On my test drive was narrow roads construction area... This is the first time driving Thar...", "I drove Thar about few hundred kilometers nice experience with Thar, five star for pickup and about 4 star for control. Loved it a lot thinking to buy and advice others too about THAR.", "Driving experience is very nice . i enjoy riding it and interior design is amazing no other car would give this at this range this is smaller version of wrangler and red color looking very nice.", "The buying experience from Vvc Hyderabad was the worst. On the day of delivery they increased 50k. After loan sanctioned, booking paid, on delivery day who does this.( Just one of the few problems the dealer caused us. AVOID VVC HYDERABAD) The car is a little bouncy, people with motion sickness should first test it out before buying. Of course it's not agile but I was able to do some steep overtakes at 80( not advised at all. Please be safe!) Looks amazing. I have 4 other cars and no one has stopped me to ask about them. Thar just demands attention. Seating is comfortable, back cushions could have been better Oh yes dashboard storage space is negligible. I could only put toll receipts. Storage spaces are lacking. It's a lifestyle vehicle. Young couples bachelors can go for it.", "Good performance off and on road too, great with looks but can be better with interiors... Go for it without even thinking for once Cons- not good with family especially an old people.", "", "", "", "The car is awesome in look and really very much comfortable in driving, really amazing experience, if you think of buying. Thar then you don't need to check competitors because nothing can compete with car.", "Thar is not a car this is the dream of every car owner . People mostly want to purchase it and add this beast of our car collection. I personally love this car and I want this car in few years because this car is made for youngsters and I love this car very much. It looks so impressive, bulky and muscular Mahindra service is very good for every car of Mahindra. Thar is the signature product of Mahindra so company has focused on the best services for his costumers I like very much Mahindra thar.", "Received the vehicle after 2 months of booking, process was smooth . lot of accessories are pushed by the dealer so try to be precise and decide on which ones u need genuinely. Ride quality cannot be compared to sedan but then its a high riding suv. Initially was bit uncomfortable but as time goes will start loving the Thar . suspension is sort of stiff at times . I currently have no problem in cruising at 130 kmph .The car is stable at that speed . Couldn't feel the body roll most people complain about . Wind and tyre noise is the only problem i faced. service is usually around 8 k do it at 6 months of 10 k km cons backseat entry is difficult for old people once inside its more than comfortable very less boot space", "Driving experience is good, Thar is a sport car, very strong material used in car the look is unbelievable.", "Very early to say that I have used this car for 3 to 4 days now so after some time. The fuel is highly questionable for me right know and want to know when the low fuel sign appears how many liters of petrol is left in my Thar", "Price is too high Very less space in cabin. It must be better. looks like a beast. Driving is very cool. Love to go off road. Milege on highway is 15-16 km/l. Sitting on the drivers seat gives feel of sitting on top of a building", "This is a car that you should consider buying because of a passion as an adventure, an enthusiast, a free spirit and one who believes in performance rather than comfort alone. The car definitely has the looks, every the fuel station guy would smile and asked me few questions. The power is in the petrol version is awesome, you can feel the burst of energy and speed. Mileage is not great expect 9 km/l anything beyond that is a bonus. The front cabin is cool with lots of features on the dash and the seats are comfortable too. Back space is suited for two, not that comfortable. Boot space is fit for midget luggage's. Mahindra should address this problem. All in all buy with your heart and do not compare to the other so called ' Comfort Compact SUVS', i am 100% it will give you the thrills every time you are on the road.", "I love the THAR. Service amount is worth and performance is so good. Looks are attractive, headlight is also good, alloy wheels are very useful for off roading. Thar has comfortable seats and interiors are so good looking.", "Hardtops should have manual/electric sunroof at top variant. Rear seat should have adjustable cup holders at the middle of seat as in SUV 300. This two things should be added by Mahindra in the upcoming versions of Thar. It's like magnet in road, attract everyone attention towards it..", "Overall the car is value for money and if Mahindra gives a larger boot space I can challenge that the Thar will be the no.1 suv in India. Performance is quite awesome, especially in bumpy roads."], "5": ["Got the delivery before few days. Probably 1st delivery of madhya pradesh state. Excellent feel. However, this variant has become lighter in riding quality compared to the old one. Auto start and stop are new features. Since the height of sits is very good, the commanding position of the driver gets but the body roll remains almost the same", "Mahindra Thar price is also low on its segment, Everyone can take it. It runs very smooth, the power is also very good. The looks are very bold and very attractive too. Long life and low maintenance cost. It had to get more mileage and body is very strong.", "This car is the first choice of most people and it is really a very good car, the more it is praised, the less it is, it is very good. It's rating is also very good and it is 4 by 4.", "Driving Experience buying experience details about looks performance servicing and maintenance pros and cons , all very good about Mahindra, all products going futuristic model enhancing.", "Very Nice ...I loved it.. I have driven and enjoyed, also you can do off-road drive with this car. I salute to Mahindra for this gem for Indians . I recommend to buy this gems in place of any premium hatchback.", "Buying and driving experience was good Bold looks with good road presence It's a rough car so less maintenance Fuel lid should be with button with driver excess Also rear arm rest.", "Best of road vehicle . a bit problem in the mileage but overall an thar is a bull with exceptional skills and endless possibilities . Best and Amazing prices with lots of comfort and safety to offer.", "Overall good I am very satisfied to buy this car its really looking nice and beautiful car this is my dream car so I am very happy to buy this car. Thanks Mahindra.", "It is on waiting list I have to wait for 4 months. Driving is amazing with this car. Looks and the performance is also amazing. And the maintenance is also friendly. Pros and cons is also good.", "its a king for off-roading its build quality too good, it has a monster look, this is the one of my favorite car. The overall driving experience is good with the best performance and off-roading qualities, and stablity.it is amazing car in term of suspension, comfort and safety.", "Road presence, value for money, safety are the pros. Boot space, space in general and comfort could become better. Having said that, it is a wonderful car, especially for those who like to have a car with jeep like persona.", "This is very good car and my most loved car My most loved car is Mahindra thar Thanks for Mahindra it's make My most lovely car This car is very unique and interesting", "Thar is very good for off-roading And this is my favorite car Thanks for Mahindra it's make", "First of all thanks a lot for making this powerful of road monster.I think it is not only a Off-Road SUV.It is also a 4 seater V.I.P Car to show your personality.Mainly its looks is not comparing with any vehicle acording to price segments.It\"s Interior is also gorgeous.This is one of the favourite vehicle in my life which have been,I have never seen.Surely it is one of the sucessful vehicle from Mahindra.If anyone can support me then I am surely doing a world tour with this powerful monster Mahindra Thar.It is also my dream with Mahindra.This vehicle is 4×4 power,is very stronger then other 4wd vehicle.Not only good for road it also suitable for half water.If I dont have this SUV in my life then of course my life has not complete with my car collection.What an amazing incomparable experience.It is not popular in India.It is very popular in U.A.E & U.S.A.Not need to modify, everything is ready in this vehicle.No word to explain about Mahindra Thar.Just want to say go ahead with Mahindra Thar.Now I am waiting for 5door model Mahindra Thar.", "The buying experience very very nice.Mahindra Thar is also good in drive.It look very awesome. Mahindra service is good.", "All stops this showroom are best.Behaviour is also good.I had drive Mahindra Thar for 2000 km no any type of disturbance occur.Looks good.Solid looks black color is my favourite so I bought black Mahindra Thar. The Performance is out standing.Pickup is very high quality.", "I have been using it for last one year, overall experience is excellent, however I am slightly disappointed with the built quality as the plastic quality is not upto the mark. We own cars starting from Fortuner, Octavia, rapid, i20 and old Thar but my new Thar is simply awesome it gives more value than our other vehicle's. I have never seen people clicking photos of Octavia or Fortuner but this vehicle gives you complete value. Things which I like the most: 1. Value proposition 2. Road presence 3. Highly capable off-roader 4. Engine refinement 5. Safety 6. Looks Things which I don't like 1. Build quality 2. Halogen headlight 3. Underbody paint 4. Reverse camera The issues I have mentioned are minor things however I I'll be very happy if Mahindra pay more attention to quality instead of promotion. Secondly headlight is a serious problem because it cause nuisance to others, a projector lights can solve the problem but Mahindra don't care. Lastly I love my Thar so please take my review with pinch of salt.", "Buying experience is good and I received my car in a week and driving experience is so powerful, look is the 1st reason I bought 1st service is pending now but when Mahindra installed the accessories that process is very smooth.", "The best off roader in budget, however lacks somewhere in comfort, but overall super powerful and super classy car with a mighty road presence, quiet low average but on 4x4 can climb up steep hills.", "Very good, comfortable look, attractive, mileage is also good. Everyone who purchase this car will satisfy from Mahindra. One day absolutely purchase this.", "The Thar is good car for off - roading it's performance is very nice and ground clearance is very comfortable. Driving modes are awesome and best in SUV segment and top off - roading quality.", "I really like this car, Price little bit high, smooth driving look is awesome servicing and maintenance average ,all colors look good and interior look perfect overall i love this car.", "This vehicle is cool with a strong engine and good for a hedgy ride. But utility wise this is not the vehicle to go with. It does not have any boot space plus this vehicle is more of for a show and status than normal day-to-day usages", "It's awesome car looking for good car driving is very nice interesting, good interior and driving. Very good car", "I was using first generation Thar so it was obvious that the new one was next on list. Buying experience: ok Driving experience: as per jeep standard good. Looks and performance is mind blowing Service and maintenance not that great. Pros: it is a wonderful product from Mahindra specially for those who love jeeps. It gives you that feel of a big suv, seating is comfortable however luggage space is a luxury. Compared to old Thar this is a huge improvement. Road presence is amazing Not done much off-roading but recently pulled one Eicher-Volvo truck. Cons: Build quality is not up to the mark, please get a good underbody paint job done at the earliest. Plastic quality is ok Conclusion: It is not my Thar it is our Thar, specially 8 years old son loves it even more than me. It is an experience worth having. We are owning i20, old Thar, rapid, Octavia and Fortuner but new Thar standout of the crowd. By the way this review is not written for any monetary interest however it is to help my brother's to make right choice.", "This is amazing and fully super stylish car very much enjoyed but mileage is very low. Buying and driving experience was good, performance unbelievable.", "Driving experience were awesome and no need to worry about safety. This vehicle is very useful to me because i used to drive a long range destinations. I hope everyone should try it.", "Very good Looks and engine performance i drive this and i feel very comfortable seats and other things and 4/4 is wonderful I have driven on Hill station and off-road , good performance in all time.", "Its a happy car. People turn around to look at this car. Amazing car to drive. The driving position gives full command on road.. Feel safe on road and at high speeds on highways. Loved by most who get ride in Thar. Very happy to own this although mileage below 10.", "Driving experience is so good . And look wise awesome mind-blowing .about small details is also good . Inside finishing material type. Awesome Mahindra Thar is incompatible.", "They took some time to deliver it. but surely it was worth the wait. the catchy looks. the driving pleasure everything is at its best . maintenance is pocket friendly.", "It's a nice car, but overall it's too expensive to ride everywhere by this. I like adventure, and l love SUVs of this type, but I am not fully satisfied with this interior according to price. And space nearby the rear seats is not enough to comfort. And the Price of this SUV does not match these feature. And waiting period is 1 year is so long But NCAP - 4 star rating is good Because this car made India .", "It is very good and will give you a nice feeling like king. Have good ac very suitable and comfortable. I have driven it and it was very amazing experience.", "This is a best car,I have seen and I have used.This is a very powerful car.This is a finest car for off-road drive,and this was very good for road.It's my pleasure to have this.", "Smooth driving, experience is good, comfortable seats, very smooth gear.", "The car is one for the old and the unique in its segment gives the best performance, power, Off-roading, and the feel of rough and rugged productivity of a Mahindra and the price is also less in terms off feature given for Off-roading!", "Nice car, not to buy by mind buy it by heart, mileage is low, totally fun and enjoy the product by Mahindra.", "It is a best car which provides good mileage. It has good facilities and new features compared to others. To drive the thar it's good and easy. It's comfortable to drive. The average also is minimum compared to others.", "It's a comfortable and easy to drive with good mileage and best features that average is so good about comparing to other cars . And I like it because there are many new features.", "Superb and smooth driving, best suv in the market, it's a great choice buy it. It's my personal opinion.", "I don't know about it but till now I never liked any car but Mahindra Thar was the first choice and the last forever.", "This is an awesome car. The car has very good power and good mileage, good comfort, good design and people feel jealous seeing this car.", "My experience with this car is very good and I love the design. The thar was my favorite car it was my second hand car. I drive it for 1 year. It's performance was so good thar it is the best for off-roading and for trips.", "What a car. This is awesome. Go for it. because it is also different xuv. When you come with this xuv every one will see you.", "Nice Car give better performance in off-roading but company should upgrade the interior. Best Car for long drives and Road Trips and there is little bit problem in Mahindra Thar 2020 that is leaking roof.", "It was an amazing experience in my city showroom, then after 2 months I got this because someone had cancelled that model and went for base model. I liked that so I got this. When I test drove it, I felt the power of Thar so tough, it can't be explained in words. In my neighborhood a man of 25 has bought 8 month old Thar and modified it with very heavy tyres, headlight, sound system and other things. The thar looks like a monster in my locality. Thanks to Anand Mahindra and his group for his focus on such sub compact SUV. It has a great engine and there you get approx. 12 km/l mileage that is good for such sports cars hungry for fuel. I am sure you that you will never be disappointed and dissatisfied with power, comfort, performance and looks and other things that can happen. It have best airbag and fully control. Owning the Thar you can enjoy your summer in Ladakh and winters in some Mumbai,. This car's power is amazing that you will be fan of power.", "It's bang for the buck, not boring like the typical suvs out there, it screams and smiles that I will go where you want me to go without a frown, it's easy and subtle, head turner and special enough to be passed on to the next generation and which will still be wow!", "It's been 7months since I've owned this beast and driven up 12000km with an average of 13.68km/l on highway and 12km/l in city as my manual calculation. I'm a big jeep geek, from my 1st modified Willy jeep to Thar crde which I had for 5 years, driving it daily and now the new Thar and trust me everyday it's like a new experience for me. I have take my beast to the narrowest roads of Himachal to dirtiest trails of river beds and its just simply wow, Have pushed the acceleration to 160km without any hassle. The engine doesn't cry to stop but instead it demands to be pushed beyond its capabilities. The low luggage capacity, wind noise above 100 km are itsy bitsy things which are or can be ignored because off what Mahindra is providing its totally a different category/segment which can be compared with. Its a THAR thing and only the people who are into it will understand what I am trying to say. Overall value for money, gr8 experience, best in class/segment.", "It is a best car in my life. I salute Mahindra for this car. The Mahindra has make a great family car, dashing ,and attractive classic car for the middle class people who's budget is from 10 to 15 lakhs which they afford on loan and EMI. The car is really auspicious and excellent service we get from mahindra.", "I bought it last year and was amazed by its looks, talking about driving experience it felt like king of the road. All credit goes to its grand and royal looks. I would suggest it to reduce the price and have great mileage, but one should greatly consider for off road experience.", "An amazing four wheeler, wow one, it is so soft to drive , sitting space is good, it exterior is so attractive an charming. beautiful car.", "Dream vehicle of today's generation in low price good service are available in the cities, nice interior and exterior future compare other jeeps and good seating capacity with 5 people and while driving you feel more pleasure, engine capacity is two high when we compare to other vehicles and good options of colors.", "The car was to good , and engine is more powerful than others, best model in Jeep. It is better then others jeeps. It is best comfortable on highway and off road. No maintenance is required.", "Overall performance is awesome, one can buy the Ax luxury of Mercedes muscle trucks in Thar avatar. Those who are having small family or those who are trek junkies should go for it", "", "", "", "Very good car which is more exciting on off road driving as well on city drives. This car is amazing. Not a single car is valuable than this car. I will give five stars to this car.", "Top class driving experience. Looks are so good with excellent power and smooth performance. Maintenance is not high. Interior design is so cool and pretty. Cons- Top speed only 180 km/h.", "It has very good approach and departure angle on front and back so it can climb into and out of high obstacles like any thing without having worry about taking a fender off. The suspension is pretty good.", "Awesome car is very good car for comfort and driving gear is very smooth alloy wheel is very awesome and sun roof is super duper nice and ac is very very cool and my experience is very good for car.", "Lx variant is better to buy as a family car. AX is not for daily use. Lx is like family and for daily use lx variant gives for more features. Ax variant is for off-roading. Go for ax optional.", "All should buy this car. Comfortable while driving on long route. Nice performance excellent servicing, nice and cool looks. Night Beast looks like black panther. I just Love this car.", "", "", "This car is very attractive and stylish. Comfortable for any type of road. This car is present in both diesel and petrol. Easy to drive and maintenance is also low. Mahindra Thar is beast. If you want to buy car you must go for Mahindra Thar. Mahindra is made in India multinational company so I prefer anyone to buy it. Thank you", "Driving experience is very nice, I enjoy riding it and interior design is amazing no other car would give this at this range.", "I have driven 1000 kilometers on the new thar 2021 from jammu to kishtawar and then entered kinnur off- road to reach the destination in sipti valley. It was a wonderful drive and also comfortable level. I explore many experiences regarding safety and off-roading etc.", "This is a first class effort by M&M. I loved the car the moment I saw it and immediately booked it as my ideal long term Grand Tourer. Everything about this vehicle overall is of good quality and certainly value for money. I have the LX Petrol Hardtop AT and it is an amazingly refined engine mated to a responsive and slick 6 speed Aisin Torque Converter gearbox. I have driven more than 2500 km's in the one month I have owned this vehicle and it is superb on the highways in terms of noise free, stress free, mile munching and equally light and easy to drive in the city. Yes it does look stylish and imposing. And at the same time backs up the looks with solid functionality. I am very happy I made the decision to purchase this vehicle. It is the perfect grand tourer for a couple, their luggage and perhaps their pet dog. Suits my lifestyle perfectly. No regrets at all. Good Work Mahindra!", "It's just amazing and comfortable, Interior and exterior also nice, smooth driving, safety also good, provide airbag for both side, can convert in 6 seater as well, alloy wheels also.", "It is very comfortable car . it's so nice and good looking car . It is super strong. and working condition is very good .in this interior design very good. it is power car engines.", "", "", "This is a wonderful car with best ever driving experience i am going to give 5 star for this car if you are buying a luxury don't think about money because a luxury gives you high profile.", "Very good car..so stylish Car Hai..looks so sexy in this car..best car in my experience. the ride is too good and every other car looks a child in front of this car..everyone should buy this car", "Very nice in all experience and very nice design and interior. Servicing is very good and have no maintance . Interior build qulity is very luxurious and beautiful. All over design and front design is very nice.", "Very nice car with good features and average is also very good. With excellent features. Speed is also very good. Engine is also efficient with great power .4 by 4 model is very good", "Amsome driving , look stylish, power delevry also amazing , cool interior pricing was little high, overall super look like an offroad suv , 100% inspired like a jeep , simply saying superb", "In terms of Road Presence its the most unmatchable segment. A class that can not be compared with any other car. Whether its about the doubled budget for the wheel you talk about. That is something different in its own way.", "Indian class and jeep wrangler of Indian brand experience was superb but if you go for petrol automatic and expect average then you chooses wrong car sodon expect a average of of mre than 6 to 7 kilometres per litre in city that to if you drive property and smoothly an 9 to 10 kilometres per litre on highway if drive at the speeds not more than 70 to 80 kilometres per hour", "", "", "", "", "Mahindra's vehicles have always been strong, and driving is also good. I also have a Scorpio that I took in 2014, and even today I have a king car, I would like to have a car like the Thar in the future, being an Indian brand, this car is nothing less for me. That we Indians can do everything thank u", "My dream car and i am lucky to buy this car. Totally smooth driving experience and it's look premium and op performance and service cost and maintenance cost is a very good budget and op performance and service cost of the beauty.", "i had driven the all-new Thar for about couple of thousand kilometres, and no doubt on the engine.. this is and scholar designed engine made for not only off rider buy also for daily users. the vehicle is so addicted that i am planning to build terrain for this vehicle :p. hahaha, never bored of driving Thar .. . \"Drive Thar Baki to sab Bekar\" Peace", "Superb Thar muscular look like an elephant, top convertable excellent for off roading, other 4x4 are very expensive to buy mahindras thar is very satisfying and value for money, great handling, suspensions are too good, powerful engine, Good Quality interior", "Perfect Bull... A car where you can trust on its power and comfortness. Look of this new thar is out standing. Eye catching look. And power of engine like a lion. Mileage is little disappointed. and where you are spending 13-14 lakhs. Who cares for mileage. Interior of new Thar is more comfortable and adorableness.", "Rough n tough Quality 4x4 drive with loaded driving features, worth buying a budget car if we compare it with jeep wrangler and other, no doubt that the performance of the car is excellent, feels like beast riding and handling, more comfortable than the previous version, easy service available oll over India with a low maintenance Mahindra has upgraded their vehicles now more value for money", "Bigger and better, The new thar is for all roads, feels like driving like a boss, powerful engine, big boys toy, removable roof for off-roading but the price is little high no comparison than competitors."]}