{"0": [], "1": ["Biggest scam of Mahindra to make money. Car quality and performance is best. But not value for money. Booked the w6 petrol amt in October, after booking many changes happened to feel like why I have booked. 1. Features degraded in Nov 2. Dint dispatch the model in Dec ( expected the delivery) 3. Delivered in Jan with 20k price hike, which leads to 50k extra road tax. Total 70k more for less features compared to booking time.", "Bad service, bad car performance, Tata is far better in term of value for money, service etc then Mahindra. regretting to go with Mahindra over Tata, should have brought Volkswagen or skoda vehicle atleast if not Tata.", "The critical issue of steering is hardening and you can't drive it a step ahead or can take turn.After first service of 1000km issue started, when I try to start the car in morning its steering gets super hard, first I thought it is locked but it was not than I thought it might be not in correct mode comfort.But that is even not the issue.Service centre is not able to diagnose the issue even after error snap given.", "After first service of 1000km, Suddenly my new car Mahindra XUV300 steering gets very hard and not able to move steering, with steering yellow light indication.This is very critical issue of steering gets super hard, almost like steering lock.And the Mahindra service centre is not able to diagnose the issue even after one day at service centre.This can cause a big accident in actual situation if it gets hard suddenly,very disappointed.", "Overly priced, did not like the drive. Low boot space is not good for family drive. Mileage is low, Poor infotainment system in W6 variant., bad sound quality of speakers. Interior quality is not up to the mark.", "Extremely bad and expensive car. Worst experience, Boot space is very less, initial pickup is bad, interior is low quality. No driving comfort. Price is high by atleast one lakh for every variant when I compare its features with other similar cars.", "interior is bad. High price of all it variants. Not suitable for travelling with family as boot space is less. not comfortable and looks disproportionate. Did not like this car. Other compact SUV's of similar price have better features and comfortable drive.", "Less boot space is not good for family with kids, music system is bad, over priced by 1 lakh as compared to rivals. seats are not comfortable, Mahindra after sale service is not good.", "Firstly, it was extremely bad experience while buying a car and after sales service from Koncept Mahindra, Noida. Extremely unprofessional team and did not even have basic knowledge of specifications. There is knocking sound in cabin that keep bothering me. permanent problem with its alignment. uncomfortable seating and music system is not good.", "Gandhi motors, Solapur, Service is very worst in future. Don't book the vehicle from this service center not good service at all, no respond, booked the car 55 days back still now I haven't received any booking confirmation.", "Vehicle clutch system burnt out within 6 months in 8000 km run, company customer care says that it can burn out in 80 km also, no guarantee or warranty as it is wear and tear party, they are asking to pay 38k to replace the same.", "Worst service provided by them, facing a same issue in my car from past 1.5 years. Never buy this car. Facing noisy sounds from suspension from long time, mahindra is unable to rectify the problem.", "Terrible car-5000 km pur he clutch plate damage ho gye , lots of vibration,very less boot space,and new problem in my car is irritable sound in during clutch paddle used. other thing is very bed servicing in dada motors Ludhiana Punjab.i complain a problem in my xuv300 glove box but dada motors not change bolte he abhe 10 days lugne he bolte bole 4 months ho gye he", "both alloy wheel was broken within 700 km driver and service was very pathatic . stuck at remote location and support was very poor. they charge full amount and not claiming insurance even not updating us also", "Please don't buy this car XUV300 BS6 PETROL variant. This car is not suitable for long run . This gives oveheats and doesn't accelerates after 100 km It gives lot of trouble when you are on highway and you are with family and it is night It is very risky with respect to family security becase company provides support after 2-3 hours. But please dont buy this car.also doesn't give mileage >12 km.it is very bad product of mahindra.", "Battery ki problems hai nai gadi kharidi tab se bar bar dawn ho jati hai pareshan ho gaya hu is car se service center ja Jakar pareshan ho gaya hu ab aisa lagta hai ye gadi meze bechni padegi iske alawa or koi rasta nahi hai mene kam se kam 5000 ka diesel jala diya waha jane me 14000 km chali hai XUV 300 w6 model", "Very poor handling, lots of engine vibration, gear shifting not smooth, Steering not precise. Only looks are good, built quality should improve. a long way to go forward for quality.", "The new car xuv 300 engine and turbo failed within 1 year and company are not replacing the car worst experience from Mahindra company. I did every service at a time and it travelled just 40 thousand km and the engine failed", "Definitely not worth buying. When better alternatives are available at a cheaper price. No one should even think of it. While running on a low budget, this car passes all your predetermined expectations at a cost which when compared to it's main rivals feels to be much more overhyped vehicle. The best alternative would be Vitara Brezza", "There is 1lak difference from W4 to W6 but there is no major difference... Just fee things which can come in addition accessories in 40k itself... Too much experience in W8 without any features updated... Just the same in all... I was wondering to get this car but I won't suggest having this better go for Ford EcoSport in this segment... There basic model and mid variant itself has a huge difference...", "After 10 days of purchase.. Sound started coming from brake and suspension and doors and I complained many times to dealer but in vain they couldn't solve it.. Now its 11th month running still same problems..", "After driving a few 100 kilometres I found the clutch is not working properly. During the initial inspection, they replaced the master cylinder. And now today my clutch plates are gone. The vehicle has done only 5000 kms. I do not recommend this vehicle.", "Suffered so much after Buying XUV300. Car is nearly 4 months with Mahindra Service station in the last 4.5 months.I am going to write a series of all events in detail soon with a special page dedicated to my sufferings soon.I am having my car with me still while I am writing this mail.", "Huge issue with the brakes of this car. Most of the people don't even know because of playing music in the car. While driving @ speed of 20 to 25kms and applying the brakes car makes the noise of whistle. Even company has admired the issue in this car. I have driven this car for 10000 kms and they have changed entire disc brake system for for 3rd time. Dashboard also makes noise. Pls stop the music drive the car on a slow speed and then you will come to know about the issue.. not happy with the purchase. Driven ford for 7 years but have not found any such issue even after driving 1.5Lac KMs.", "", "", "", "Poor mahindra has used poorest material to make it money out of it. Spares are not available in market even after a 6 months of lounch. Wipers and side glasses are broken without touching them", "This car has noise from front axle on bumpy roads like its 7,8 year old car. Mahindra says its design and noise is existing in all cars. Pathetic..this is. I have visited service centre for this for 4 times injust one month after purchasing the car. On delivery date the noise was there. I came back and asked . They said axle was loose...new car acle loose.... The noise continues...new car noise is there.... Poor suspensioj for a car in mini suv segment... Dont suggest anyone to buy this car.", "I bought XUV 300 W8O, two months ago but after 10 to 15 days the whole body started making sounds, I gave for servicing but the result was horrible the sounds increases double. After complaining, the dealer told that the car has a manufacturing problem and the company has been researching on that. Again they called me for another servicing but that also didn't worked, the problem rises only. A permanent solution that they will give... I hope soo, if the car has such a major problem, then the dealer should stop selling the car.", "Which idiot would pay over ?9 lacs for something's that designed as bad as the xuv500 ? Why not buy the venue for a price that's lower ? Or perhaps pay a little more and go for the scorpio or the creta ? Or just buy the verna for the same damn price ? Mahindra has gone awfully wrong with this pricing of the xuv300....it's sales will only be restricted to idiots. Mark my words.... Anand ji pls focus on your work and stop browsing the net for jokes and quirky things that ppl do....do what you have to do first....YOUR WORK.", "1. First things first Mahindra executives are untrained and unprofessional they promised the car in the first week of april but was unable to deliver and then they billed it wrong. 2. Riding experience was ridiculous as the car’s knuckle and axel broke when it bumped in to a minor curb, and it didn’t even started in spiti valley where the temperature was 6 degree celsius. 3. I wont say the car is not all bad after all its best looking in the segment. 4 . Cons first cause they are so many 1. Bad and low quality of products are used. 2.it is not reliable as the car didn’t start in higher altitudes at 6 degree celsius 3. Inferior quality of material is used in interior 4. Car does vibrate a lot sometimes when you star the ignition Pros 1. Exterior design of the car is good.", "This car has issue in brakes at least in my car. It makes huge noise while drive on a slow speed. Brakes whistles like a bus. Nobody from Mahindra even bothers. Even mirror of doors has started making a noise after driving 4000 kms. Sometimes gearbox sticks while shifting the gears down. Not recommended to anyone as mahindra has no resolution to these problems", "", "", "Top model cost almost 15 lacs, people can buy creta in that pricing so why would they buy your top model, your car is just a streched hatchback and you guys asking this much for your car, ridiculous. This car should priced between 7-10 lacs", "Ford ecosports is most powerful in this range w8(o) total wastage of money,xuv 500 is best suv but xuv 300 is wastage of money if any body want to purchase it ,so in my suggestion u go with scorpio or xuv 500.", "I have chosen Nexon but awaited to see the launch of this car. Now, Its seems to be unworthy for waiting of this car since variants are not loaded with features for the money. I won't suggest to go for this car as rival cars are cost worthy and loaded with lots of features.", "less hight, not installed latest requirements of interior. ground clearance is very less. uneccessary things installed which is not required in India. very short vehicle compare to wagon r", "The mahindra was cheated all Indian customers.. thats y mahindra was launched the vehicle 10 days before its price details launch... All variant of mahindra XUV 300 is overpriced one lakh Rupees/each..."], "2": ["Driving experience is ok but not good. Still thinking about upgrading. Price is costly. Safety wise its the best one. Need more features", "cons 1] boot space is very less 2] price of the car is very high comparing with competitor 3] esp, tcs and hill hold safety equipment are not available in base and mid variant of the car[ Tata Nexon has provided in base variant itself with less price] 4] ground clearance is just 180mm [fiat punto 185mm, ford freestyle 189mm, Tata Nexon 209mm] 5] no rear ac vent pros 1] excellent performance 2] interior space is good 3] breaking is awesome 4] excellent build quality 5] nvh is great", "Buying experience was terrible the worst showroom sablok cars Ahmednagar Mahindra should give drl to W6 If they are not giving atleast give fiber patch to fit from other shops customers have to drill screw on car to fit DRL and this is worst. Mahindra is harassing customers. They should give some kind of system under the front bumper so that customers can fit DRL from different shops", "Cost is too high in compared to its competitor. We can get better feature in Tata Nexon and Kia Sonet in same price range. If we consider xuv300 w8 petrol then we do not get sunroof , diamond cut alloy wheel , safety features like ESP , traction control in same price which is there in Kia Sonet htx and Nexon xz plus model.", "I have booked the vehicle 2 months back but still dealer is not able to give me the correct delivery date, customer service is not good and they can't tell even the delivery date correctly.", "Buying experience from hare krishan classic car care Mulund was not upto the mark Driving car was good in the start but after 5000km i experienced so much of vibration on the steering wheel I'm not at all happy with this quality of the engine", "No rear ac or vents, feel hot during normal days also The best car in the segment does not have rear ac vents Which make it last in the segment could have been better rear ac vents is must", "I bought XUV 300 in February 2019. Just after driving few hundred kilometers I noticed sound from front side (probably from shocker/suspension area) when the car ride on any speed breaker. I got the vehicle inspect at the service center but still they are not able to resolve the issue and as per them Mahindra is trying to diagnose the issue. For them its a manufacturing issue. I do not know why Mahindra is selling a product which has a manufacturing defect. I DO NOT recommend to buy XUV300.", "W8 is a little bit costly. It can be considered as a good suv in this segment. I personally think that creta is a much better option to deal with bad roads and power is much better than xuv300", "I have purchased xuv 300 in month of March 2019 I have some issues from purchase date of car the car had major issue in rear side its rear chassis nut bolts loosed every time I have 6-7 times visit to workshop or mechanic same problem s occur at the time mechanic said that it has 14 no bolt rather it to be 17 no. Please solve this problem ??", "Cons- 1. Boot space is very bad. 2. I didn't like interior that much. 3. Top variant is not value for money. Some features given is not useful on daily basis. 1. Dual zone climate . 2. Steering mode. Rear ac vents required. Wireless charging. Interior quality and buttons must improve. Engine performance is not that much good.", "Buying experience: Experience is good, after buying I think not happy in future.....\nRiding experience: After 110 not safe, under 100 is good...\nDetails about looks, performance etc: It's good look but not for value of money....\nServicing and maintenance: This car not go for service...\nPros and Cons: Pickup is so good, feel not safe, after 110 go out of grip, interior design so so...", "I was eagerly waiting for xuv300 launch and I even advised my friends to wait for this vehicle as they were planning to buy most popular Breeza. We were hoping to get this for 10lacs but we are surprised by looking at the prices on the launch day. I'm very very disappointed with the price and 1lac should be less in all variants. I'm dam sure that, it may not compete with Breeza due to it's high price and I too dropped the plan to buy this vehicle. I'm sorry for that.", "Excited by the advertisement and the features , booked the car in advance in January itself. But really disappointed with the price, The top wariant is way too costly for a sub 4 meter suv. 14 lacs for a car with no boot space. In 14 lacs i can get many cars with more space, more boot and safety features. Seems like , this whole feature loaded thing was just a gimmick played by mahindra. Big disappointment. I will get my money back but unfortunately , mahindra wont. A good product, good marketing but failed pricing.", "Good but not good as Hyundai creata . Hyundai creata is more spacious and more boot space and more power full engine than xuv 300 both of them similars suv in this segment but creata is better", "All the features are in W8 variant,should have added more features in W6...Disappointing.Done the advance booking for XUV300.Now planing to take refund of advance payment.At W8 price many companies option available .", "I found this car a bit expensive. The top end W8(o) is close to 15 lakhs and if you choose to buy other lower versions you miss all the features.. which is sick. Better to choose Nexon."], "3": ["Purchased it from Unnati Motors, Pune. Buying Experience was very good. Took Test Drive twice before going for final decision as i was confused between Kia Seltos Diesel IMT & Mahindra XUV 300 Diesel AMT W8 (O). Price gap was almost 70K for on road price. Kia people was not ready to give single Rs. Discount as they have too much booking in hand. So I don't like this attitude. Moreover i liked XUV 300 also which comes with more features in less price than Seltos as I was planning to buy Top end model only. So finally I made decision to go with XUV 300 AMT Diesel W8 (O) Dual Tone. Car was available in stock and delivered within 15 days. (Here i was not looking for Dual tone, i want to buy White color XUV300 with new logo, but they said they have vehicle with old logo which i don't want. Then they informed me that Dual Tone (Red + White Top) available with new logo & i booked it. * If people have more budget up to 23 Lakhs, blindly go for Scorpio-N. It will really give you feel like King and you will forget about Safari, Fortuner, Endeavor. My budget was up to 17 Lakhs only so i choose XUV300 and i want AMT Only as i was fed up of clutch usage in traffic. Driving Experience:- 1} Request to all Indian Buyers. Please don't underestimate Mahindra. They have done lot of hard work while building the vehicle. Diesel Engine cabin noise is almost nil as they provided great insulation. 2} My Height is 5 Ft 11 inches. When i seat in driving seat and adjust the seat as per my comfort level, so in my rear row, any tall guy of almost same height can sit very comfortably. (This is because rear space has more legroom due to which boot space is less) 3} 5* Safety, Best Features with Hill Hold Control, TPMS, Sunroof, Cruise Control, 6 Airbags, Three point Seat Belt on rear sit and many more. 4} In Pune City mileage given between 15 to 15.8 Km/L ( My daily run is 50 KM in traffic) And if AMT vehicle giving you this mileage then what more you expect? 5} Driven car almost 2100 Km out of which 1000Km was highway drive. On Highway I got 20.9 Km/L mileage. Due to good roads i driven most of the vehicle on Cruise Control. 6} 1st Servicing is done at 1000 Km for all check up. Small vibration was coming from boot door which is then solved during servicing. Now vehicle is ready to go long long way. 7} Before making any judgment for Indian brand, first take test drive, look at the features they are providing, price, mileage, service cost, parts availability and most important Safety & Going for Indian brand which Indians don't want to go for only because they think only foreign brands like Kia, Hyundai are best. But these brands are nothing but all about Looks only. Safety Seltos, Sonet, Venue all are having 3 star ratings. For Pros their is long list but for Cons their is only one which is Boot Space. But 250 Litre Boot space is enough for my family of three as I don't carry luggage all the time. 3 Suitcase and backpacks can easily fit in this boot space.", "Good front looks Refined engine with less noise Spacious and comfortable seats But w8 diesel version seems to an expensive deal. Because with same amount you can go with w8(o) petrol version which has more feature than w8 and also sunroof.", "Buying experience is good. With a 40 days waiting period. Initially I was spellbound by the driving quality and punchiness of this diesel engine. But after driving a few thousand kms clutch pad gave problem. When I had to long press it in traffic it just got stuck at that point. And I had to take my feet back. After 2 times of check up they rectified it. then it was running well and after 30000 km drive I faced a serious problem with gear box housing kit mounting problem which was solved at service centre, but again serious problem occurred at 40k km. Same problem with bitter experience which I faced. obviously service providers tried their best and always helped me. Now they solved it. Waiting for good days with these machine", "Indian brands still refinement, quality and after-sales service. Wake up Mahindra...look around and make vehicle according to the competition .. No doubt powerful engine but with low ground clearance and not usable boot space.. What is the logic behind? Indians need a dual-purpose vehicle not those ONLY FOR URBAN USE.", "This car gets a shatter sound and different sounds music system is worst no resale value and each and every problem noticed in car better go to buy another one very disappointing thing", "As compared to another sub compact suv.. Xuv300 is over priced and not enough boot space in this car so plz avoid this car and choose kia seltos base our Hyundai creta are best choice. Scorpio is better options for real suv lover. Nexon is good option.", "I have a W6 Diesel, automatic version. The pickup and gear shift has a serious issue. The car stalls between A1 TO A2 or A2 to A1 shift. The system does not recognise speed reduction, when you try to pick it up, the engine just stalls. Also, shifting the gearbox to different modes gets stuck occasionally. I have driven automatics for 15 years, this does not feel like one", "Absolutely great ride, good pickup smooth ride and ,solid looks, wider tyer ,solid road presence,the front drl looks superb and special thing about this car is available in mid budget suv", "Acc to price features are not so good... But comfort level is best and can add more boot space if possible ......,.....rest is ok if u like the look..otherwise add little bit more money and buy scorpio", "Poor fuel economy spoils ownership joy of petrol XUV 300. With their ecosense score of 97, I could barely manage 12.5 kmpl, with instantaneous value never exceeding 14.5 kmpl. The claims are exaggerated to unethically entice customers. The vehicle's performance, aesthetics and facilities are superb in the category. It will meet it's Waterloo due to poor fuel economy.", "this car auto shift model is not perform well. Car millage reduce in auto shift model need extra time to pickup when you use break during drive rear all seat not comfortable and in this car you can not use amplifier or other music system if you use car info display will be stop rgds pradeep", "Car is quite good but price is too high u can compare features with other brands, Mahindra thinks should twice before launched about price it may be they can cut the price after market survey , so I think if you plan to buy this machine u have to cross check with another company vehicle in same segment than you can easily judge the difference between xuv300 & other.", "little bit expensive, in fact it will become more expensive once AMT version added. So M&M Should work on pricing issue.\nNANA", "The car is good but the economy is very low it should be better , mid model is a value for money but the top model is overrated , the ground clearance could have been better , but overall I love the car", "Servicing and maintenance: It's easy to maintain and easy to drive", "", "Length & Design issues, mailage is very very poor compare with other cars like Brezza, ecosport, nexon, & all other competitors, price is very high & looks not excellent, i like brezza look & mailage but feel very cheap plastic quality, please drop down price, because at this price point other company offers best package", "Buying experience: The car is good but the sale person himself don't know about car features...\nRiding experience: It is amazing ride in sport and city mode.\nDetails about looks, performance etc: Stunning manly look. Solid built.. muscular\nServicing and maintenance: Service I don't know but I think magenta cars are less maintenance.\nPros and Cons: Good car design features style and safety features. Cons : low ground clearance and low boot space...", "Buying experience: Behaviour of the showroom employees is nice\nRiding experience: I got a test drive... And it looks nice in drve n comfort\nDetails about looks, performance etc: In exterior looks it looks small .. then from creta Interior is too good comfort drive", "jaisa ki maine youtube videos me dekha car kafi badhiya hai kayi naye features hai or attractive look bhi hai car ke but ye car indian market me launch ho rahi hai to iske price jrur matter karenge base ke 2 models me alloy wheel bhi nhi provide karaye ja rhe hai or top model bhut jada costly hai around 14lacs me or bhi acche options available hai or 2019 kayi gadiyo ke facelift ayenge to log unki trf jada attract honge. last me yahi bolunga mahindra ne price hisab se set kiye smjh nhi aa rha.", "The car is a good package but does not give you also SUV feeler - where it is placed. It is feature rich and spacious as well. The ride quality is good and is best in the segment, however, again, it did not felt like I am driving a SUV - at which EcoSport is great within this segment.", "Top model Rate is on higher site as compared with competitor cars. Ground clearance is low. Boot space should be more.\nNANA", "The 3 must improvements you should have to have the most upper hand in your segment. 1. From this model onwarda, Rear AC vents should come into the picture. 2. From this model onwarda, Rear Armrest with cupholders should come into the picture. 3. Most importantly in W6 model you should have launched AUTOMATIC TRANSMISSION. Rest it is picture perfect.", "", "Overpriced Car... Xuv3OO W8(0) Requires 12.50 petrol prize, instead of 13.60.its my dream car. But prize is not upto the mark. Disappointed. Mahendra think about again and again about Prize. Overpriced. if u reduced at least insurance cost i will definitely bye this car. I have waiting for this car from last 2 months. So think on insurance cost at least. Give discounts.", "Drawbacks - Cons 1) 1st Gear Change 2) Soft Clutch 3) Small boot space 4) Noise from engine at 100 kmph speed 5) small storage in front seat box 6) A/C isn't strong at rear seat Good One's - Pros 1) Packed with features Ist in segment 2) Value for money 3) Good off road driving 4) Comfortable rear sitting 5) Nice looks and beautiful sub 4 meters car", "Price Difference between each variant is very high , top end variant is the only variant which is loaded with all the features but still way too expensive......it's better to go for Tata harrier base variant than the top trim, Mahindra think about your pricing , otherwise instead of being a fantastic product it would go beyond in competition.\nNANA", "it's overpriced. although the engine is great why is Mahindra still stuck on arai mileage of 20??? competition is offering 22+ mileage.. plz understand.. fuel prices are not gonna come down and taxes on diesel vehicles wud eventually increase! also, the pricing seems a bit unfair.. it should have been priced at least 50k cheaper..nexon xt is priced almost the same.\nNANA", "Cons: 1. Overpriced 2.red plastic of interior looks very cheape 3.tivoli has been cut from the back to make a compact suv which resulted uneven front and back style. 4.265 ltr boot? Seriously ,kwid has 300 ltrs 5.2600 mm of wheelbase where did the spacee go? In real life its as gud as nexon or wrv. Pros: 1.gud torq engine but not worrth the hyp", "Huge cost difference between W6 and W8 model. Considering the price of W6 lot of features are missing like parking sensor, orvm should be electrically retractable. Very basic features provided considering the the cost. Mahindra should provide more features. Price of W8 going up to 12lakh some of which features should ideally be given in W6. Paying around 12 lakh for 1200cc engine is not worth in my opinion", "Quite expensive in his segment. Just because of the sun roof the top model cost 13.80 lacks. S cross Breeza Tata nexon can be good option then this. .... even boot space is less then Baleno"], "4": ["Style is superb fun to drive most stable car in high speed also performance is great and ground clearance is nice comfort is top notch level its smooth you will feel like you are driving luxurious car.", "Lag for high speed, great pickup. Nice balance. Smooth driving. Relax engine. Solid body . Indian company beat any other in this segment, great work by Mahindra, nice belt quality no sound.", "Car with less features as compared to venue and Nexon in same price range but performance can beat Creta The material used for this car is really worth for 5 start ncap rating Boot space is issue but rear comfort is great No noise like Nexon If want to purchase w6 then add music system else everything is in car Price is high compare to same suv in this segments but will none of suv in this segment can beat.", "Car Driving experience is Excellent .. Facing milege issue getting 14 to 15km per LTR Engine power is good compare to other XUV .. Interior Design looks good ..exterior looks better its over all value for money .. Service related No issues .. My major concern is on mileage. XUV 300 Will give max to max 16km per litre.", "2nd gear in lag, mileage little bit low, petrol engine giving average 13-14.5 km on display. City: 12-13 Highway: 15-18 average : 14+ We can't expect more than that. If we drive lower rpm(1500-1700) in between 50-60 km/h it will give good mileage approx. 17+ average.", "I love to drive this car , the most powerful and fun to drive car, having very good passenger space in both rows, boot space is slightly less but can be managed . i had drove 40thousand up-to-date and used it in all types of roads just like hills as well as plains. highly satisfied with its performance. Mahindra servicing is ok but their company is very responsive. they give very quick response and act superfast in any type of complaint made to them.", "It is descent , demerit with boot space and ground clearing other than it is worth enough Have appealing front and back design . Should have connected car features as most of top end models have.", "This is one of the most eligible and comfortable car at this price.It performs all my expected parameters reason for most loving because their NCAP ratings and i also feel it.This car is achieving their reliability.", "Dealing with Mahindra have been a surprising journey, from my booking to delivery a lot of features were silently removed which was disappointing. Lower tyre size, no rear fog lamp, no door lamp, no boot lamp, no heated orvm, 6 airbags now, no glove lamp, no passenger side smart unlock key and a new diamond alloy(this one is a plus). Now info bluetooth is malfunctioning, hope will be fixed soon. Riding is full of comfort, power is high, turbo is felt when accelerating. Request carwale to update this car with latest information/features, for people to make a choice based on only facts and nothing less. Would still rate 4 out of 5 to this car, in 2021 I would have rated 5/5.", "Everything Is Perfect For This Range.. The most Important Is It's safety and power. I loved the clutch; really smooth. The road presence Is awesome. The car has eye catchy front looks..", "This Mahindra XUV300 1.5 W6 is a perfect car for a family with two people.It's the safest Suv Car In India.It's looks are just amazing,with a comfortable rear seat.Good for long journey.I love this carand would like to purchase it at any time.", "I am writing this review after driving for one year. Pros:Very stylish and safe.Very spacious.The mileage is around 12-13 in city which goes upto 18-19 on highways. Cons: The clutch is very deep and becomes annoying while driving in heavy traffic.", "Very comfortable, nice exterior- internal looks but removed spoiler and armrest by Mahindra due to cost cutting. Overall very good machine. I have purchased this car after taking test ride of Kia sonet, Kiger, Creta. I really like it. it's driving experience is good.", "Overall good experience and sunroof is also amazing. Exterior rolls, dashboard also looks nice. Pickup is very high and tyre size is small. They must be bigger like 500 Overall a very nice car. .", "Nice and solid car with great look overall and interior and exterior is good but luggage space is not so spacious and mileage is also not good..I will say that overall will rate 3 out of 5.", "I would like to share my experience and why I brought XUV300 w6 petrol. I booked hyundai venue but later cancelled the booking because it has less space in the interior and with quality i am not satisfied and safety is not up to the mark. I paid booking amount Rs 5000 but they returned only RS 3000 that also with lot of effort and worst customer handling. Then i decided to buy Mahindra XUV 300. After taking test drive it felt like the power, suspension, interior is awesome and i have selected W6 Petrol which cost me 10.05 lakhs after 1 month waiting car got delivered to me. In the beginning I felt very strange noise and whole car is vibrating and i complained and they took nearly 1 week to rectify the problem. After done with 60000 kms the performance is decent not very good not very bad but the build quality is really very good and car body is very solid. This car gives me mileage of 13 to 15 at highway and around 12 to 13 in normal city driving which is little low but if you maintain 85 to 95 speed you may get 17 also. I big issue is that the Boot space is very small as compared to other cars which is the only major issue i found in the car overall the car is very comfortable while riding and service and maintenance cost is also low . At the end i would recommend this car to those who want fun driving with a good looking and safe car.", "Buying experience good, driving experience is excellent. Overall good. Excellent performance. I get 17.87 km/litter mileage. Suspension is like Elephant . Mileage is near to equal in city or highways approx.", "", "Car looks are good. Average is good, There was so much space to improve from the interiors. Infotainment system is good, clutch was tight not easy working .Back seat was comfortable for three persons.", "Only problem with auto shift, some times auto shift is not work properly, I have xuv300 w6 automatic diesel. This issue is still in my car, I will go again in Mahindra workshop for repairing, if you want buy this car then please go for manual version.", "Buying Experience: I booked on 23rd Jan 2021 and received on April 14 2021. Driving Experience: The feel attached to the XUV most of the times, felt refreshed and joy on high gears. Details about looks, performance etc: Mine is a W6 variant with limited features. so I don't feel much appealing on the appearance, surely I like or would recommend W8 variant which is an impressive package. Servicing and Maintenance: I just completed 3k kms so regarding service its not fair to comment, i have given first free service which is a routine checkup. PROS: Confident inside outside Good road presence Spacious and good roomy nature best in compact SUV. Cabin space and vehicle performance is competitive to Creta and Seltos. If we drive average fuel efficiency in city shall be 15 to 17 km/l and on highways 19 to 21 km/l based upon road and driving conditions. Sunroof was impressive. When i checked from Tank to Tank mileage calculation I got 19 km/l which I feel decent with all times AC on. AC is good Cons: Boot space is less which is 257 liters. It's enough and based on the space management techniques we can adjust 5 people luggage with ease. Power lag is there at 1 & 2 gear during the bumper to bumper traffic. Head Lights throw should be more better, I personally feel loosing confidence while facing opposite vehicles few times.", "Good driving experienced with this car and infotainment system also very enjoyable and suffers in this car very comfortable, and speakers are very enjoyable and good economic feelings.", "I have recently booked the top end variant, but the dealer called me and told about the price hike now it has gone out of my budget. During booking the price I was given was Rs. 11,23,000 ex-showroom. Now they have told me I will have to pay more than 50k. I don't know the meaning of booking amount as the delivery price will be totally different.", "Test drove it. Booked it not yet received. Heard a lot of good things. Yet to experience. Buying experience is not that good. But heard the service is good and very helpful.", "", "Design is pretty fine as it is the SsangYong Tivoli around 13,00,00 is the total road costing, diesel variant in AMT Could have been better synchronized but still does the job well, 300 and M torque is quite enough for this weight class, build quality study, servicing cost around Rs.3000 for 10,000 km overall Efficiency is around 16 km per liter with a highway average of around 20 and in city conditions around 12.. Pros Good engine , Build quality. Cons gearbox could have been better synchronized or DSG would have work wonders Small boot.", "Very nice sub one-meter car from mahindra very stylish and comfortable seating and interior was superb but little over priced but still deserved it . Carrying boot space was little less other that everything was exceptional", "It's a good car but wish we had rear view camera in w6 also. Mileage is ok ok it give around 14-15 in city and 17 in highway. I have driven near 6000 km till date no issues. It's fun to drive this car. Interior get dirty be cautious.", "In short ...wow Interior and exterior excellent Ride experience awesome Real SUV In this segment This SUV SOUNDS wow The SUV are very strongly recommended. From my point of view ThisSUV IS finest one", "This is a safety car. But the only issue which I had faced is delayed delivery. Since last 2 months, I was paid for this car but no delivery of the car even after 2 months. Customer care of Mahindra is giving the worst service. The title \" With you Hamesha\" Should be changed to \" Disappoint you Hamesha \".", "1. If I talk about the experience in Mahindra dealerships it's not soo good or I would say these people in dealerships just need true buyers they never pick a call n if u enter the showrooms they won't talk until u really want to buy or book these needs to b improved 2. The best car in petrol engines not just in its segment even a segment up handles pretty well easy to control 3.looks dope front the back side could b improved a little 4.cheaper then a Maruti for sure until some parts to b changed 5. Pros, performance seating comfort best backseat comfort in the segment Cons, as such nothing but message and boot space but it's considerable when u see the performance and back seat comfort", "Car has high performance, very stylish interiors, spacious seats for 5 persons, stylish dashboard with touch screen, had no problem with the car dealers. Completed the formalities in 1 day", "", "It is a nice car, rich in class and more comfortable and more spaces good sound system, worth for money, the interior is charming and l.e.d lights are so well and pic is also good, much but this car I just loved it", "I have taken a test drive for xuv300 at and it was awesome. We actually feels the power of the suv. It manages the road and load also and steady even if we are at 110km/ph. Go for it.", "I was very happy with buying this car. This car is very suitable for performance seekers. Driving is much comfortable and pick up is fabulous. And back design should have been better .", "Good: comfortable driving Bad: More noise seems music system is from 90s I didn't expect this worst music system. Expensive in this range Infotainment system can be improved a lot Last but not least, accessories and service are worst. I suggest Don't apt from the showroom Overall I have little bit disappointment", "Cost effective product,feels very good in national highways,usually i get 17kmpl mileage,awesome car in the range of compact suv's, here you get both petrol and diesel variant thats a open up for your domain of choices", "Milage in the city is a little worried and some suspension issue before 10k KM service and boot space is also a thinkable issue. Otherwise, a good product for purchase if anyone not looking for milage. If anyone finds power-related performance so don't worry about its power.", "I bought a Mahindra xuv300 car and now it is my love...this car has everything that you want, sunroof is awesome I like this type of car in this car space is very comfortable.I like this", "Driving experience good for long drive, I like to have rooftop view the out side things. It's value for your money and you safety as well, you can feel very comfortable and luxury fell.", "", "", "XUV 300 buying experience is not good riding experience is very good this vehicle lot of power and torque XUV 300 locks is very good look like a proper SUV servicing experience is also not good the vehicle have some cons like I spend 10 lakh rupees for purchase this SUV but some features not available the w6 variant rear defogger height adjustment seat and camera the consumer spend 10 lakh rupees but this feature is missing this is very disappointing", "Requirement of better off road clearance Experience at mahindra is awesome and it has low maintenance cost Looks more like a small version of xuv 500 Overall impressed and satisfied of being loyal mahindra customer", "Awsome car in this range ,with regards to fuel efficiency,comfort and power its a good choice. Interiro and exterior are prety good,available in different two varient with diffrent options.", "XUV 3oo provides an amazing experience to drive: its higher torque enables one an easy overtaking in cumbersome vehicle-filled narrow roads of Kerala. The price is in a good range, W4 manual on-road price in Thrissur is less than 11,00,000 INR. I still remember the day I drove this lovely car to my home: I am sure my car attracted the attention of at least 30 people (40 km to my home from the showroom), including the traffic police. I realized that this was due to the fact that XUV3oo has good an imperial masculine look at the front, giving it an edge over its rivals in the market. The sheer road presence gives the driver to manoeuvre on highways as well as in city traffic alike. The treatment we received at its showroom in Thrissur was very amazing: the staff was very polite and offered the service we expected. Pros: Its boxy masculine look which gives a sheer road presence. Its seats are of high quality. The gear shift is very smooth It is loaded with almost all essential features one would expect in new generation cars ( sensors, wipers, infotainment and so forth) Cons: The only problem I noticed is its inadequate boot space (around 250 L only) which is less than many of its opponents.", "My XUV300 W6 variant fully-features loaded. The drive is very smooth. Good mileage for a MiniSuv: 17 kmpl on Highway & around 13-14 kmpl in local. Plus Mahindra service is awesome. I am very much satisfied with the service. Overall look for the car interior/outer is bid different from other cars in the segment", "Indicator should be on orvm and alloy wheel should be given in w6 model I personally like Car too much very comfortable car and ground clearance should be little more then it will feel nice", "suprb car better than Maruti breeza , little bit costly than breeza but it is vaule for money . great pickup . look is awesome . interior is impressive. if you think to purchase this car than go for upper model .", "", "I bought it on loan with a down payment of 4 lacs and EMI for 5 years. Car rides good , have a very good pickup, with beautiful interior in black and beige color with great touchscreen infotainment screen , it has leatherette seats with driver side manual height adjustment , backseats are foldable, engine makes noise as it is diesel engine, and it drive very smooth , it has good turning radius with sharp Drl , projector headlamp and heated orvms ,dual-zone ac etc. Overall car drives very good.. one thing I did not like is its backside design..", "Mahindra is very prestigious brand these days, after launching XUV 500 became famous among citizens and now XUV 300 is baby boy, stylish, economic, compact in size and easily available under finance and exchange schemes. Ride is superb full of safety features, famous among youngsters. looks are fabalous from outside, easily beat looks of Ford ecosport and latest Suzuki Sspresso even Hyundai Venue is not in comparison.. Mahindra had captured market so well with KUV, XUV so Maintainence is free of mind for every buyer. Parts are available in market so repairs is easily available in grey market too Mahindra has to think about price, mileage, and cost effectivemess among rest competitions This brand is called Make in India has to think about electric version in this XUV segment Or Same Variant become successful in future years.", "Purchased on new year it was really nice and value for money. the very powerful engine the only drawback is boot space also the ground clearance. but it's okay with all advance features.thanks to Mahindra and Mahindra", "Me along with my wife were thinking of purchasing a car, wherein we got to see xuv300 to be launched on feb14, 19.. we went to a dealer and checked with the car and definitely we thought of having it.. but there seemed to have delay in delivery of Top-notch model that is w8(o).. finally we ended up with w8 Diesel as we were convinced of getting it delivered in next 20 days.. and finally got the delivery on 7th Mar.. yes.. there was huge dissatisfaction from our end and the delivery happened at 12 midnite.. i booked Napoli black.. so there in gave clear instruction to the executive not to dry wipe my car before delivery.. whole of the day the car was parked front of the showroom.. suddenly at delivery time i saw swirl marks in the car..and the car was actually dry wiped.. i was real disheartened and had to talk with the executive.. with lot efforts.. they thought of polishing the car.. but to my bad luck.. it was not that effective and i had to bring the car in that.. okey but the car drive was gud.. i have driven the car to a speed of 140 kmph.. and drives real good.. having a decent city drive.. i get a mileage of 15 kmpl with ac.. that fair enough for a car like this.. but yes.. Mahindra servicing is not good.. even if you pinpoint at an issue.. they can never resolve.. i had dashboard sound and left door sound.. car is 10 months old now.. still, service people never thought of putting a solution to this.. finally, I got to know the root cause.. and planning to move to service station to resolve it.. Car is good but servicing is not. i suppose this to be mine first and last Mahindra purchase.. not for the car. but service-related issues.. and serving people force you to give a rating of 10.. which they don't at all deserve.. Honest request to all Mahindra owner. Try and give genuine feedback if you really wish the company to grow.. to Mahindra.. please focus on service.. and please please please learn from Hyundai and honda of the product they sell.. and awesome service they provide.. anyone.. please reach out to me at 99********3.. WhatsApp", "2 riding experience is excited.it gives royal fillings.no boring but enjoying my journey. But the rate is higher than the other ones.but only it gives a wow wondering what a and experience.", "Its was easy paper work with good assistant by showroom personnel. The car runs like butter and it's best part is its compact but powerful engine. Its real successor of XUV 500. Look muscular and bold it good ground clearance. Low maintenance. It should serviced time to time. Its have nothing more care about.", "Want to buy Riding was best in class Looks like a gem Service is costly The vehicle is good, but Mahindra service need to be more realistic, professional, with good knowledge people in a service station", "", "Looking is very good nd all features are good ..When I buy this car some battery issue is create after talk to Mahindra care it will solve in 1 day and battery will change so service is also good.but now average is very slow 13 km /LTr. Boot specs not so big but still ok.nd butter then ecosport ,WR v, creata ,", "The Mahindra XUV 300 is a stylish comfortable and luxurious car. I bought this car on 24 February just 10 days after launch of this car. I love at first sight with this car. It has so many features that even other costly cars doesn't compete with it. I bought top model W 8 variant with sunroof. The best features of this car is dual tone AC and sunroof with anti pinch feature. The other features like 17\" diamond cut alloy wheel and front and rear parking sensors which doesn't come in any other car. The rear camera with voice parking assistant is good for amateurs. The one feature I like most in this car is hybrid technology so that whenever your car stops at traffic signal and u put your car in neutral the engine stops which increase its fuel efficiency. It has hill assist Function and ABS with ESP to control the car smoothly. Even the console is best in class like other luxurious cars with mood changing colours. The leatherette seats are best in class. No other car can compete with this car in terms of features. So what are u thinking guys. Just go and grab the opportunity.", "I did the test drive and I really liked the car. I have the boot space concern. Boot space comes into picture when going out with large suitcases that happens once in a year for a family trip. I really liked the rear seat space it is way much better than ecosport which is congested. It has the potential to take the market if it sells w8 series at the cost of w6 series. Definitely it will take the market from KIA seltos highly overpriced.", "Mahindra had given a very good choice to its customers who want a compact suv with a great power.But its length is little bit smaller than its rivals.Power delivery of this car is supreme and unbelievable. It's also a feature loaded car. According to me Mahindra XUV300 is a tough competitor of its rivals.", "I had driven this car n feel more comfortable than other this segement cars .This very good in this range of money.All techknowlogy are far better than other car.its boot space should be small larger .overall this is fav car after xuv 500", "I buy this car about last month . The experience is really good. I have used many cars before but this car is all rounder. The suspension is really good. As I am using petrol varient, fuel economy is good.", "The amazing car I have used for a year look vice it's very. Good and have an amazing experience while driving and have a very quick to start and very amazing to be \nNANA", "ADVANTAGE This is an very nice car under 14 lakh it has many additional features which the Ford ecosport does not have it's ac is very powerful it has Tyre pressure monitoring system which it's rivals don't have the main thing is that all Mahindra cars are very comfortable DISADVANTAGE This is an nice car but it is not avalibe in petrol AMT Mahindra should also think about the Indian market\nNANA", "", "Nice car.Good to buy in these price segment.Balanced car.i loved the dual tone interior.exterior is good.back part could have been better.wanted sunroof in all variants.overall a good car in its competitors and price segment", "A truly premium crossover nice build, quality and refiinement levels great looking, the cabin has fantastic space, Fantastic engine power this engine offers fast performance and good driveability .. it's most secured car in class having 7 airbags,ESB,ABS all wheel disc breaks, TPMC and much more overall it's an amazing SUV it's definitely an amazing car", "Is there a buying multiple options for a middle class working job so afford. Rest looks good and will be happy to have a go at it. Also if there could be a sunroof In a top model and a big music system.", "Its fun to drive this. But major issue when u open doors cabin lights not getting on it feels very uncomfortable in night when u bord in . When I ask for this in showroom they told we have this basic facility in only top model This is the basic things we don't need to confirm before purchase that's our falt.", "The Sales team needs to be aware of new variant releases. I missed the AMT option just by a month. Service quality and efficiency at India Garage Mysore needs improvement The gear clutch mating needs a fine tuning.", "Only price is on higher side. Other things have no match . Exterior is really like SUV. Interior is spacious and good looking. Driving experience is also good. Pick up from small gear is good.", "Buying experience is the mahindra any car is most comfortable because the better things are mahindra showroom are good nature of talk, help to customer and many more. Riding experenice of the mahindra xuv300 is best among other SUV and some extra features in xuv300 like Fogg remove side mirror, dual ac system, 6 airbags and many more. Details about looks is look like xuv500 but xuv300 is compact SUV and look best among other compact SUV and about performance it has 1497cc Engine which is also best performance ever. Service Mahindra XUV300 service is not very costly compare to other SUV Maintenance is on 10,000 kilometre. Pros - 1 6 Airbags 2 Dual Ac system 3 Best features in segment 4 Best Performance Cons 1 Less Boot Space 2 No wireless charging pad", "as it is a new launch from mahindra in competition of maruti vitara brezza and hyundai venue , xuv 300 win over them as look vise also and performace quality as it hav bigger foot space and better luks than hyundai venue and service cost is nominal as it should be . pros are luks, engine , foot space , bigger wheels cons - needed to b full automatic", "", "", "", "", "", "Excellent experience in this car .Build quality is very good , better experice, mahindra is the one of the best car mfd company...diseal engine is good performance $ not be noise I haven't in words to saying you...superb", "Car is really excellent in every respect like milage, space inside, ground clearance and functions of accessories . I and my family like this car as it is family car having lot of space .", "very lovely car this car performance is very good and its features is also very good,better suspension,comfert these features are very good and important every time also have a airbag", "Very good exterior as well as interior. Very good SUV look and power full engine awesome performance. Very good space and comfortable for 5 pepole. The only it's negative point is it has less boat space. Over all the car is pretty amazing. I love it.", "Price is too much. U should decrease the price.. Which may effect the purchasing power middle family. For better experience I would like to mahindra xuv 300 if its cost decrease as compare with brezza vitara...", "Buying experience: M.planming to buy in couple of month\nRiding experience: Its fantastik perdormance , love to deiving\nDetails about looks, performance etc: Look wise its Bold, performance of diesel is amazing , and petrol is littel bit avarage\nServicing and maintenance: Not done yut, waiitng for reached at service time line\nPros and Cons: Pros is Branding Like Mahindra Feel like drive a very Good weight car", "Mahindra has improved their sales team. Very comfortable , looks are stunning, servicing team requires improvement. Very comfortable & feature rich vehicle. PROS:Looks, performance, pickup, beast on the road, low maintenance. Cons :Mileage, low boot space, ground clearance overall very good car with required features", "Details about looks, performance etc: Car looks like very beautiful shape is too good family car colours is also good specially white the real pearl", "Buying experience: Not much expensive. Its good car\nRiding experience: Not bad. Nyc car it is.\nDetails about looks, performance etc: Nice.\nServicing and maintenance: Nyc.\nPros and Cons: Good \nNANA", "Riding experience: I have drive this small beast on off road & high way the experience I love this on the same day before driving I have lots of negative thoughts in mind that it's looking same as other compack SUV in the market but after drive this car I totally changed my mind mahindra really work good & its price range also good", "Riding experience: It was really smooth drive..i didn't feel like i am driving .. wow amazing car", "Experience is good only thing that they should introduce automatic variant that we will be very great . Considering the increasing traffic in city,automatic variant is must for regular car user", "I found XUV 300 to be a powerful,smooth and comfortable vehicle. It is loaded with a good number of features out of which I found tyre position indicator,steering modes and heated orvms to be functionally useful. But few draw backs are small boot, no rear seat AC vent. Given the first in segment features I think the car is a buy particularly in view of safety features such as seven air bags and disc brakes.", "This is good for long drive. But it is more expensive. Better to buy xuv w6 model Mileage is 17 KM on road for diesel In xuv 300 the cc was higher compare to maruti breeza", "Experience is excellent Good engine sounds Performance is very good Extraordinary car in price Price is very low jitne feature hai Dual climates ac Sunroof Seat belt reminder 17inch Tyre Diamond cut alloy wheel 60*40 folding seats Steering 3 mode Normal sports hard \nNANA", "Firstly I have many option among ford ecosport , Tata Nexon and vitara brezza . I would like to share some of my happiness to the carwale group for giving a great recommendation job . I think xuv 300 is leading in race of power-pick_up-performance . The sunroof which enthusiast me and my kids open it & enjoys the sight seen and fresh air in such a value for money car @14.lacs One thing that attract me is the leather seats by default, daytime running lamps and one & only parallel parking system which is something that is 1st in segment. Last Mont I had a 5000 km servicing, they take more times required . Family lounge was was also not clean and staff were aggressive towards me. Some extraordinary features can attract anyone but I didn't like built quality, bad plastics inside and outdated exterior", "Very nice suv in this price safty feature are very good and driving is very smooth a c is good but average is not good overall performance in this price is good if average is not issue then you can purchase", "Buying experience: haven't buy it yet. but will buy it one day\nRiding experience: haven't driven it but will drive it soon\nDetails about looks, performance etc: looks and performance is owsome\nServicing and maintenance: haven't know about it but definitely will be cool in this segment\nPros and Cons: just a little bit about its boot space . but it will not mind if we see its cabin space comfort", "Details about looks, performance etc: Awesome..and good performance.. nice", "Buying experience: Yet to experience would be first interaction with Mahindra\nRiding experience: Superb Simply great smooth on high way\nDetails about looks, performance etc: Sleek and stylist Can not expect at this price\nServicing and maintenance: Yet to expierence looking forward to own the beauty\nPros and Cons: Early to say let's hope the best things on the way", "Best off road car to drive looking in the design is better than another mahindra cars this a awesome looking car extreior interior and stylies look white toughnee this My simply opinion", "Had a test drive and liked the performance and features as well but W8 variant was out of my budget, so booked W6 which suited my budget. Waiting period of 3 weeks for the Aquamarine. Vehicle arrived at the yard, so I was excited to see the car before the registration. Went to Yard to check and shocked the vehicle was already run 60+ KMs. Disappointed and checked with dealer about the reason but they don't have any answers and blaming that they received as it is from Mahindra. So checking with Mahindra about this issue and following up. It is suppose to go for registration today and delivery by 6-Apr but unfortunately everything screwed up. Let us wait and see.", "I personally love this car The car looks small from out side but from inside it is looks fully space and costumed The 6 site makes this car special and I have AMT version .......", "Riding experience is good. Really value for money. It will definitely reach the middle class people. It will give competition to Hyundai i20,maruthi breeza, ford ecosport. Front look is fantastic. As per security point of view airbags worthy for this rate. Interior also having new features.", "This car is best in their segment but if we compare price with another car so we need to pay some extra money to availability same features in this car but if we going through their driving experience so definitely we will get a excellent comfort", "I purchased Mahindra XUV300 W8(o), after waiting for it for almost a month and the buying experience has been good, though no surpises as I could get no discounts from the dealer , but got a good fast paper work at MGB Mobile, Anantapur, in Andhra Pradesh. The assosaries cost you bomb and fixing them too long a time spoling the enthusiasm to drive out new vehicle. I am writing this review after he first mandaory service and driving 2,000 KM in past 25 days since I am owning it. Looks wise it is stunning and the acquamarine colour is quite attractive. It being my fourth car in 20 years, I looked forward to some driving comfort, good safety features. I am fully satisfied with the passenger space, though the boot space has been compromised for that. Also if you are migrating from a Sedan like Honda Amaze you will feel the pinch. Now coming to the driving comfort, three modes of steering wheel makes very little difference. Driving on the highways is a sheer pleasure. Even at 140 KMPH the vehicle is stable and you do not feel the speed or no vibration is transferred into cabin. The leg space for the driver is very cramped, which should have been definitely wider for a comfortable seating and longer driving experience. You have very little scope to spread your legs or keep knees apart. You will forced to keep your leg on the clutch pedal or inconviniently below it. Now coming to the design, the worst experience for the driver is while turning to right - into a lane -- where you cannot see anything as the visibility is totally blocked by the large Rear View Mirror (its positioning) and very close to that is the front Pillar holding the windshield. These two together totally block your view. For a seasoned driver, it is Ok, but for a new driver it could be cause of concern. THE MAHINDRA XUV300 DESIGN TEAM needs to look into this aspect. The 185 mm ground clearance is worthwhile and larger wheelbase does provide it the stability and the infotainment is enjoyable as its quality is good. Some smaller features I am myself yet to get used to as some of them are complicated. KMs to empty tank that changes dynamically depending on the traffic and driving conditions, is very useful on highways. -- RAMESH SUSARLA", "Riding experience: I is wonderful product Smooth handling Features are grate\nDetails about looks, performance etc: It looks pretty good Luxurious\nPros and Cons: Boot space small Some what high in price", "Back seat pe ac vents nahi hai.is liye mai thoda dispoint hu or boot space b thoda kam hai.otherwise gaddi bhut achi hair.back ac vent mere liye ik important feature so i cant buy this suv.summer session me Gadi back seats ko jaldi cooling nahi de paiye gi.back seat pessenger passenger's ko grmi mein problem ho sakti hai.", "Riding experience: This car gives you the feel of a proper suv interiors are good exterior is perfect looking. Over all a powerful thing to drive.", "This car in his segment will be one of the lovable car but it is little overpriced. Compare to its rivals it is 75k to 1 lakh expensive. Guess when they will launch automatic then what price we will aspect from mahindra. Its good car with full of features but too expensive to buy for 13.70 lakh on road in this segment", "Buying experience: No.. But thing for buying that xuv300car\nRiding experience: Avesome feelt during drived. Car have good ground clearances with smothly feel.. Value for money\nDetails about looks, performance etc: Attractive, fabulous and tough look with average price\nServicing and maintenance: Bad but ok.. Not consider in low maintenance.. Maintenance cost is high\nPros and Cons: Good.. Gives the more benefits for buying government servants", "everything is good. i love first look and as well as the desent color option. when i sew first time i totaly fan of this car. that time even i don't know the price and performance.", "Buying experience: Test drive any overall buying experience is good\nRiding experience: 1500 km driven. Engine pick up and braking is Good.\nDetails about looks, performance etc: Exterior and interior looking good. Two cons., 1. A/c not covering in rear seat and back side its giving terrific experience. 2. Top tray must include and cargo area without this it seems not good.\nServicing and maintenance: Done 1000 km service in TVS OMR chennai. The experience is good.\nPros and Cons: Pros: Riding quality and experience good, interior and exterior looks good. Cons: A/c not covering in rear seat and back side area, Top tray must need on cargo area", "Superior riding experience.this car in this price range i think much better then brezza and creta.they give many facilities to feel luxurious with the mahinda trusted brand.short word we can say.compact,mini suv under 10lakh.trusted enginepower.superbb interior", "Xuv 300 is one of the best compact SUV & some of its features are really good & unique. the most important thing about this car is it offers very much torque in this range which is really really amazing. The cabin & boot space is more than sufficien & it's muscular & robotic look is impressive. Best driving experience with 3 driving modes .", "This is car good.But money and sunroof is starting a new class Very much.The car also the good interior is Awesome .xuv300 is wonderful car .Mahindrais providinge for people.Smart car for the new class\nNANA", "Osm suv,riding is best in this sub segment, Mahindra xuv 300 beat all companies and competitive under fifteen lakh sub eoo cool stylish comfortable and best sub car segment in this year 2019", "Test driven. Among Maruti Brezza, Honda WRV, Tata nexon and ford ecosport, Mahindra XUV 300 is the best compact SUV in terms of features, value for money and driveability. If you are planning to buy a family car this is the best as on date. Safe and sturdy. Forget about boot space as you are not a farmer to carry vegetables to the market every day.!!", "Buying experience: It was nice to buy it, was impressed in 1st glance of it. Process was hassle free to buy it.\nRiding experience: It's really wowwww Ride, I would say its a joyride. Always feel cherish whenever driving it no matter what place I am going or whats the reason for I am going to that place.\nDetails about looks, performance etc: Look is purely inspired from SUVs that nothing but like scorpio n xuv 500 or creta, still now it is really performing very good.\nServicing and maintenance: Don't think so it will make me cry for maintenance or servicing, it's design is quite sturdy n rugged but still attractive and fascinating .\nPros and Cons: Pros - I would say a design ,stance, drivability, performance and many more things...... Cons - its initial cost and fuel efficiency.", "Buying experience: very poor show room excicutive poor response\nRiding experience: ok long drive some ok compare xuv 500 nice xuv 300 city side drive ok\nDetails about looks, performance etc: car nice engine some noice othervice ok\nServicing and maintenance: low cost top model ok base model not nice\nPros and Cons: ok long travel very nice. city side ok", "2. Good , easy handling , luxury space,shocks looo good, 3. Pretty gooood, comfortable ,stylish, fun , easy to handle , sounds system is too good , back mirroring is good , too fast cooling", "Newly launched car that is best suited for your budget with all features of a luxurious car.More space to increase the comfort and good mileage. Its engine is very powerful and best car of mahindra now.", "Buying experience: Mahendra xuv300 car is best car with Best interior and exterior,over all features and style is good , recommend to buy\nRiding experience: Very good driving experience with this car it has rear camera and good sensors for driver safety\nDetails about looks, performance etc: Wonderful design and awesome looks , stunning looks to attract to buy\nServicing and maintenance: Very good service and maintenance records , customer satisfaction guaranteed to all\nPros and Cons: I personally recommend all to buy this car with minimum budget car", "the Mahindra xuv 300 is a amazing car .i love that car and specious .look is very well.road king like a tiger.No one other can beet that coz latest and new comfort.i love this car.", "Reduce engine noise in cabin, provide rear ac vent, provide one touch up and down window panes, seats are little hard, may opt another combinatin too for interior instead present,wooden touch trims in windows and dashboard would be another milestone and will provide a awesome look for interior", "I like the vehicle design very much. look like creta. In today's traffic conditions this is the best choice than creta.you get w6 petrol at 10 lakh rupees.petrol option not available in Breeza. Missing rear armrest.Except boot space I like all the things perfect SUV for city and highway trips. Mahindra wins this suv segment than Tuv.", "Nic looking good exterior good interior mileage so so comfort seat different colours pickup stylish different looks vs xuv 500 and vs creata are xuv300 vs creata .my dream car comes", "This is very nice car this car wale dotkom is very super almost we are very satisfied this one app This vehicle also very beautiful and cute the seating capacity very eligible and flexible", "The nice .superb car it is comparable and it has a wonderful engine it is in the budget. I like xuv300.\nNANA", "Best xuv in the last 5 years. Very comfortable. In our budget. Interior design is very excellent. Full space. Best car in 2019 Years. Mileage is best. It's all very nice. Thanks, regd\nNANA", "The rear headlamps should be improved. More space is needed for passengers and driver.Mahindra can add more in this car as it looks cool from front as it consists of stylish led headlamps.Mahindra CAN!!!!!", "The suv is perfect for those who wants better experience in low cost .The car looks awesome and it can go to the off road as well .The interior is luxurious and feels like you are in something luxurious brand", "This car  xuv300 is a very sexy car for me. It's looks is very nice. Over all car is most fantastic. In India cars so good competitively another Indian car just like. Tata. Maruti. Mahindra make some special for Indian people. I cragy for cars. But I cannot afford this car because I belongs to very poor family. And my desigination in job Is peon. So thanks to this my personal view about it.\nNANA", "This is very good car for traffic area. Which gives a very comfort ride. It. Has large space inside. I would like to suggest that car in 20lakhs segment. Best car with 17 km/1 liter average gives in traffic area. Smooth driving , powerful performance, pure control. Paisa vasool SUV", "It is one of the best car at this price. It has premium interiors and offers a good driving experience. It is better than it's rivals and you can go for it. It offers you a very less amount of boot space.", "Car is good. If u interested to buy this car,u have 4-5 more option in the market so u can compare then u decide to buy. XUV300 Price is little bit high, manufacturer can work on that.\nNANA", "Performance is fantastic. Interiors are decent. But design especially the front and the grill could have been better. The plane stretch of bumper below the grill should have been avoided by a better detailing or extended grill or even simply by a name number plate. Still a good choice in this segment but someone not in a hurry can wait for a facelift version and an automatic varient.", "Pros: 1. Electric Sunroof present 2. Seven air bags. 3. Premium feel inside the cabin because of safety and convenience features. 4. Powerful engine. 5. Dual zone climate control. 6. Front parking sensors. 7. Heated ORVMs. Cons: 1. No dead pedal. 2. Last row is not spacious enough. 3. Less boot space Overall: Many first in segment features in the car. The front of the car has very bold look , the bumper is also very broad with skid plates. Due to diesel engine it performs well on highways, and also comfortable on bad roads. It has some quality issues like poorly fitted panels but still feels premium and well equipped. The rear seat is less spacious and also doesn't have that many features. Still the car is very nice with plenty of features.\nNANA", "looking forward to buy this suv.had a test drive which is simply amazing. beating the best in this segment.looks are superb.the cost would been slightly lesser.The interior are superb.servicing from Mahindra is very good.so please looking to get this car at the earliest. Cheetah is back.\nNANA", "This is the most safe and luxurious car in compact SUV segment, I am the owner of Tata nexon and I must tell you that Mahindra hasn't forget anything to make this perfect SUV. It is the only car which provide steering wheel settings, infotainment system, body coloured orvm and door handles, all disk brakes and adjustable neck rests in front as well as rear along with 60/40 rear seats from the base model. It is something all manufacturers look to provide . Yes there are some cons like lack of driving modes, cramp boot space ie. 250 litre ( same as i20) , lesser fuel economy and bit pricey petrol models . I don't know why mahindra is not proving hybrid technology in petrol SUV for better mileage. Overall you get value for money product in w6 which has ticked all the boxes ie touch infotainment system with navigation , dual flip keys and everything you want in 11 llakh rupees diesel SUV .", "Buttons around touch screen can be imrpvod in luks by using crom instead of red plastic Central ac vent should me made as the present vent in dash board are not in center which effect less cooling to back seat boot space should be some more as presently it is very less", "I have xuv500 and i am planning to buy this too. if i comparison this to crata and ecosport WRV this is far better bcz mahindra cars maintenance is chipper than all.. I suggest go for it if you are planning to buy ccompaq suv"], "5": ["Style is superb fun to drive most stable car in high speed also performance is great and ground clearance is nice comfort is top notch level its smooth you will feel like you are driving luxurious car.", "Mahindra XUV300 had 2.5 months waiting time. But amazing driving experience. Less features in lighting, infotainment and point view of look, Braking and acceleration are amazing. Good service. Mileage is not competitive.", "The best car in this budget the only thing that will draw you from not buying this car is interior. But for a car enthusiast the 1.5l diesel engine does the job. Power is way better than Alcazar or Creta.", "Very comfortable car. Specially safety for the driver...some things are less provided the company but safety are proper giving the company and look vise awesome car. Service cost are not much more", "I am driving this car since its inception. I have driven it around the country. It is the best car in this segment. I have a diesel variant. I never feel tiered even after driving it for long hours. The kind of comfort is unmatchable. Indeed, the interior might look little outdated if you compare it with venue and sonet, but that's not the thing for which one should buy the car. Car is a mode to transport humans, so important things are its engine, safety and comfort level. Venue and sonet are far behind it, in those aspects. Two of my friend, also bought it, after driving my car. It has ample boot space. Don't compare with other car's boot space. Just think as per your luggage. It can easily fit luggage of 5 people.", "XUV300 is Very good looking SUV, Diesel engine rules the road, best in class cabin space and 5 star safety. Feels very premium. I also tried the 4 seater Sonet and Nexon is a car. No doubt XUV300 is the best.", "Best car, best road appearance, very attractive, give good mileage, amazing experience, build quality is very good , best quality, 5 Star safety rated car , and good price just amazing.", "Very good car. Suggested to buy very nice to drive. Very comfortable seat and nice for long drives Engine is powerful and good for off road driving too Car design is also impressive. Very nice experience", "Mahindra XUV300 is a small car.But big spacious car for speed performance and safety features for all passengers.Service cost is also same like other car in this segment.It is little backdated in interior decoration and features like small infotainment,Back seat Ac and small boot.", "I drive car.The running was very smooth on any conditions with comfortable seat. And best car for long drive. When you can drive in 80 to 100 speed you can get very good mileage. For short family, I suggest this car is best it's my experience.", "Very good experience Comfortable back seats Good front bumper and back Loaded with features Good interiors Low voice Good AC cooling Good headlamps Highly recommended Value for money.", "Good to buy it, best XUV love you Mahindra, too worthy, classy look great comfort , best AC ever, features are superb, nothing is bad, leather seats in top variant, everything which is needed, are available in it", "1-Easy to buy at any Mahindra showroom 2-Over all a pleasure experience to ride like a king 3-Need some Updation in outer look 5-In Service facility is one of the best brand in India", "Taken delivery of my Mahindra XUV300 vehicle from ample kadapa. Got very good support from the company while taking delivery. Vehicle looks twentastic externally and internally both. Performance is very good because of its Torque and horse power.", "Driver seat adjustment to all over card w4- w6 Important is a include Android display system w sex model And reverse parking camera all over segment.", "XUV300 Oct 4th took delivery W8 DEISEL SUNROOF for 15.3 lakhs and then the next day reached 1000 kms. Average fuel economy displayed as 16.5 mileage. No other segment car will provide like this much of mileage before first service. After first service we can expect more mileage. Engine and gear performance is wonderful. Seat comfort is so good both front and back. 3 members comfortably can sit and leg space is really good. Considering all these features less boot space is doesn't matter. Infotainment options also good. Blankly go for it worth to buy.", "", "", "Its a great driver's car under 20 lakhs with most powerful diesel engine. Pros : ample space for front and rear passengers. Great driving feedback from engine and steering especially in 300 nm diesel engine. Best in terms of long distance comfort and real life mileage of 18-20 km/l in highway and 16-17 in city. Cons: boot space is not enough for large trolleys and not justifying with competitors. Outdated interior even if its good in terms of quality. Not tech loaded as compared to Korean rivals Mahindra tend to remove features in every quarter. Compared to 2019 model it lost more than 10 features.", "This is a good car for the indian roads value for money nice ride good milege and brand ,good service from the service center.", "Very well by Mahindra showroom I was treated very well the behavior of Mahindra showroom agent is good they respect everyone like a boss I like it in service centre the cost of servicing is ok.", "Buying was smooth except for handling charges by showroom. The thrill to drives remains unchanged no matter how many Km you drive. The looks from front are unparalleled and gives an immense road presence, however the tail lights might get a bit better in shape. Performance is definitely reflective of the drivers ability and has smooth suspension with responsive engine. Mahindra service has improved a lot and you can happily trust them. Average cost of service is 3000/- Pros Almost everything about the car. Cons Less boot space(250ltrs) for an SUV type model but it is a compromise for awesome rear leg room.", "1.Best choice in sub 4 mtr SUVs 2.Beat driving experience, road grip, dynamics 3.Looks are elegant, power torque and performance great. 4.Servicing experience is good in metro cities 5.Overall satisfied with vehicle, only negative is needs Real AC vents", "", "", "I am owning xuv300 w8(o) from 2019 July. Buying experience was good with Indel Motors. The car was delivered on time as committed by the dealer. This car has a good road presence and good view. However there is a blind spot with A pillar, so you should be cautious while crossing a junction. It has a powerful engine and without much hassle it pickup. Safety point of view, it has maximum safety in this segment. In an unfortunate event of an accident, the front area may completely broken into pieces, but the people inside the cabin would be safe and this is a security feature. I had a problem with this vehicle in 2021 when I didn't take it out for almost 3 months, the keyless entry started misbehaving, the service centre did a software upgrade and remote battery change, which solved the problem completely. It has a very good head room and leg room for tall passengers also. The disadvantage of this vehicle is the boot space. If a family of 4 traveling for a week trip, boot space may not be sufficient to carry all your necessary items Overall the XUV 300 cheetah inspired design does its job decently and without any troubles. I drive 35000 KMs in last 3 years and overall a good vehicle. Service cost is on a lower side when comparing to other vehicles in this segment. Also Mahindra spare parts are not very costly. If you are looking for a car for a family for long drive with comfort, you can go for it.", "Riding experience is good and service and maintainance cost are economical as compare to any other suv. Average in city 17-18km/l and in highway 20km/l. Black/aquamarine colour is best. In this range xuv300 is best choice. Safety purpose it is good. Service cost - 5000 to 10000. Three mode - sport and comfort is best.", "1. Buying is good from Sireesh Auto, Madiwala, Bangalore, Karnataka, India. 2. Driving experience is superb! You won't get tired even drive for hours! 3. There are a lot of \"First-in-segment\" feature's has been introduced in XUV300: - Smart Steering System - Dual-zone Climate Control - 300 nm Torque with 1.5L Turbo Diesel Engine - Emergency Stop Signal (Panic Braking System) - Longest wheelbase (2600 mm) - 6 Airbags - Front Parking Sensors - Seat Belt for all seats - All 4 wheel Disc Brakes 4. Servicing & maintenance is as usual compare to other vehicle's. It all depends on us - how we use it and how we maintain them! 5. Pros - 5* Safety and many \"First-in-segment\" feature's. Cons- No rear AC vents. Less Boot Space.", "Buying experience is very good and also took test drive its look very good and servicing and maintenance are very low cost maintainace. I really like very much.", "Driven 1200 Km in 1 month, a perfect SUV with 5 star safety features. The design is good and interior is spacious. Very powerful and comfortable car. Service cost is too low. Go for it.", "I purchased this car W6 AMT in Feb-22,this is my 1st car and i have fell in love with this beast. I got an mileage of 25km on HW, when maintained speed limit 80 to 100. In city i am getting 17 to 18 depending on gear shifts. Best build quality and good service.", "This also makes the xuv300 great for a highway dash. There were swathes of reserve torque and overtaking is no hassle. The motor also refined and not intrusively noisy making long distance triple digit runs a relaxed experience.", "", "", "First I was thinking to buy Kia Sonet.But after some time we realize that if we buy base or second base model in Kia sonet we didn't find any feature in Kia sonet and also seating problem is there.But in Mahindra XUV 300 base model we found many features and really 5 person can rest easily.We heard that in Mahindra XUV 300 there is no boot space problem.But when we took a test drive we also checked the boot space, put some luggage and really liked it. We were able to put 5 suitcases in luggage.That's why I want to say don't hear anything.Only listen what your mind say then do this.", "Drive this Car more than 4.5 km in last 5 month.Best family car in this range for those prefer safety for there loved ones.It is Stylish, and has smooth engine.Same as everyone complaing less boot space, I understand the company want it under 4 meter because of government rules of taxation and it just 5mm short of 4 meter.", "I am very happy ever since I bought Mahindra XUV300.It comes with 5 star rating.It is very safety car. Mahindra service is very good.The Mahindra XUV300 is very smooth to ride, very comfortable to sit. It has very attractive looks. It has very nice sunroof.I like Mahindra Car. According to me there are advantages of buying Mahindra XUV300 with no disadvantages. Because look wise and features make it a very good car.", "Everything is ok but Bluetooth in infotainment system sometimes not connecting and don't show past history. Mahindra people every time update the system but problem still going on after 6 month also.", "Buying experience is awesome and Dealer also helped us to find the correct model as per requirement. The riding experience is just freaking fantastic and ride quality is awesome as well. Looks are very aggressive, in each and every model there is LED taillights which are cool and not like other cars in base model there are only halogen and in top there is LED. I had driven my car for 10000 kms and this service cost was only 5,000 Rs. It has perfect maintenance costs and not much if your driving is not as rash Mileage in city is around 14-15 km/l and on highways, if you are cruising around 80-90 km/h then you will get mileage of more then 20 km/l. Once I got mileage of 26kmpl. Pros : Are many like steering mounted controls, Steering modes, Bluetooth, Navigation and many more, Blue sense app and build quality and safety features Cons : They should be giving cabin lights in front also in W6 model.", "Buying experience is good. But show room loan services very bad. I am new customer service experience don't know. I was comfortable with the backdated interior/infotainment system and lack of adequate boot-space. Had done my first long trip and there was no looking back. Realized that the ABS, cruise control and other engine features were top notch. The gear selection is great. Most importantly, the cabin is sound proof. Additionally, my car's sweet spot turned out to be revs between 1500 - 2000 rpm and 60-80 km/h. Besides, I drove her continuously for nearly 6 hours in mixed road conditions covering 400+ kms, AFE observed was 22 km/l which beats the ARAI of 17 km/l. City driving conditions are little inefficient, not because of the car, but myself, as I am really slow and a careful driver. AFE observed in city driving is between 12-15 km/l. This vehicle reinforces confidence for amateurs like me.", "Fully satisfied with my xuv300,the comfort with long driving and space is really make relaxed. The power is also good enough. Only little problem felt with suspension and it's only with some big road breaker.", "", "", "Car is in 12 lakh budget which is good for one. I have good experience about driving xuv 300. I suggest to buy as it is our first experience. It's maintenance is good.", "Vehicle looks very good from front... Excellent Comfortable , Sometimes it gives 22 km/p in 1.5D . Amazing car With loaded features. I think boot space could have been better as there Rivals have much boot space. By the way it's a good deal.", "It's beautiful, very smooth in driving , I have used it for a small drive ,I am going to purchase Xuv 300 1.5 w6 diesel in Diwali, it is the safest vehicle on Indian roads., once you drive this car you will definitely never let it go.", "Look wise its very good , mileage 17.5 giving on highway with out ac , very good space in rare seat , driving experience is very good. Interior has out dated and cost wise little bit high .", "Good car and giving good mileage. I also referred my friends to purchase this car or no. Almost well done car. Seating is very good and have more space. Exterior looks make it cool.", "I have had wonderful experience with the car overall. This is truly a beast when it comes to engine and performance. Talking of comfort, I can assure that this cabin feels the most spacious in its segment and long drives that can be painful and claustrophobic in other cars, are seamless and comfortable in this car. This is the most fun to drive car in its segment. I have the petrol manual, and the torque that it generates and the moment the turbo kicks in, I feel that my money has been put to a great use. It brings a smile on my face each time I sit behind the wheel of this car. The only drawback I find is the small boot space, but hey! I don't think we need more than what is there that often. Overall, I am a fan of this car.", "Pros- Build quality Cons- service quality Great car is this segment for ruler and urban areas Good looking advance features with too much colour options , lots of service centre near by.", "", "just need to change interior looks and overall it's fab. Very smooth driving and able to drive on hills.", "Best SUV car in this segment. Good milege and interiors of this car is very attractive and It has good space and I am using car last one year and I have good experience . In city it average is 14 plus and high way it gives 17 plus mileage. Its maintenance cost is low in comparison to others In this segment.", "My buying experience was good at punjagutta, Hyderabad. Driving experience was good, enthusiastic and went more and more miles. Looks pretty good but the rear part would have not chopped, but its disappointing that M&M removed full tail lamp on rear door for my W6 variant. i just marked 10100 kms so had only few servicing which is pretty normal. Pros: 1) You are owning a PRO vehicle in the segment. No doubt which I felt after comparing it to rivals 2) The boxy Suvish makes the bold appeal. earlier I liked Ecosport but later after my test drive i understood my needs are fullfilled in this vehicle so i booked after 5 days :-). Nexon diesel is good but still I feel the same premium big hatchback feeling in it that lowered my thrill. 3) Fuel Economy in city I get 15 to 18 km/l based upon traffic and in Highways i get 20.5 to 21.5 KMPL with AC@ 1500-2000 rpm Tank to Tank for last 3 consecutive road trips. I enjoy the 300NM torque at few overtakes but my maximum speed is limited upto 100kmph. i wonder the ARAI score is 20kmpl which is tested at 31kmph or say 90kmph but this XUV has low fuel efficient in Lower gears 1-2-3. 4)AC is powerful . Cons; 1) Few features are deleted and Price increase are made during my delivery 8th April'21. 2) Position of AC vents at center are not appropriate, Mahindra need to check since the blower faces to driver & passenger which is not directly to rear side/between. however it cools within 5 minutes. 3)M&M shall provide Projector halogen with DRL in head light for its better user friendly and the Parcel Tray need to be provided even i spent 12 lakhs for w6 variant. 4)Rear camera should have been provided to the OEM touch screen as an Accessory(basic now a days-cheap idea or differentiating the variants) which is again a Rear wiper is not provided. 4)What made M&M not given any provision or user friendly for Cruise control option which is enabled in Hyundai and Tata cars Verdict: My expectations fulfilled during the driving but the features are not appropriate as per the price. Honestly its a Power machine with space comfort and safety.", "Nice Looking car. and my future and my dream car xuv 700 . But my salary is low and car price is a high but, my future car will only be xuv700 only. Please low the car price and my dream will become successful in February 2022.", "Awesome budget vehicle.. smooth riding look wise great and eye catching Maintenance and servicing best Pros You will have beast in Budget Looks elegant 5 star for safety No cons", "This is my 3rd car. First I used Ford Figo, then Baleno.Something I realised the difference between XUV300 and other 2 cars is the smoothness which makes you feel relaxed and it never glitches and along the rough road also it gives you a feeling that the road is smooth and the mileage is excellent. Only cons are the boot space and also the infotainment screen which is looking old quality which can be improved. Rest all we can blindly take this car and you will never repent buying it,but you feel proud to own such car.", "I was confused between many suv cars but at last I got xuv300 which value for money its w6 variant is best in price and performance. The car is very smooth for ride and it is very comfortable. The gear shifting of this is very smooth, driving experience is very good.", "", "", "This is my first car, it has very good ground clearance with good height as well its interior is amazing, its seat fabric is good and comfortable, this car is a complete package for a middle class family.", "In all the things the car is performing well and a good car best car in Mahindra, best mileage, tyre, comfort, nice music system, a value for money car in this price with best ground clearance.", "Great performance car with good safety features. Road appearance is also very impressive. I bought Mahindra XUV 300 W8 optional diesel which gives approximately 20 Km/l mileage till now.", "Buying experience was great it was a used car but in really great condition. Driving experience was great on the highway. in the city comfort mode really helps in driving, though you can drive on sports too in city it's still great. It has a great road presence, but sometimes rare disappoints but there's always a flaw which we can live with. I received the car at 30k drove it 4k kilometers the service cost was 7k after driving it 4k extra kilometers. the car have plenty of all pros, on the cons side maybe boot space but it works on a 3 day family trip and 1 person can work as long as they want. Note- Ambient lighting and wireless charging may prove better than dual zone AC( literally never used it)", "Best car purchase. Safety is good, range is high but overall car look is fantastic. This is the safest car of India... I suggest everyone to purchase safe car because life is important & safety is also important.", "Dealership is very slow in response. Product is very good, Request to Mahindra to please check and improve dealership in BKN. Rajasthan. XUV 300 is a good choice for the consumer.", "Buying experience is awesome and Dealer also helped us to find the correct model as per requirement. The riding experience is just freaking fantastic and ride quality is awesome as well. Looks are very aggressive, in each and every model there is LED taillights which are cool and not like other cars in base model there are only halogen and in top there is LED. I had driven my car for 10000 kms and this service cost was only 5,000 Rs. It has perfect maintenance costs and not much if your driving is not as rash Mileage in city is around 14-15 km/l and on highways, if you are cruising around 80-90 km/h then you will get mileage of more then 20 km/l. Once I got mileage of 26kmpl. Pros : Are many like steering mounted controls, Steering modes, Bluetooth, Navigation and many more, Blue sense app and build quality and safety features Cons : They should be giving cabin lights in front also in W6 model", "", "", "My buying experience was good But driving experience is awesome Excellent looking of this car performance is best in all sub suv car Maintenance is very low and services are well in Mahindra showroom It is very good car and quick performance nice look ,rough and tough car There is no cons of this car as compare to sub suv car", "In comparison to venue and sonet second base model Xuv 300 base model is much more impressive with advance features also buildup quality of Xuv 300 is par excellence in comparison with other two, ride is very smooth. Handling is very smooth. Suspension is impressive too of Xuv 300 .", "Great Comfort and Safety, Looks amazing . Fast delivery by dealer in Balrampur. Gives confident driving experience. Company should add some features like 360 degree Camera, slightly above ground clearance.", "First I was thinking to buy kia sonet but after some time we realize that if we buy base or second base model in sonet we didn't find any feature in sonet's and also seating problem is there but in XUV 300 base model we found many features and really 5 person can rest easily. We heard that in XUV 300 there is no boot space problem but when we take a test drive we also checked the boot space and put some luggage and really liked it. We were able to put 5 suitcases in luggage. That's why I want to say don't hear anything. Only listen what your mind say then do this.", "My buying experience is very good. Xuv300 is worth buying suv under 15 lakhs. It provide the feel and comfort as well as great performance. It generate good power as it have advance safety features.", "Good buying experience, easy to handle. It's like a toy in our hand, stunning exterior look, awesome torque it will trill us.. safety is next level. Just go for this car, its really wow and amazing. Just disappointed about less boot space. But the leg room is very much comfort comparing with other cars. All four disk brakes easy to handle..in 13.5 lakhs, we are getting start up button, 7air bags, four disk brakes, 17 inch alloy wheels, sunroof, leather seats rear and front cup holder it's really good and awesome.. Just go with this car. Loved it.", "Hi, I am writing after drove till today 8880 Km (w6, P) without hurdle. Amazing drive comfort no matches to other brand, Seating and spacious Suv ...like Sonet ,venue they work on boot space , music and glossy finish , which comes later but safety and comfort comes first which in XUV 300 . Awesome car, go for it.", "", "Acutely I think this car has no competitors in this range.. Great pick up and great drive I love this SUV I drives many SUVs It was so much fun to drive. I didn't feel like this suv came in any suv, that too in such a good price.. I will suggest this suv for anyone. Good features great drive and powerful engine First off all no one class this SUV in this range.", "I would just say about the driving experience because that's what I loved most. I drove this car for close to 40000 kms in 2 years and most of the driving was long route 3000+ kms. Handling and acceleration of this car is magnificent. Last drive was for 1600 kms with almost no stops (just food, water and washroom breaks), it was a challenging drive and XUV300 seems more enthusiastic than me on road :)", "1. My buying experience is good 2. Driving is fully comfortable and good driving experience 3. Front and back side look is good 4. I have done only one service 5. Over all experience is good and safety is excellent 7 air bags in first segment and body is strong 6. Luggage space is good", "Good car for heavy driver i haven't driven yet but still it is good to drive and am little bit confused to buy or go for venue, ecosport or xuv300 if you want more boot space don't go with 300.", "The car gives me smooth driving and I was always shy with driving but with this I think driving is lifeline and need of hour. The smile is with every turn because shine and shiniest.", "I bought this car 3 months back after doing 6 months of research. This car is king of sub compact SUVs. Great driving experience with good mileage and comfort. The best part is it understands Indian roads and speed breakers. Front look is awesome and overall a great design. I suggest to buy it without giving a second thought.", "It is a great car for family, I highly recommend this to you, I, as a customer, am highly satisfied with the mileage, comfort, features, material quality, after sales services, are all good.", "I feel like buying the car and driving it after seeing the car. It looks awesome and has a complete package. It is a very standard looking SUV. I definitely like to have this car.", "", "", "The buying experience is fantastic. Mahindra takes care of its customers. The driving experience is like in Skoda and Volkswagen cars specially the performance is phenomenal. XUV300 is my crush. Service and maintenance is very less as compared to different brands like Maruti, Hyundai etc. Pros : Ride quality, lighting are very effective and handling last but not the least build quality is very good. Cons : For only the boot space of a car.", "Buying experience super though there was a waiting period of 45 days I got this car on time. Driving dynamics awesome. Best in class Looks and performance is super. Service is not upto the mark, had a bitter experience previously but that was resolved by them. Pros: Driving dynamics, engine response (mine is manual one), breaking, spacious and comfortable. Cons: only rear ac vents.", "Pros: Driving comfort both in city and long drive. Powerful engine and interior space. Stunning SUV Look. Cons: Rear AC Vents and USB missing. Boot space is on lesser side. Expensive compared to rivals.", "The well priced car and well torqued car there are segment first dual zone climate control and five star safety. Seven airbags and three point seatbelt for all passengers and all wheel disc brake.", "Very good performance with best braking system. It also saved my life with its amazing braking system. Very good car. Keep it up Mahindra Good Luck for your journey ahead.", "Better driving experience compared to all compact SUVs and it gives more comfort to the passengers. Service is better in our city. My XUV 300 is looks like real cheetah. It looks more luxurious to us. Thank you Mahindra.", "This car is quite expensive when we compare it with other brand of this several, but it is worth buying. The features what they have given we cannot compare with other compact SUV's. The power of vehicle make you crazy to drive amazing Indian vehicle to drive. Performance and looks is like a bull. Perfect vehicle for Indian and for Indian roads. Maintenance is quite expensive but its worth. Waiting period is bit more but best things will always take time.", "", "This is ultimate compact XUV, Mahindra has done good work, the engine performance is good, highly pick up car awesome looks, but I little disappointed with boots pace, Mahindra can enlarge and music system is looking also old dated, telematics features is missed should be provide, in safety features.", "It's look is a class like it is the most best car I had ever drive and I had a best experience as I have travelled for 5000 km in two days, no tiredness.", "Driving so cool, worth to buy, superb look, This is first ever buying an automatic transmission car I have purchased and feeling fantastic in driving specially in a city traffic, nice pick up and enjoyable as well safest one.", "I am in love with car. I don't think I could put it into words how much of a good this is. Apart from buying experience at Mahindra, I don't have any problems with it whatsoever. Driven it around 10000 km and not a single time this has disappointed me. Although I believe looks can be improved a bit in coming generations of this car.", "My first car was wagon r 2014 model but it doesn't give much features or safety so now I am going to own new car first looked on venue but its doesn't give seating perfection next one is Eco sport it is perfect but for me it doesn't give a sporty look and its a old one in that time I thought that Mahindra is not a good brand but later I realized that its the beast one of the con I feel in it is it have only 260 liters of boot space only but it doesn't matter for me but other features in it is like in premium segment cars and also it has 5 star rating from NACP it the thing I come to xuv 300 so if you need safety with other all xuv300 is the big daddy big salute to Mahindra for this car. Thank you.", "If you are looking for an comfortable and safe suv under 10 lakh then you should go with xuv300, in terms of the safety, comfort and driving pleasure it's above rivals can not compete with this car.", "Best car in segment not get any issues going very smooth drive and not getting engine noise with sunroof feel like fun drive very good suspension and leg room and safety, best car.", "", "It's been two month I booked this car and I am still waiting to own this. Waiting period is increasing day by day. Overall amazing driving experience and loved it's interior. Best in this class.", "Excellent Car with a hassle free buying experience. Feeling amazing while riding having no outside noise. Looks is almost a jumping Tiger ( So personally I call it as \" Black Panther \" Excellent servicing with minimal cost of maintenance. CONS- only two as per my opinion (1) Low boot space (2) no ac vent in 2nd row", "It's a very nice car . In this range it is one of the best cars as per my opinion i am going to buy this one . May be mahindra can add some more features but still it's very good car .", "Its looks Officially and completely comfortable with 5 seating, full soft gear, steering clutch break and all features are very well. No one can believe its speed. its pickup rising in a fraction of second. totally its amazing car I love this car and I suggest all my colleague family members please buy a Mahindra Xuv cars.", "First I would like to thanks Mahindra for the great car XUV 300. I am writing this review 3 months after the purchase of my new car. its driving experience is great fantastic it is fun to drive steering is very smooth with three-mode normal comfort and sports it is marked number 1 in the crash test it gives a great feeling of safety I got serviced the vehicle only once it servicing setup is great all facilities are available at its all servicing centres all staff are very polite cooperative though everyone tells that its mileage is less but my experience is that if we drive is a comfortable and smooth manner, not in the rough way then we can achieve up to a mileage of 17 at the highway and 14 in the city its maintenance cost is very low there is a strong support system online approx every week customer care centre ask about any problem are any documents are not received after-sales service is also very good overall it is a great car in its compact SUV segment I am very happy with my decision .thanks Mahindra again Jay Hind.", "Low cost spares Low maintenance High performance I driven 60000 kms 5000 to 6500 only come service cost 20k oil service More power and safety Strong car Good ride and comfort position I stongly recommend Easy to drive Above 170 near fell fear Excellent brake system Diesel car 1.6 sanyang engine Mahindra show the value of money", "I love this car and amazing speed with luxury in the middle of nowhere near to ??? buy it and enjoying for future .. now I'm going on narkanda {65km from Shimla) love you all take care", "Most powerful suv in the sub 4m segment. 300nm torque at 1500rpm give you enough power to accelerate from any speed and gear. Few must have features are lacking in w6 diesel model 1. Driver seat vertical adjustment option 2. Driver cabin lamp which gets on when door is open. 3. Android auto in the infotainment system.", "", "The m&m service since buying has been amazing, very polite staff and even the buying process was amazing. They let us have multiple test-drives before booking the car. Ride and handling is certainly excellent. Definitely a vehicle for a car enthusiast. Looks are sharp and definitely attention-seeking. Servicing has been excellent till date and the showroom staff tend to call to enquire about any faults in your vehicle. Pros: engine, mileage, features, ride and handling, comfort, vfm, service, interiors, steering modes and torque, comfortably seats 5, build and safety Cons: boot space, no rear ac vents or charging ports", "I bought this vehicle from Caravel Motors Vadodara and buying experience was very good.XUV300 W8 Diesel I own is best in class..very good average...engine and clutch very smooth...Overall I. Very Satisfied with this vehicle..It has more features than any other cars in this segment and higher segment...that too Indian Car ..", "It's worth buying, very smooth drive, performance is flawless, but boot spaceless and speakers quality is not high end but overall good, service is good, the car is fully loaded with a top feature in its segment, comfort is also very good.", "Value for money, riding quality is so stable, easy to drive in the city as well as rough roads. Accelerates slow initially then goes fast. seats are comfortable and so easy... And out of all these the servicing and maintenance are affordable and classy ....Mahindra delivers very friendly and easy facilities to its customers.", "1. Best in segment 2. Smooth driving 3. Three driving mode 4. Performance are very good 5 . No high cost maintenance 6. Cons.. boot space area are low Ground clearence only 180mm", "Bought from PPS Mahindra, Indiranagar, Bangalore. Awesome experience from PPS. So good petrol turbo engine doesn't look like 1.2 L at all for such a heavy vehicle. The look is awesome - muscular & heavy road presence. Still, to for 1st service but Mahindra has learned a lot from Ford in terms of service. PROS: Safety, premium from inside & outside, after price reduction, W8 is a very good value of money. CONS: Boot space more than i10 that's what we use normally. Only 2-3 times in a year we need more boot space.", "Nice car ...Good features,price, and experience. If you go with a long drive it's totally comfortable. looking also gorgeous.if you want xuv with beat price please go with Mahindra varito", "I'm totally blanked when I first show this car it looks like my dream car and one day I drive this car that is awesome it's servicing coast is very cheap about 4 to 6 thousand is enough", "", "", "", "1.best in segment 2.smooth driving 3.good looks 4.low maintenance 5.pros.- boot space, ground clearance, system sound not good in the segment , cons. performers are amazing, pickup is best", "When I drive first time xuv300 I feel it is smooth and awesome driving experience of my life . It is too good car in this segment no one can defeat this car like Hollywood movie 300..", "Amazing driving experience, better control and comfort, excellent look, value for money. build quality and safety standard are far beyond our expectations.", "It is always a great experience to drive XUV 3OO. It is a luxuary car having great look, excellent exterior n interior look and comfortable seats. Besides boot space all things are excellent.", "Car is overall good. Pros: 1. Great look. It looks like a luxury car, better than most of SUV type cars in its range. 2. Cabin is comfortable and spacious. Cons: 1. Milage is a bit lower than promised.", "", "", "Amazing car , extremely powerful, feature loaded , good looking , diseal varients is awesome, build quality is solid , when you sit inside you will feal that why it is India's safest car . Only issue boot space is less but you barely use boot space and if you need more then you have a option of split seat . Little bit over priced.", "Stylish look more comfortable build quality overall excellent xuv . also good for off road driving . Good engine performance more comfortable for long route traveling . mahindra XUV 300 is of the best XUV", "Mahindra took the base and Tivoli as a base and reengineered it to develop the xuv300. Some of the hardpoints like the front cowl, a-pillars and the overall chassis are the same, while a lot of the body panels are new. Most of the engineering work went into trimming the baby xuv,s length to 3995mm to avail the considerable tax savings.", "The only constraint in this car is its small boot space. Apart from that, it's the best car in its segment. The inner space is best as it's the widest car in this segment. Comfort is the best.", "I will just say that don't go for other cars under 13 lakh because I have studied 6 months for every car and I found mahindra xuv the best car. And now in 2020 the best anti accident car is Mahindra xuv 300. There is full black colour and that's my favourite it looks like men in a black car. Thank you to car wale. Go for the car.", "the ultimate car must buy. I recommend this car for everybody who wants to buy a new car, it is not just a car, it advised also about driving the car, a very sensible car. fall in love with it", "Dealer deals smartly, drive comfort excellent, looks like a suv, performance is good , my new car is not in service as it's new, maintenance cost is less till now, sitting comfort is very good", "", "Best car of the segment. Excellent raiding and handing quality. Safest car of India for adult and child occupants. Car with full of feature, seven (7) airbags, all disc brake, ABS, EBS, traction control and much more.", "My driving experience very good. More comfortable vehicle. Looking very good and giving better mileage. Cost of Servicee and maintenance also low. Big features with reasonable price", "This car is amazing look it permorm is very good this cars is powerful engeen it is very comfortable this car lookking nice led lamps looking more beautiful safety features is good in this car I would like to buy this car it's servicing is very easy than others car so I like it and buy it future", "the staff of showroom from which i bought this car is absolutely awesome give info in detail about car and i am driving this car for around 30000 km and the experience is so amazing the looks , performance and comfort o this car is fabulous, and the service and maintenance is not much low as a sport bike", "Looks great. Interior is awesome. Powerful and sturdy. Smooth driving. Also, the sunroof is an addition. The car specifications at the said price are good Just what I wanted. And most importantly Indian brand", "I get through to find cars before 6 months i went through numerous showroom to buy a new car and compare them through other company cars I found many difficulties to compare or understand them But one day I am searching on Google i found the website carwale.com it helps me lot to compare the cars and give the best price of cars so after using carwale.com I buy the car within 1 week without any difficulties so thank carwale", "First of all as our country wants made in india project it satisfies that .Then driving experience awesome. It sticks to the ground.looks are great full comfortable seats .It doesn't cost that high .And maintenance is not that expensive.Overall good performance and build is also strong . I m fully satisfied with it .", "Very good car but buying experience is not good.car performance pick up is good giving average 18kmpl.w6 diesel is value for money buyer's those who want a perfect SUV at 11 lakhs just go and buy,and it's five star rated in ncap test very strong body compared with Maruti cars. People all are buying vitara breeza when compared to that its 100% better than that car.", "", "In Tirupathi the mahindra showroom and workers are best It is Super to the vehicle Awesome look and very very excellent design Maintenance is better and servicing also better One cons is in higher variet have the 7 airbags", "Actually this car contains Superb engine ,I m having different cars but driving this one makes me feel like super exciting ,and it feels like a luxorious car also comfortable + relaxing", "Overall car is a good, value for money. Engine power is good enough more you push the pedal more it roars, thrills, put roads on fire while driving, built quality is very strong, up to date features are available, first in segment some features like as all-disc brakes, dual climate zone. Just two disappointments those are rear-seat vents and boot space but can be compromised as you get a good pack of features.", "Finally I want to purchase made in india vehicle so I had decided to buy Mahindra xuv 300 it's awesome I am feel proud to make owner of xuv 300. Performance is to good and feel drive.", "This car is a beast if u go for a Diesel engine. It has 115 bhp and 300 Nm torque. Though it's overpriced when it comes to performance no car in its segment can compete it in Diesel. Even Creta has 250 NM torque in diesel. The only disadvantage of the car is its Boot space bcoz in the 2nd row space is occupied more for passengers that's y the boot is less.", "It is a very good car mahindra provide a power full car it is a value for money car it is a beautiful car it is competed for all car", "It is a great car although pricing is on a higher side compared to its competitors. Boot space was a disappointment. The front dashboard could have been better. Rest is absolutely fine", "Mahindra is a brand image as an SUV and market leader in SUV We talk about XUV 300 then it is a very good choice for looks, features, safety, space, technology and many more in short value of money Wheelbase is good The 1.5-litre engine with 4 cylinder Width and height is good Unmatched features Thrilling power.", "", "This is the car for sporty, Safer, Stylish driving people, Comes with tons of feature like Premium SUV, Pros * Stronger, Safer and heaviest car * 7 Airbags * Best Car driving comfort * 17\" premium Stylish alloy with Wider tires * Refined Diesel engine with the best Power and descent Gas mileage * Premium Interiors and Space * Technology ( Hill Assist, ESP, 4 wheel Disc brake, Tyre pressure Monitoring, Sunroof, Seven Airbags, Dual Climate control, Auto Light and Rain Sensor, Auto-Dimming, Beautiful Meter Console, 6 Speed Gearbox. Cons * Boot Space * Mahindra Service team ( Not Qualified to Premium segment, people meant for max.bolero ) Team act and treat the customers like XXXXXX ..My personal opinion ( what i felt)", "Xuv 300, design looks more elegant n broad, gives the look of SUV. The sunroof is an additional feature, good interiors n space, where u get total of luxury n comfort with this segment of cars.", "Car looks awesome Pickup ,seating,cruise mode, extremely good Within small budget provided with all features Ac works superb, sunroof , parking features, overall the car comes with all features with reasonable price If u r looking for safety car then go wdh xuv 300 totally 7 air bags Cheetah...", "Good drive I had too much glad in driving I love it so can say that was amazing trip then I drive xuv300 this was a complete a good car for everyone who want to buy car for a comfortable price", "Very comfortable in driving, look very exclusive from other suv, tail light with led is look like eyes, so you can see from far and turning radius is good you can easily park in short space.", "So power as looks like and smooth driving I love it. In last I say waooóóo just waoooóoo what a car a perfect xuv. I just want this car awesome yaar Maja agaya. Best for long tour drive and the safety features are too góod.", "This is really excfellent car. I drive it daily to my office in city traffic. Also, I have driven it long distances, Driving experience is excellent in both city driving as well as long distance driving. Highly recommended to those who love performance, power and sheer driving pleasure.", "", "Pros : power, safety ,global ncap 5 star rated car , features ,ride and comfort , looks. Cons: boot space is little less compare to others. But its manageable. Best in this segment. Better than creta and rivals in terms safety . Just go for it .", "Osm car ND safest car in the world also contains many new technologies in this car ND also has diamond-cut allow wheel ND this car is more useful ND awesome car in this segment or.", "Buying experience of this car is awesome because this car scores 5 stars safety rating in Global NCAP crash test and for child safety rating scores 4 stars during crash test norms. The riding experience of this car is outstanding because the ride quality of this car is excellent on the city and highways and highway stability is excellent around the corners. Looks of this car is excellent than the other rivals, it's looks are simple specially at the rear it looks so nicely and better than the brezza, Nexon, ecosport, venue. Performance of this car is excellent in 1.2-litre petrol engine because it generates 117 bhp and 200 NM of torque and best in class, petrol engine feels peppy and frugal on both city and highways and drives very smoothly than the Nexon, venue, and ecosport. Servicing and maintenance of this car is excellent because the spare parts easily available, Mahindra servicing not much expensive and maintenance is very low. There are some PROS and CONS of this car. PROS:- 1.) All safety features such as all-wheel disc brakes, 7 airbags (on top model), traction control, rollover mitigation, hill start assist, hill hold control, ABS with EBD, ESP and 2 airbags, ISOFIX child seats as standard. 2.) Longest wheelbase in its segment 2600mm. 3.) Rear seat space is excellent and 3 can sit comfortably than the rivals. 4.) 6-speed manual transmission ensures optimized gear shifts for a smooth and effortless drive. 5.) The only car in the segment to get front parking sensor. 6.) Only car in the segment to get tyre position display when parked, the XUV300 assists the driver while starting out. 7.) It gets first in segment Follow-me-home and Leads me lamps. 8.) It gets first in segment Dual Zone Fully Automatic Temperature Control. 9.) It gets first in segment Heated ORVM'S. CONS:- 1.)Small boot space with high loading lip. 2.) Too much expensive 3.) Diesel engine not responsive below 1500 rpm", "\"AWESOME\" is the word which comes out my mind when i drive this car..totaly comfortable and value for money the only flaw is that rear AC vents should be there and boot space could have been increased than it could be best SUV for indians", "I am happy that i selected xuv300 among the heavily crowded compact suv segment.. car is really very sturdy and strong with great road presence. Riding and handling is awesome..the only con in this car is less amount of boot space as compared to rivals, but won't bother u seriously until and unless you are a frequent traveller with your family.. overall Mahindra xuv 300 is the best product of Mahindra till now with awesome features..", "In short a family car. I love it's features Dual tone seat cover No cabin noise Amt feature Stylish lights Comfort driving. Will buy soon From karnsl", "It's the best car we even have thrilling experience it has a good pickup and roof rail is different its is the best car and is top car it has a good style of appearance but it's not the best car.", "A very good suv, must buy in its segment, I impressed with style, comfort and name of Mahindra is itself sefficent for quality and after sales services, I am planning to buy this car this year", "", "", "", "", "", "XUV300 is a real fire on the road. Ride quality is amazing , it's gives you the comfort of sedan and toughness of SUV. It's packed with features which provides you lots of convenience , stability features are superb , cabin gives you luxury and spacious feel , 200 NM torque and turbo engine gives you real spark , steering mode gives you the flexibility to switch to the driving zone you want to. I will disagree with reviews over internet that steering mode doesn't make difference , after driving 10000+ kms I can assure you it does and will please any driving enthusiast. It's tyre direction feature is unique and really helps when you are taking your vehicle out in congested parking slots . Front sensors are also of great help while driving on congested roads. It's a gem of a vehicle and I know it's bit on the costlier side when compared to other sub 4 meter SUVs but I feel it's worth every penny considering the comfort , luxury and power it gives you. Only negative point I feel is small boot, however you can easily overcome it by buying Mahindra Universal Handi Rack Carrier for your weekend gateways with family", "Very good experience.. great model.. super comfort. Great features.. good ride... greats safety..fun riding. Great view.. worth price.. good mileage. Great among all ultimate car. Great great.", "1) BUYING IS AFFORDABLE PRICE AND VALUE FOR MONEY 2) RIDING EXPERIENCE IS SUPER. 3) LOOKS IS AWESOME AND BEAUTIFUL PERFORMANCE IS AMAZING. 4) SERVICE AND MAINTENANCE IS AT REASONABLE PRICES 5 PROS AND CONS ALSO NICE AND ATLAST I THANKFUL ANAND MAHINDRA FOR AWESOME CAR AND AFFORDABLE PRICE BUT THIS CAR IS NOT MINE MY FRIEND OWNED THE TUV300 I ALSO DROVE SEVERAL TIMES SO THE ABOVE REVIEW IS MY FRIEND'S CAR.", "I would suggest to everyone especially this variant 1.5 W8 which is the best in all segment. Because in this value for money you get all the safety features which you would not even get other compact SUV's, also the power and inside space is very good in this segment. Its value for money and make in India product. Please go for it.", "So more comfortable car driving very smooth and so much comfortable setting driving is very comfortable in every way like city road and highway so we can say that XUV is best luxury car for me", "Nice working with you and I amso good day please receive my life I have to go back and let me check my email address is no tell me how to get the chance to look at this time and consideration I look forward to hearing about your experience with you and your team and your family and friends is no need to 14", "Look, mileage, everything perfect, price good.", "It's a very nice car I want to by this car jan2020 interior design and specs very good AC sunroof and average good fit and great price thanks and I look forward to buying", "The car looks stylish in both. It's exterior is very good looking And the drls are amazing The diamond cutting alloy wheels looks so stylish and the back portion of the car looks better than Vitara brezza and creta The interior of the car gives us luxury feelings and the music system is also very good.", "First of all, it was an amazing experience I had on my trip with this car, kudos to mahindra for making such a beautiful vehicle and so affordable. although it may not fully satisfy your needs, but i guarantee it will manage to put a big smile. we were three people travelling in newly purchased xuv300 by on of my friend. here's a brief about the vehicle: PROS: 1. A vehicle to brag upon. In country like India, SUVs are liked at the most. reason due to good performance, high ground clearance ,reliability and assurance. In sub four meter segment, xuv300 is overall a good package. 2. Space. space has been mahindra's forte. Believe me, its the maximum space offering sub four meter SUV. boot is rather decent size, not biggest of the class. 3. rich feel interior. best in class interior and quality is brilliant, nothing feels cheap at all (a lot of hard plastics though). 4. comfort. it is a comfortable car i would say, nothing much on that. its decent. 5. feature loaded. there are a lot of first in class features that make it a good choice. 6. decent under thigh support, head room and leg room. shoulder room on second row may be tight for three hunks. 7. Mileage. it returned an amazing mileage of 21kmpl. yeah that's right... CONS: 1. Good to drive, but nothing beats Ford. ecosport being its rival, is more fun to drive vehicle, with more performance and stability of ford doesn't need any praise. but when buying a vehicle, we look to whole package. so this point is on you, what you need. 2. boot space could be more. boot is an issue in this vehicle. if you plan a trip with 4/5 people with luggage, you might to cut down some luggage, or say good bye to one of your friends. (in our case, we declined one seat to increase load carrying capacity). 3. AUTOMATIC TRANSMISSION OFFERED IS AN AMT... how can you offer amt on an suv. amt is such a notchy transmission, that willl definitely give jerks post 3000 rpm. i haven't driven amt one, but amt is amt. mahindra should have offered AT as is the case with xuv500. if you are an enthusiasts driver who love to rev and get high end performance, its rival may make a good option, but if you want a fully loaded suv with space, comfort and overall strong performance, you should definitely go for this one.", "I like this car very much for Mahendra xuv 300 And very comfortable seats in the car. Very powerful engines .The company service experience will be nice The car seats and break is very comfortable in any Family Guys", "XUV300 is a beast in performance along with excellent comfort. Beautiful dual-tone interiors with a muscular look from outside. I purchased w4 variant which is a complete value for money package. It feels like a King while driving and i am overall very satisfied with this car. If in the budget go for W6 variant which is a well-balanced one. This car is definitely the best in this range beating all it's Rivals like Ecosport, Brezza, Tata Nexon etc.", "Hi my riding experience in this car was fantastic, lowest rate xuv model in all brand, interior all these are make latest technology and seating face also good , its a good for al families riding ...", "Nice suv car with good performance the pickup of the car is excellent. it beats Hyundai creta .the price and maintenance of the car is suitable for middle class people. Finally a good suv good for this year", "I love the features that Mahindra offer on this SUV, The interior is well finished and gives the best feeling in this car. This is the best car in market and I still used this car. The LED combination tailgates and that blackout bumper seems well put together. The Mahindra XUv 300 is a spacious car.", "It's my dream car This is very nice and a strong car very nice and shiny out side look and very sporty head lamps and fog lamps shorp slim halogen lamps interior look is very nice and beautiful design and adjustable seat", "This car is so good looking led lights comfortable seats smooth running and this car is very cheap this car is like a luxury car I love this car and thank you mahindra for made this car thank you", "it was difficult to buy as a price but managed happily Riding is so extreme look is very youngest and performance is super till I do not avail any servicing and maintenance but its very comfortable good", "Best in the price segment And that's a safe car..... 4 disc 7 airbag Dual temperature ac vents Good touch response and sounds Hd camera A very big sunroof and boot space More important that's good ground clearance and a very powerful car...", "The experience of the people’s and you have to show the demerits of the car and it’s not like that every car has only merits they also have demerits so pls consider these things and work on it.", "Riding quality is best and comfortable for long journeys. The car is best in safety standards. The interior of this car is much better for practical use. The anti roll back feature is awesome.", "Very nice and compact siv from brand mahindra and the car is lookong very well nice and brand card from brand company. And the xuv 30o is fabulous car and the car is my dream car and compact SUV for family.", "This car is so peaceful and powerful also because it's mileage is 17 kmpl 219 kmpl on road and highways 21 kmpl to 25 kmpl this is a very good car my experience of buying this car is very good is the car is riding at the superbeast level it looks are so nicely profile of fix a wooden translated performance are so good servicing and maintenance are so low cost less services are the first year very nicely determine the features and pros and cons", "Its very nice and comfortable, looks great from both externally and internally,comparing from other suvs its great in this price,and it is valu for money and having trust of Mahindra..... overall its excellent", "Awesome car , I have purchased this car in September 2019 drive this in almost 300 KM , no doubt the car is amazing , whether its power or services i would recommend buying this car if your budget is up to 12 lacks.....", "Only one complaint gear shifting is difficult because of armrest( armrest is higher then gear knob) Otherwise nice... Excellent power Good Space Super power Comfort is nice Fuel economy is good for this performance 80 - 100km = 19.5kmpl 100 and above = 16kmpl", "Very good feacher and everything is good specially drive safe and sound at least a great experience for me and my family .I will see what I want . next time I will purchase New car it is confirm Mahindra", "Buying experience was good. I have driven it almost on every terrain and it just feels superb and specially on highway you feel like you're the boss and definitely it is the most fun to drive to car ever launched by M&M in market. Service experience was also good in Gwalior (M.P) as it has clocked only few thousands Kms on its odometer I can't write the core maintenance experience for now. Pros : Looks , Sturdy design , interior quality , fit and finish , driving experience etc Cons : Pricey , fuel efficiency", "Struggled while buying this car at sale point ..buying experience was very bad ..worst customer experience...but car is awesome!! Looks are fantastic in black color ..its eye catching!! Mahindra should work on improving customer service at both sale and service point..had bad experience. Over all it's a great experience !!", "Feel comfortable while both driving and being a passenger inside this fantastic car. It attracts a lot of people while on the road. The cabin is very spacious. Its pulling power is amazing. Because of its torque, overtaking is very easy and you will never get struck during overtaking. The only drawback I see in this otherwise fantastic car is its low boot space. Its sixth gear makes travel very easy on highways. I get around 13 KmpL on average.", "The Best car ever i used to drive in my life and I'm sure if you guys looking for best value car for your money just go for it the best car still the date. The Best car ever i used to drive in my life and I'm sure if you guys looking for best value car for your money just go for it the best car??", "As you've seen elsewhere in this magazine, every mainstream carmaker and few new ones want some of our SUV love. This is even more true of sub-four metre SUVs. In this segment, Mahindra, a brand which has been dominant otherwise, has been a late-starter. But that's changed in the last few months. it's not a car it's a ship", "Very good performance and look wise very fantastic I am purchase this car currently nice look space in the very good mirror and all features best of the car in Indra XUV 300 seat comfort Andi James is very good I am purchase this car", "Good interior and good features ..so good mileage for long drive........so beautiful car ...and comfortable for passengers.....i think best suv this era...nice exterior vision.....", "I am planning to buy this car... It's the best car in the compact suv segment.. Slightly costlier compared to other cars in the segment.. My Choice will be w8 variant. It comes with almost most of the required features.", "xuv 300 is comfartable to 5 people and xuv's look is very nice and intrior is also cool and in the xuv thir is full space in car saspenshan is very good of car ani its hight is alo so nice in low price we are getting more features i well say to people xuv is very prect for small fmaliy 5 6 people", "", "The XUV 300 to convenience and safety features. The W8 variant gets 17 inch alloys, hill hold, front and rear fog lamps, reverse camera, auto headlamps and wipers, dual zone climate climate control, projector headlamps, LED DRLS, Android auto and Apple carplay support, keyless entry cruise control and an engine start stop button. In terms of safety it gets dual airbags, all wheel disc brake, abs with ebd, child seat anchors, ESP and hill launch assist. The W8(O) gets the addition of 5 more airbags, a sunroof, heating wing mirrors, diamond cut alloys, a tire pressure monitoring system, front parking sensor and leatherette upholstery.", "Fabulous car at this price range it is better than other cars at this price range it is good for 4 to 5 people to enjoy the ride it has the next generation features which is good", "Best car in the segment. It is a very powerful car and it is very comfortable. I cannot feel any speed breaker. Its looks are amazing and looks attractive on the roads. It is the best suv", "It is very good to drive and comfort car I ever seen .it make my journey more comfort and I love to drive . It has more Foot space so it is very comfort for all type of people. Outer look is best one . It is very easy to maintain .overall it is a best car .", "I love is car experience good car Amazing car Luking good all is will long drive cool frling i love is car i provaid is car xuv 300 or 500 car is quine of me my car is all good", "Excellent interior and super design and power full engine , I have seen this type of car . It s a very relaxable car and new car very good miles and great power of this car please purchase the car.", "Xuv300 very comfortable And very nice looking Xuv 300 no maintenance Good performance Very good Riding and very nice looking and very very nice good looking and low maintenance", "The car is very good looking are smooth and very attractive my suggest my all friends purchase this car and enjoy the right smooth driving enjoy the fun car is a very beautiful.", "Excellent car planning to buy with in a month .Pick up and breaks systems are really excellent.car looking great and excellent performance.as discussed with dealer regarding the service and maintenance the cost is also very cheap as compare with other cars as this segment.overall excellent SUV and have good experience.", "Bahut achi hai ye car murti sabse achi ahai lene layak hai bahut achaalaga chalne me too speed me. Mast chalti hai mai ne bahut injoy kiya yisse achi nhi chalti car very good good cear", "Very good car and very good save car mahinder ki gadi achi hoti ha j car family ke leya gud ha save ha main j gadi lane wala hu new jaldi I like it very good design is car very nice all gud", "This car is maintenance very Eisley and minimum balance my favourite car Mahindra xuv, drive karne me v achha hai mileage bhi achha hai, service ke mamale me bhi thik thak hai this car is best", "I want to buy xuv300 in just few a days this is the best car for me and my family best segment which i want to buy this car is awesome we are 6 family members so are easily comfortable sit in this car so i want to take car to home as soon as possible", "My Friend Buy this car .... Just I see that Car look was to Good and like luxury .... even more over Last 12 years my family use mahindra scorpio ... bolero.... again scorpio... now tuv 300 ... so we have 8 cars different products one or two car mahindra have .... everytime so i like very much mahindra especilly now i like very much xuv 300", "We bought it happily as staff was great and service was excellent. It is cozy to ride this car. This car looks like a royal room or a royal car in which u can have a candel light dinner also the look of this car is killer and beautiful it performance is upto the mark. This car give a mahindra welcome and service is good with high level of maintenance. Pros of this car that we get good space, a cozy place, happy ambience in this car, good features, nice and sensitive stering, easily moving gear box and happy for its seat as its soft. Cons are just that accessories are offered limited or else this car is BESTTTT", "XUV 300 1.5W8 stylish car very very nice car car colours good air bag nice car head lights stylish car red colours is very nice car rear camera clarity nice car is siting nice car is egine cc good", "I had done test drive ..simply its best car ...when compare to breeza creta the xuv 300 is excellent ..best interior and exterior ..price is worth ..so below 10 lakhs budget this xuv 300 is best one", "Space and look good feeling ride somthly value for money big vechle for reasonable price range of color available good music system and fine seat covers ?? with all features in vechle", "", "Excellent condition of exterior and interior design ideas. Feature are fabulous. Road greep balance speed just wooooo. I dreamed about XUV300. AC power and control with body temperature.", "Just boot space and ground clearance is less than expectation, others are fabulous. Just run for few of kilometer and feel more comfort than hyundai creta. Special is chruse mode for comfort drive.", "This is amazing feature in this car. I will suggest to everyone to purchased this car and its very comfortable .. seats are very owsom and parking light and sensores are very much working", "Brought it very soon after the release.... Riding xuv300 feels very soft with the silent engine and the steering mods are simply superb. Looks are not bad but the performance is much interesting with the fully equipped sensors and sunroof is fine looking. Service is normal with mahindra which will be usally best, but the maintenance is not much costly. Many first segment features are pros and automatic variant is not available as of now.", "Value for money, Good And comfortable Vehicle. ABS, multiple control systems More specifically Dual temperature is Awesome. Width of vehicle give full family drive with out hesitation.. Ultimately Nice....", "The car looks tooo good and sporty. Worth to buy it. I prefer to buy this car. As compare to any other suv or any other hatchback. Mahindra improves car quality day by the day. In the looks.", "I love this style, profomance, freatures are amazing car and i try and try to buy.This is my dream car. I want to buy this car. Now I have economic problem but .... can not. I hope that", "Very nice car new feature new look nice performance and servicing and maintenance is low cost . cons are rear ac wents are not their. Buying experience was nice . Riding experience was to good. Compact suv in nice look. Instrument cluster is nice and accractive we can change the colour", "In short the car is amazing Just go for it.. Price is ok Or if u can wait than for ciya. Some of the future will grab eyeballs U can also check video in YouTube And fiters and price carwale.", "this is the dream in budget.buying a 1st car its always excitement... and if we get it in mahindar then it is dream comes true. Fabulous car Super look Super power And very good and comfortable for long journeys.", "Very good riding good smooth cofortable i like this suv mahindra made veey good product i buy thia suv i am intersted this suv mahindra made very good peoduct mahindra is leader of suv make", "Best in engine..easy to drive and smooth pickup.this is 1.5L engine and also in top end we have sunroof which really superb.. nominal service and maintenance cost ...boot space also really good..", "Looks very sexy and styling i lovw this car exterior interior very nice fuel average so good built quality very nice best car in suv segment all colour r very nice bt i like red colour", "It a best budget compact sub suv car for the youngsters. Also it provodes the best features around the competitors. Interiours exterios i loved the most. The engine performance is tremendous.", "The car is fabulous in overall experience. Best in class safety Best in class powerful & enthusiastic power & torque Best in class comfort for both front & rear passenger specially for 3 passenger in rear seat Smarter & head turning Design First in segment & best in segment Hi-Tech features Tyres are really gripy & wider in segment with 17\" size New styling LED DRL give its cheetah inspired look Front parking sensors All wheel 4 disc brakes Long wheelbase in segment 2600mm Wider in segment with 1821mm 3 seat belts for all 3 rear passengers, with more legroom Rear LED tail lamps with rear reflectors + fog lamps Reverse parking camera with 4nos. Reverse sensors with rear wipe & wash Passive Key less entry Antipinch driver side window glass 7 airbags Sunroof with antipinch function, bigger in segment Codriver side airbag on/off switch 3 steering modes Comfort / Normal / Sport Heated ORVMs Dual zone FATC with memory Auto Headlamps & Rain sensing wipers & many more Very stable & comfortable in every situation whether you are driving in city / highway / bad patches / cornering / drifting Stable in cornring / sharp turning or even high speed 170/180 Only the minus point want to find then Rear A/C vents Rear power socket Central console could be more better Sliding armrest Cooled glove box Cornering lamps Puddle lamps", "Pros : Ride Quality is awesome Looks are great Value for money Worth buying Cons : Delay in getting accessories from company like reverse camera for w6 variant Nothing else :)", "It is very good family car It is very comfortable car Service is very good Easy to maintain Great experience It is gold Best car of 2019 New record creates All creditw goes to mahindra", "It is wonderful car i want to buy this tommorow because i exchange with scorpio s4 in showroom l am very happy this car we came up with up window and excellent millege with few petrol", "worth for money and very much comfortable in riding for long drives. interior is not that much great coz of light color. but overall performance is really very great and looking so pretty.", "This is the best car, value for money. Power of this car is very good, pick up ultimate, the interior is also nice My car gives me mileage in highway up to 24 on economical speed 80-100, which is unbelievable, hear is no option for attach file otherwise o have a pic of instrument cluster which shows 24.2 milages. Must bye this car, very nice performance as compare to breeze and eco sport and Nexon, more spacious, leg space is also good,\nNANA", "Mahindra is going on heights in car segment.. So amazing car it offered is XUV300.. Great looks, nice engine, best fuel economy.. Value for money.... All i can say is if u r jus thunking of buy this car, dont jus think.. Buy it", "Excellent car to drive.....excellent engine performamce......excellent steering controls...ABS and EBD...perfect.....interior is dashing.....love dual tone dashboard...overall experience is excellent.", "The xuv 300 is the best car of the segment and the Mahindra quality is good and also the car build quality the looks of car and all the car sunroof and many more thing in the car all good super car brilliant experience .", "Oh god . what a vehicle. Ufff. I got short drive once. In malayalam word ' kidu powlichu' . good vehicle. Nice driving experience. Driving performance is marvelous. This is just like a monster. Mahindra XUV300 are identifiable by their diamond-cut alloy wheels and premium kit like front parking sensors, heated outside mirrors, a sunroof, leatherette upholstery, auto-dimming inside mirror and a tyre pressure warning system. However, these versions are expensive by class standards.", "This can used on road or during off roading It is my favourite car ,my maternal uncle have one ,i really love this car ,i will say other customers to buy this car ,it's interior is also very good", "First like many others, I was also having same views that this car I high prices specially upper models may be by 1L approx. But after my purchase this W8 petrol version and driving approx. 700 kg in last 15 days, I can say this is best car in its segment. It competes none other than Creta as has high comfort in driving, smooth clutch, smooth gear, excellent power and rich interior. Boot space and Back AC systems are the only weak point but it do not affect much. How many times in a year we require big boot space? In routine it is actually leg room space comfort for back passengers is more important. Ride of car is very smooth and it is loaded with a lot of features. AC is very strong so absence of back AC vents does not affect. Since engine is turbo booster hence in the beginning felt little awkward due to turbo lag and sudden speed pick up but later on got habitual. On mileage part very little was shared in previous reviews and I kept checking before my purchase so that I can decide on this but I want to help for those who are looking for purchase new car. On long run it gives 15Km/Lit fuel economy which is quite decent for this heavy weight car and it is with AC on. My regular run is a 15 km stretch and traffic can be said average only. Traffic area generally covers 2-3 Km and rest is not so much busy. Hence in the scenario I am getting approx. 13 - 13.5 Km /Lit mileage again in AC on condition but i am single occupant. I hope this will help to all. I am sure venue will not be able to match XUV-300. On the contrary, Creta lookers can go for this and save 2-3 lakh.", "buying experience was excellent, riding experience was very smooth, looks are killer, performance is very good, servicing is excellent. everything is good in dis car except space .the sunroof experience is mind blowing. the real seat shud have more space", "Superb compact suv.. Excellent performance...exhilarating power thrilling drive...superb ride quality and dynamics.. great looks and features..what a stability mahn!! Planted !!! Simply a big wow on the performance and stability of this baby monster...u can feel the power and torque jn real.... only thing that let us down is boot space .they could have increased the boot by a bit...", "Beautiful Nice Beautiful car Good Excellent car Locking nice excellent performance beautiful locking Prafming experience excellent...no words Beautiful drive wonderful work... extra place", "Engine sound was good when the car speed at 100 and its not vibrate and the controlling of the car was awesome like you drive a luxiory car overall a good driving experince of these car i'll plan for buy these car top model...?? Only the negative part for these car is The Rear AC vents are not provided", "Best car in segment with loads of features. A perfect SUV with powerful engine. Safety features are best in segment. Comfort is very good. A classy car with classic features, specifications, build quality and styling! Though the price is a bit higher, it(W8 Optional) is a worth buying option! :) Pros: Maintenance is less. Buying is made very easy through the www.mahindarasyouv.com website. Rides like a plane when running in 4+ gear. Safety is at it's best. Cons: Right side driver pillar disturbs the vision a bit. Mileage is a bit lesser than other cars in the segment but this usually happens in case of powerful engine. Price is higher than other cars in segment.", "", "Mahindra sellaras are good enough to talk about the car. They have good communication power and loyal nature.Riding of this car is feeling nice & smooth.It Looks like cheetah... Cars headlights are looking damn good.The interior of car is designed very well.comfort level of car is so nice.we can say its the complete laxuris car.??", "Amazing experience on xuv 300. Engine performance, Rear seat space, interiors, gear box, multi-use of steering, sunroof, a/c controls and storage data , storage medium, leg room, etc are ultimately gives feel great. Thanks Mahindra.", "Awesome car with luxury feeling, more options and good driving experience. I love it's look. Black looks like a beast. And sure the brand Mahendra. It has given a best car. Spacious interior and good looking features", "The people of Mahindra showroom are very co-operating. The car is a blockbuster in its segment and it's the best SUV. The servicing charges are cheap. It's best in its segment.....", "1. Buying Experience : Purchased it in a week after taking test drive.. Experience was wonderful. All features were well explained by advisor from Caravel motors, Vadodara. 2 Riding Experience : Just ride it and you will love it.. 1.5L engine does the job... On highways and in city... 3. Looks are amazing and its feature loaded, Milage is 17-18kmpl. 4. Service : 1st service of my car is done.. Experience was good 5 Pros: Looks, Engine, Space Cons: (a) Missing out small things like Reverse camera/sensors (which are not yet available as an Accessory in official mahindra showroom), sensors are basic features.. they should be available. (b) Speaker volume for Hands-free function is too low to talk in noisy atmosphere. (c) boot space could be better.", "Now am using maruti swift..am looking for xuv300 in future..I like this car..i wish to test drive this car if I am feeling comfortable with this then I ill going to take...thanks...", "1.Buying experience is not that much exciting at mahindra vijayawada. 2.Riding experience in xuv300 is absolutely fantastic for myself in diesel 3.looks is stunning both exterior and interior and the colour of mine is red which is striking and head turning 4.not yet experienced service yet 5.pros. are all the features it have in top end as all we know what's in optional variant. the cons are not having dead pedal, rear a.c and cooled glovebox.", "Good car for family and long drive very comfortable and very smooth drive nice look And more space in back good fuel efficiency And excellent performance .good choice for buying xuv300", "", "", "This is the best suv in its range..i like the design and proper dimension un all the aspect if space and features.the best part of rhis is so mindblowinf desugn wirh oustanding performance in speed and millage also.", "It's not only a car it's a diesel rocket and value for money all competitors are in shock that how they are balanced his cars in competition of xuv 300 First time I feel that how a car look like a wagon and luxury on wheels", "Car is Good performance & Look wise great Maintenance is very low. Interior is good looking & milege wise super Fully comfortable engine is solid running wise good & price wise good.", "Great interior and comfort for driving. Very good. Silent in diesel variant. I like itz safety feature and interior design. Ground clearance is good. Value for money. Stylish look...like chetha....wooo", "Value for money. Mileage excellent. Interior is very good. Very good body balance. Sun proof glass is additional good feature. Very much satisfied with this car and its features. Love my mahindra xuv300 very much. Thank you Mahindra for launching affordable dream car.", "Xuv 300 is very gud car.best in class.car interor was so good and if comparing with breeza also its very gud option i think.great look with very good performance safest car in the low budget", "", "It's a amazing car smooth driving it's a wow experience and looking awesome and its my dream car I want to purchase this car and I want to long drive this car it's adventure car mind blowing.", "Good l like it performance this pasce is propper good loking like a chitta this is good boot space good disc break front and rearre amzing future good qality satlish dech bord goo", "Looks fabulous.. seems like a excellent work by mahindra. A comfortable car... Valuable price for this type of suv... After launching this car Mahindra is giving tough competition to other companies like Hyundai, Ford.... A great job by team #Mahindra..", "This car is Mahindra complete suv making very special & secific interior is attractive & driving is very good and exterior very nice ground level suffficient for driving roads to comfortable mileage is better any customer Are satisfied in my contacts", "I have booked the car on 28th Feb at sireesh auto Yeshwanthpur Bangalore told it will delivered by 40 days,75 days completed no response the service is only till booking, don't ever try this show room ever to buy .I am waiting till date,for my beast. The car riding purfomence and look is super. Only problem is showroom.", "Perfect car for middle class people and it looks very rich and heavy no other vehicles other than Mahindra had this kind of free specifications and space easy and low maintenance.", "Wt a attractivE design of this car when i saw this lokd as a OD .. BUT i was wrong this i Small SUV ultimate design charming colours n design is making it Unique n dashing .. Lvlyy", "Car looking is very good and reasonble price I am also looking for for this interior good Colors is available features are very modern I will suggest for buying car to my family and friends", "", "", "Good looking and good comfortable and good avrage amazing ride and amazing filling that is not a car but that is a superb car what a car pick up and no any noise that's a good filling good ac.", "Best suv car and extra power and tork I am very happy with si so cool interior and extrariar most beautiful and powerful car suv 300 is best than creta and other car so I suppose to buy this everyone", "Nice car but their is one prblm rear ac vent are not available all this are good but non ac vent are preset at rear this only the demerit of this car otheriwise funcrion are upto expectations", "Buying experience: Firstly I saw this car in the Road of Allahabad. That was top model and It was like Love at first sight.\nRiding experience: Then one of my friend bought this car in Hostel and we'd many long trips on this SUV... This is so comfortable all the time and very much spacable.\nDetails about looks, performance etc: Looks from the front is just Amazing... The Back look I didn't like the most in Starting but now it seems good...\nServicing and maintenance: First service is not done yet... because it's Mahendra so we do not have any need to worry about the maintenance...\nPros and Cons: I love everything about this Compact SUV... I just didn't like the rare lamps...", "Riding experience: This car driving seat camfart feel and this seat moveable.\nDetails about looks, performance etc: Nice feature of the car.this car feature at least good quilty.\nServicing and maintenance: This car service mainteance in very low and this company service center near by service center.\nPros and Cons: This car my thining about love this car. And porches him.", "Buying experience: When I see this car on Carwale* Advertisement I want to buy this car. After a week I purchased from Mahindra Showroom.\nRiding experience: With the Xuv 300 my experience is very good.\nDetails about looks, performance etc: Their look and performance is too good and Black piece is too good.\nServicing and maintenance: About the service I can't say something because I have not needed to service my car.\nPros and Cons: I personally love this car and Mahindra's Service. I have also purchased Thar and Bolero from Mahindra. Their performance is also very good.", "First of all congrats to Mahindra to get into this competitive segment. The options for buyers are plenty here (we are spoilt for choices ). But the experience of driving this small good looking beast was awesome. Good powerful performance combined with great looks makes this car a winner in this segment. Remember Mahindra has a very decent and competitive service and maintenance cost. I wish this car all success", "", "Details about looks, performance etc: This variant is value for money", "Buying experience: Buying experience was very good.\nRiding experience: Awesome ,premium filling, complete SUV\nDetails about looks, performance etc: Excellent , in simple word Pehli Nazar main love ho gaya\nServicing and maintenance: Too early to say since first service was free\nPros and Cons: More features can be added in W6 price", "I have taken this ride with my friend for a short distance, what i observed in xuv is that xuv have a Good Pickup, Excellent space nice look and smooth drive. Would suggest to people who are likely to purchas first take a ride of this xuv.", "Xuv300 is best in their segement and it's a option for creata. Features and power of xuv3OO better than the breeza and eco sport. Amaging experience of Xuv300. Go for it if u plan compact suv in their segement. I love it.", "Details about looks, performance etc: Nice looking, awesome, excellent", "This is one of the best suv in all competative automobiles .... full features and look wise is very good rather than other,pickup is more then scorpio comfortable seats and space ...", "The brand new XUV-300 is a ausome car. This time mahindra has competed a huge in the market. When i drive this car i feel a fully sporty experience and this is the best , classy car among all the small SUVs. It has a beautiful \"Panaronic automatic sunroof\" which makes it more extraordinary look. I love it too and \" LIVE YOUNG LIVE FREE\"", "", "Riding experience: comfort and smooth drive best price and good speed", "I didn't drive this car But definitely buy this car when ever I have fund's. I love this car very much specially front look..it's interior design awesome, interesting features, powerful engine.umm ha", "This car is woth to buy . Features are amazing , in budget too. The looks are stunning and the tail light is given an amazing look . I had a riding experiance of this car . It is very much comfortable inside . The infotainment system looks dashing with dual tone dash board. I love this car in its 1 look .", "Buying experience: Very good.\nRiding experience: Very good.\nDetails about looks, performance etc: Very nice look and performance.\nServicing and maintenance: No problem.\nPros and Cons: Best.\nNANA", "This car in range price car beacuse some function, which are available in this car; are available in high prices cars. This car is also buy by all types of people. This car's look is high prices car like audi etc And this is the best car for middle family And it has comfortable also and very functional car", "The stylish exterior and performance make this car a great, and also it price range great . All-rounder car , comfortable seat all this have in this car make it different from other.. Mahindra known for it car and they proved once again with this beautiful car.", "Superb, it's amazing for me, as per my need as well under my financial limits... Look as much as good...once you see on the road ,you can not able to change your sight.. Interior is fashionable, comfortable,give you luxurious joy...", "The car is amazing and the features are also excellent. I feel comfortable when i drive this.the space is also more so that i can go for a ride with my all family. I recommend everyone to buy this car", "", "Buying experience: Options were very clear, either it was supposed to be Tata Nexon XZ+ or XUV3OO W8 (O). Though prices difference was huge between both vehicle. the NVH level with the ease of driving around in city or at highway is just effortless. Second, main reason to choose one over the other was the backseat comfort. Both vehicles are same at back but Nexon seems spacious at back but the suspension of XUV300 does its magic to make ride comfortable at back seat for passenger. Also with its boxy design XUV suited more than Nexon for a 5'11 guy who is big.\nRiding experience: XUV300 clearly holds the trophy in this area. As noise cancellation is very good, one could hardly hear the road or engine sound. The overall visibility is great, in Nexon the A pillar is a big blind spot which needs to be worried about while driving in crowded area. Nexon disappoints with the engine and road noise coming in a lot.\nDetails about looks, performance etc: Both vehicles have their unique design. Nexon has much youthful vibe to it, XUV300 is more of a afford luxury compact SUV.\nServicing and maintenance: Have just both XUV300 so not much to say. But with Nexon people whom I know are happy maybe little, as service charges are less but you would be taking Nexon for service every one or two months.\nPros and Cons: Nexon is a very rugged car, you can abuse it madly and car will still be with you in the long run, that is what Tata is known for. Long lasting cars. Whereas, XUV300 has just blown my mind, never thought a car this affordable can be so luxurious. A person who wishes to get Mercedes A class, should buy XUV300 and save some serious cash.", "Game changer in sub 4-metre SUV segment. It looks excellent from front with sabertooth like led DRL. The car just takes off and has the power to push you back against the seat. The layout of dashboard is clean with good fit and finish. The backseat is a tad firm but offers excellent support and is well positioned for long journeys. The suspension setup is excellent and absorbs most bumps on rough patches of road. This is an excellent vehicle throughout.", "Buying experience: I just normally search for the cars ..and I go to the carwale.com . It was nice experience. I got everything about the car which I have searched.\nRiding experience: Comfortable and relaxing.It was just an mind-blowing.\nDetails about looks, performance etc: It's exterior look is fabulous.and inside is also .\nServicing and maintenance: Service cost is low and quick service available.\nPros and Cons: It is just a fabulous car I prefer all my frnds to buy this car .no bad point", "Nice car and value for money Nice engine compatibility and it has smooth road functions Interior is very good and anybody will love to drive these car CR has sportive looks and belive manufacturer will some more additions and modifications in coming days", "from carwale .com i got preview of this car . car is fulfilling my all expectation so i want to buy this car in future ASAP. thanks to carwale .com to give me all about this car.", "Best car ever in this range best features and other ....love this car.......black....top......model.......w8(O) mahindra love this company and for and voice command all the features are best not best excellent superb .... First in segment...... I love this car ........ And service is not costly .....and again love you xuv300...........", "The Mahindra has brought a mighty competition in the market at its best and innovative way .The overall front look is just phenomenal . The power it has got is outstanding . Its a perfect attention seeker", "I purchased W8 petrol \"pearl white\" colour XUV300 on March 29th in one of the showrooms of Automotive Manufacturing pvt Ltd at Hyderabad. As usual being a new and high demand vehicle I didn't get any discount or complimentary from the showroom or for that matter from M &M. I almost drove this car for 600km within couple of days after purchase and I really amazed with its performance and pick up. Initially I have some doubts whether 1.2L engine will have that much claimed power and pick up. One can feel the safety and it's sturdiness while driving this car. Steering, clutch and break are well designed and very smooth, effortless to handle.One movement of time I thought of waiting for auto gear transmission (AMT) but after driving this car i have no regrets with manual transmission vehicle. Mileage also to my my surprise 15.6KM/L before first service. Trust me I really enjoyed its pick up and drive quality, I drove on the NH7 with full seating capacity with 100km/h, no jerks so stable. Being a petrol car no noise,and its a/c is also good enough in the hot summer (40degC). External looks are superb however internal things need some modifications especially white interiors are not so attractive moreover maintenance point of view also not a good choice. Not yet gone for servicing so I don't know how service costs will be for this new vehicle.Overall,well designed and nicely equipped vehicle with lot of in built power boost so one can enjoy the riding of this rock star. PROS: Power,drive quality, external appearance, wide range wheel base, mileage, safety features. CONS: Interior color choice ( white), boot space, cost,", "", "It is really a wonderful car it is good in less prize and much comfortable for me to drive and in experience in driving.I thanks the company for manufacturing this car.Even it's looks is good one. Thank you.", "Buying experience: I have to purchase Bolero..as seen finalized this\nRiding experience: Well... inner side Spacious & comfort sitting\nDetails about looks, performance etc: Nice..well performed & Good look\nServicing and maintenance: Best.. immediate respond & proper service\nPros and Cons: Over all Spacious & Comfort feelings with all family members with one doggy(Shiro)", "Excellent....Amazing superb At the time when i sight this vehicle i thought this vehicle may be good but at the time when i sight red and black colour n her features and performance... i would like to buy this xuv 300. Awsm good excellent", "Buying experience: Gonna by in next week. After seeing all the interior, exterior and performance of the car , Am gonna buy this without any objections towards it.\nRiding experience: Awesome feel with comfortable zone..\nDetails about looks, performance etc: Looks very good wid new design using head clamp, performance while it's crazy...\nServicing and maintenance: It's quite nic... If u come to service wise you have easy way to do it...\nPros and Cons: I love the exterior as well interior work done wid dis car...", "Amazing look and premium features. it's new sensation as better than brezza and same feel as creta. i love the design of this model. mahindra known for strong body and manly look. its good semi Suv with more proroties over brezza and tata nexon.", "Best suv under 15k ,riding experience awesome with comfort and style....One thing I want to say that mahindra takes 1 lakh extra when compared it with its rivals , but overall experience is good", "This is very amazing car. Had an amazing riding experience. Look and performance is very good. This is very nice car. I love this car. I love driving because I have a xuv300 amazing car.", "Very very nice experience to see xuv300 car ?? iam very happy to test drive thanks for your support very very nice I wish xuv300 for great success", "", "This Is what ....where my serach ends..Top Features both exterior and interior...Love To Ride..Soulful Sound Of Music..Never Ever Tired of Ride...or a long long driver..always Comfortable", "this is veery nice xuv car. this is compaire car of creta. and low prise. nice.i like so much.. realy it's a verry nice car.it's milage is so good. and look is verry nice.it's body is good", "It is a terrific SUV. Mind Blowing pick up. Just accelerate & feel the power punch. Looks will definitely catch people's attention. Day Light LED in L shaped is amazing & give a distinct look. The cabin has good insulation & you will experience very less engine noise. It can accommodate 5 adults easily. The Boot space seems a little less & not ergonomically designed & cause a little bit of discomfort while keeping heavy luggage. you can enjoy weekend offroading also to some extent. Overall very good SUV & will definitely meet people expectation. Mahindra. Hats off to you!", "Buying experience: Good its a verry good experience\nRiding experience: Its very heavy weighted cross over in the segments so riding quality is best\nDetails about looks, performance etc: Its 1.5 ltr engine its give 300 nm tourq\nServicing and maintenance: Naturally mahindra give low cost of maintenance\nPros and Cons: Car is very shapely and its very muscular shape", "Mahindra TUV300 this is best car which we can choose it is comfortable to drive it is the profit to buy the car it is XUV model designers power engine capacity is nice to performance good and interior ,exterior is good low maintenance car Tuv300 good", "Nice SUV Defeating creta brezza according to performance ,price, technology n looking..................... Amazing company amazing compact SUV...I wanna buy this with in next 6 months ..", "This SUV looks aggressive with it's front design and roof rails. Interior is luxurious. Only it needs a rear AC vent. It is also safe to drive. It also has a sunroof, which is best in class and superior comfort. Alloy wheels give it a gorgeous look . Good to buy in comparison to vitara brezza, creta and wr-v.", "Buying experience: Nice car and good buying experience\nRiding experience: Excellent car for riding and long drive\nDetails about looks, performance etc: Nice look and excellent performance\nServicing and maintenance: Good servicing and no maintenance\nPros and Cons: Good car and I don't hate this car", "The car is full loded like rang rover Everything is fully laded like mirtor seat lock And something new in this car The sunroof is very nyc to open and shut like creata This is future car", "It's car looking is very cool and future are very amazing. I I like it this car. But price costs is some things minar high. Only 1 lakh minar high. It's car is very amazing.but may we if car wheel basd is 18 so car very amazing", "Buying experience: Low budget all requirement covered in one car\nRiding experience: Ground clearance good height is great Riding like float in sky very smooth\nDetails about looks, performance etc: Look wise same feeling like xuv500 Great performance all things required for long drive or comfort wise great car\nServicing and maintenance: Mahindra car always low maintenance car but servicing in all over country", "Buying experience: I am not yet..but I SURLEY BE BUY IT AS SOON AS 0OSSIBLE.\nRiding experience: Great fabulous....mahindra done a great job.\nDetails about looks, performance etc: Nice look and good performance.\nServicing and maintenance: Easy service and low maintenance.\nPros and Cons: First in class dual zone climate control less boot space.", "Ultimate car with heavy suspension.. good millage.. restless drive.. best beaks game system.. affordable price.. in small words we can say it’s a smart car in reasonable cost.. I just love it.", "Best car in this segment. Service cost is normal not very costly. Nice looks. Pros : best in class features and engine. cons: very small boot space. No rear ac vents", "Best car in this price . But spare is low after that it is best car in this segment and best look used for all days in weak better than Vitara brezza and its value for money and perfect in this segment and also best in segment", "Buying experience: Nice looking nice interiors well exelration\nRiding experience: Nice riding suspension is very good\nDetails about looks, performance etc: Nice looking exterior and interior\nServicing and maintenance: Nothing problem all things are good\nPros and Cons: It's costing to high because every one needs a car", "", "Buying experience: I not buy it yet buy i want to buy a new car and when i seen it i shall buy this. This is a stylish car.\nRiding experience: Nice experience while driving my sister buy it and it was good\nDetails about looks, performance etc: The features of car is very good and main feature is back light\nServicing and maintenance: The maintainc is low and i prefer you to buy white colour\nPros and Cons: Sunroof, back light ,front light,etc", "Buying experience: Good and easily buy with showrooms\nRiding experience: Amazing and good driving experience\nDetails about looks, performance etc: Good looking car & good performance\nServicing and maintenance: Easy to excess & cheap maintenance\nPros and Cons: Over all good and comfortable and spacious", "Riding experience: Its Amazing to ride this SUV. It’s such a Beast on the roads.\nDetails about looks, performance etc: Best car in the segment. With some new features. Performance is excellent.", "I like this suv so much because it is boss of all suv it's shinning body can attract everybody towards itself and the drls increase buety than another cars xuv300 interior is ossom all the leather seats and light outside make it more attractive than another suv the car contain 5 people's at a time comfortable I like I like this I like this suv I like this suv so much I I thank to mahindra to make this ossum gorgeous and beautiful suv.", "Its a good model from mahindra with all saftey feactures and all well equpied car With comfartable interior. Powerful steering and lovable colours of Likable style and dlrs lamps", "Its looking great this car cost is buy enyone i decided to buy this car i have alredy mahindra products (scorpio) i m try to drive new product xuv300 &looks very good with sunroof his performance looking good", "Buying experience: I got this car with some wait,but overall experience with this is amazing,\nDetails about looks, performance etc: Beautiful and sexy looks,and amazing DRL", "Buying experience: It's journey so incredible for me\nRiding experience: I feel absolutely fine for this\nDetails about looks, performance etc: It's look are rich and performance it's good\nServicing and maintenance: Servising nessecery about car it's good but\nPros and Cons: This car not for hate I 'love this car", "", "", "It is a very good Cross SUV for the year. It has a very good diesel 1500 cc engine. Good pick up & great driving pleasure. Stunning look with new front design of Mahindra. Lower maintenance & cost effective car. LOVED IT.", "Riding experience super and comfortable much better Amaze and pick up too batter than honda Amaze 2018 model and this price segment such a cool ?? car .plz buy this car really super", "jisse better kuch nhi wo he xuv3oo. performance nice. good look. excellent driving. kami ke name par kuch nhi. ye he hamari xuv 3oo. jisse jyada pane ki ichcha na ho. road pe lagate hue chalana huner he iska", "I have one side live with XUV300,it's a very amazing car,and I'll get it in just 4months,pearl orange color XUV300 car,it's very amazing car,it's interior and exterior model is really amazing,I'm just going to get in 4mnths,it's my big goal and 2019 first goal,I'll buy XUV300 Pearl orange color,it's speed and it's color attract me alot,it's interior is very attractive,I love XUV300 alot,I'm gonna buy get it", "The XUV300's value, practicality and SUV quotient aren't its main attractions. Its indulgent packaging, sense of solidity and fun to drive nature are, and will impress you enough to tempt you to open up your wallet a bit more for this Mahindra. Pros Overtaking on highways easy, thanks to punchy diesel engine. Stable and fun to drive because of steering and good grip. Comfortable even over bad roads. Feels premium because of class-leading safety and convenience features Cons Cramped footwell, no space for dead pedal for driver Not the most spacious or comfortable backseat in the class Premium experience let down by quality issues like poorly fitting panels, mushy switches and flimsy stalks. Small boot will be a hassle if it’s the only car in the family", "Riding experience: Just Wow.. Never thought Mahindra would put out such a well rounded package. I have driven Honda Brio,Hyundai Grandi10 & Ford Ecosport before this and this one beats everything. After 1800 kms and 2 road trips, this car is the most comfortable but thrilling thing on road, loaded to brim with comfort and safety features. Never expected such a beauty from Mahindra.", "Buying Exp:I Was Very Happy to Buy this car and have a very Lovely Journey. Riding Exp: It Like i am flying in air .Details about looks,PerformanceEtc : it Tail Like the eye of Tiger , it has sunroof which give me fresh air , its amazing features make happy ,etc.Servicing and maintenance: Till now no servicing and no maintenance .pros and cons :very nice.I Love Mahindra XUV300 1.5 W8 Because Road on Fire.", "", "I had a test drive recently -Amazing driving supports -driving experience will give u awosome -Vehicle in this range having sunroof amazing -small functions unbeatable -speedy on ur fingered -Looks Nothing like on this range -various mode of drives gives u a sporty touch -top end a varient optional gives only all these", "Buying experience: I want buy this mahindra xuv300 new model i like it\nRiding experience: Feel very comfertable.soft driving\nDetails about looks, performance etc: Good performance.i liked those lights and roof.\nServicing and maintenance: Very help full to mahindra servicing and maintenance\nPros and Cons: I loved those lights and car's sun roof loved it", "Buying experience: Nic car Comfortable Useful Soft drive Family car\nRiding experience: Feel too comfortable for drive\nDetails about looks, performance etc: Look is too good against price\nServicing and maintenance: Maintenance less car powerful parfomonce\nPros and Cons: No things to hate xuv300 just love too much", "Compare to same compact suv the xuv 300 will be the best in segment and overall performance of this vechicle is too good. And the cabin and back seating with 3 members is very comfortable with around 5.10 tall height", "Buying experience: Yah afcous I want buy this car\nRiding experience: Very Smoth & very comfortable.\nDetails about looks, performance etc: That was amazing & wonderfull.\nServicing and maintenance: Better then maruti products also\nPros and Cons: I don't have any words say about this", "Look is amazing specially interior also exterior. Performance is awesome you would love to drive and handling is also good. A great package to worth your money. Diesel engine is little bit noisy but it's okay every diesel engine does it so doesn't matter. Value for money ...", "Powe and pickup is superb. Safety with 7 airbags and esp/abs give you more confidence while driving with your dear ones. Like Hill start assist and the front parking sensors kind of features keeps mahindra ahead from the others.", "My good experience xu 300 Riding experience good Buying experience I should Look is fantasy Performance good Service fine. Ziro mentioned Loolwise good car. Iur best choices. Xuv3oo", "", "Aswme ride nice handling comfortable look is pretty no noise sudden pick up mahindra launch nice model in medium range with comfort in all thing space design look comfort sitting tyre", "Buying experience: It's a amazing car and I will buy only this car on the occasion of diwali\nRiding experience: I feel enjoy full and a piece of mind and rest full\nDetails about looks, performance etc: Amazing and intelligent smart look and gorgeous design and perfect performance\nServicing and maintenance: Nice and superb in service no maintenance for a smart family who is using with interest and intellectual intelligence\nPros and Cons: Fully safe car for a family in a middle class era and nothing to worry or hate", "Buying experience: A car anot buying but a purchase a just few months\nRiding experience: Bahut achi riding hai super se uper\nDetails about looks, performance etc: Best looks in another company car\nServicing and maintenance: Mahindra apne customers ko achi service deta hai\nPros and Cons: Exllent performs in mahindra cars", "In this price it’s a great option to take feel suv.more comfortable then breeza eco sport n many more.very good n great car.price is very very geniun.feel like perfect suv its very good", "Buying experience: I am thoughting this car to buy because i had many compare many cars . its intereior and exterior is really amazing better than tata nexon ,brezza.\nRiding experience: Its really amazing.............\nDetails about looks, performance etc: In this driving experience was really amazing its seem to be a driving a expensive suvs like bmw ,audi.. its interior is very luxurious ....\nServicing and maintenance: Good................. ........\nPros and Cons: Pros -its exterior and interior desing Cons- null", "In the very first look, this car is actually got head turning design. 1st customer in chandigarh to buy this car. Tested this car thoroughly on plain and hilly area. Riding is so smooth and so comfirtable that you couldn't ask more. Feature packed car with power like a beast.", "World's best XUV CAR Mahindra. XUV 300 Thanks Mahendra Good fecher and good safety air bags and good contat this car I love sunruf And good sounds system and fechers Looking good interior's and external", "", "Good to drive, best feeling while driving without fear of any small or big ditch on road but mileage is hardly 18 KM not 20 KM..overall best experience to buy and drive... Good job done by Mahindra", "Buying experience: I am planning to buy this car within few months\nRiding experience: Riding is awesome don’t feel any jerks while driving on rough road\nDetails about looks, performance etc: Looks like you are driving a Mahindra xuv 500\nServicing and maintenance: Not driven so much to calculate maintaince but I am sure it will surely give you less maintaince as compare to others\nPros and Cons: You have to do some changes in interior in", "I brought this car on 25th Feb 2019 , Initial I had umbers of apprehensions but all have gone just after driving the car . I have purchased w8 petrol version , engine is superb , excellent power and speed . Smooth gear shift , zero noise in cabin, lots of features . I have already completed 500 km and highly satisfied wit the product . the only thing I would like to suggest you that choose good dealer with experience executive otherwise you may face issues like unsatisfactory demo of the features unprofessional accessories installation ,", "the car is price low best car for travel best and excellent comfort i was attracting to its exterior i am was real shocked about performance of car it is really best and nice to buy", "Wrath full car W6 model is amazing feeling value for money every thing is wonderful about xuv300 w6 is best of value for money after this car 1 more car in this segment i love NEW Ford ECOSPORT is on 2 no don't by XUV 300 W8 series this is not value for money wrath less M&M do good work on this model", "Buying experience: Buying this model next month for my wife gift\nRiding experience: Super in highway and coll driving\nDetails about looks, performance etc: Excellent look.. Nice interior\nServicing and maintenance: Too good for long life and super maintenance\nPros and Cons: Love to buy and forgot your old one", "This is osm car. And it looks very nice and effective and more comfortable. I drive this car its very smoothly run. more colors are available in this model. all colors looking so beautiful.", "I was waiting for the xuv 300 since it is well equipped with lots of features and the build quality of interiors is just outstanding. I m a big fan of this suv right now. I just love this car??????", "", "It is nice car with many features so you should buy this car I am driving it from many days I like this car so much if you buy this car you are the lukky person so very nice car with five star review", "I am ready to buying Mahindra xuv 300. I have done test drive feel very safe . Look is fabulous, four wheel disc give more safety is compared to other two wheel dics car . I am happy n ready to buying a new mahonda xuv300 . Thank you", "Very good car its exterior is amazong and sunroof is also available in this car love it And it is the top SUV car and it's price is amazing So i would be proudly to say that you must purchase it", "Very nice car osm pick up looking is so good u perches a xuv 300 setting is very comfortable and butt ispace is high . Mini Xuv 500. . . . . .", "Detail about looks ...xuv 300 is best car it has more space and the milage is the best thing about the car...we also hv sun roof best car and comfortable ...soo i suggest you people to buy these car", "Its been soo long since i've bought my car. And its looking soo new and fine till now i love the interior and exterior of my car.. its best for this price.. its cheap and comfortable", "We are Happy to buy this car. Till now we are not facing any issue. Interior and exterior are good. Pickup is good. Engine has little noise , when speed goes up. Overall , value for money, as compare other brands.", "Low budget and full function this car is very good and trust to Mahindra style goods and colour options is very good my best car family car Mahindra is Mahindra and mahindra best car 2019", "I need to buy a xuv3OO it's so amazing and special future availability, I love and like so much my month I buy this car loveit I given a rating for out of 5to5, One special future is 7airbags it's so amazing and special", "It is a nice car. I like this car because of its look and mileage. As compared to Xuv500 Xuv300 is also nice and can be taken by many people. I like this car because of its interior features.", "I liked most about its brake what a control. Goid engine very silent dngine and very smooth. Goid puckup at 1500 rpm. Very refin3d engine from mahindra and its value for money w6 model i liked that model my next car is xuv300 .if god grace. It will be my next xuv300 my FAMily car.", "Awesome car, very powerful engine to drive, best safety features like 7 air bags, four wheel disc brakes etc. And many more first time used features like front parking sensors, heated side mirrors, dual climate controls for both driver & Co driver side. I loved this vehicle & feeling proud for decision to buy this vehicle.", "The Mahindra car xuv 3oo is good car but space and fuel average is very difficult and space is limited but engine power and safety features loaded car new is rear sencer and ac is powerfull service is20000km is good option the car good will be cumfort long drive", "This car is realy awesome in many of the cases such as style ,comfort,luxor,etc..Price of this car is also not to much and its a paisa vasule deal and has stand up on my expectations .Thanks for reading.", "This is a very budget car feeling like xuv 500 nice experience. Bhut achhi car ha ye please buy and enjoy your life.. This car is also very safe and having many airbags... So my overall experience is very good.", "One of the most stylish cars in recent times.. New buyers go for it.. Looks, Efficiency, Performance, Rates, Class, Everything is perfect... Well planned and executed by engineers.. I am too going to buy the same and will recommend it to by nearest and Dearest.", "It's a wonderful car.. I love this car very much.. Amazing performance while driving.. The features are superb.. Very smooth engine.. The quality of interior is good. Front design design, rear design, dash board, instrument cluster, especially DRL's are ultimate.. I prefer the car.. Before buying Ecosport or Brezza once you can drive this you will know which is better.. I hope everyone will prefer this \"XUV300\"", "This car is fabuless osm car i had just but it nad enjoy fun from this car this is absoulitely fantastic and black colour was osm in this looking gpod good fantastic mahindra wan an superb dealer to launch this osm piece", "Really reached our expectation, worth for money, interior and exterior is so attractive , if I get exchange offer for my old one definitely I will buy this car... All the best mahindra, India....", "Its a best car in his segment and full value worth car.Its amaging with this price and with so many feature. Its exteror look is nice. Drive mode option is good thing in this segment and Engine has good power.", "This is my dream SUV and one day I buy it surely I can't wait for this long time I am eagerly waiting to purchase this SUV Mahindra is always awesome and this is the best compititor for all SUV range at this price also creta is most expensive the features which provided by Mahindra is not given by creta at this price....", "i want to buy a suv car bt i dont have bugget bt when xuv 300 comes its complete my all expectations thats really a vry gd suv car on its segment this is vry smooth car its look iss really osm", "Mahendra lounch the world best car I buying this car hurt. This car interior is very just. Fecharseare also good and new, this price are also not believable I advice all parched this car", "I was driving this car arroun 50-60km. It feels like a driving rocket on road. Especially that Orange color is just Awesome. 300Nm torque is the Thumbs Up moment. Build quality is very brilliant and strong. Full of amineties no option for this car, Somewhere Ecosport will cross here but not all time. Big brother of TUV OR sister of XUV500", "I bought it for 13.25lacs for w8 petrol Features like passenger airbag, hill assist,rain sensing wipers, Cruise control ,key less ,leather finish interior. I like the most was led lights on front Cons Spend lot on front Cut lot of cost from behind to make it sub 4m", "", "Most awaited car finally arrived and best in it's class in terms of money value amazing look specially back side and comfort feels good in real sense it's young generation car live young live free", "This car is the very best budget car and against to Vitara brezza and Tata nexon And I like this cars Mahindra XUV3oo 8 version in diesel all features are very good excellent this is the most beautiful car launched in India by Mahindra and more many colour option with this car I just get a test drive Quickly.", "Owsome car . Safety no. 1 car. Cheetahs designs. Owsome pick up. Owsome braking power . Gorgeous interior. New technology. Comfortable seats .Comfortable leg space. I love this car.dual zone climate system. This year this car take no 1 position in safety features. Powerfully engine ..................", "Great car with awsm look and heavy engine lv it height look space comfortable better than barzza creat and eco sport looks good and bootspace not show in features ?? I plan to bye xuv 300 as soon as possible . Also have eco sport 1.5 but I think xuv 300 batter than eco sport . All features are great I love it", "Super excellent Mahindra XUV 300 w 8 diesel vehicles super colours super vehicle design super Mag Wheel fog lamp headlight mirror indicator reverse camera 7 year back overall Mahindra XUV 300 w8 vehicle super Amazing", "Value for money , compact SUV, with sun roof 6 speed transmission , superb sound system, trunk space is low , tyre pressure monitoring system good price efficient , good mileage , dual tone colour , 7 airbags", "This car is very amazing . It has failed to Vitara Brezza this car is perfect suv for a small family. This car has osm speed and comfort to sit driving control of steering wheel is confortable.", "all very good it's a kind of a future car. I will definitely buy it in some time very impressed with Mahindra. hope ill get it soon.\nNANA", "I like this car because.. stylish.. car and... full.. feature this cas i like this car. And. I want this car and mahindra company is also believe it... nd more think.. fabouls.. this car red colour so wonderfull colour... and.. ab kya bolu yrr bhut h y to and.. amazing superb car ab to bs chahiye y car", "Best car i have ever seen.this is my best car.when i drive this car i feel like king.this is the very stylish car.car have a huge power....mahindra give a best car for people.this car feel like rang rover", "It's totally awesome in this price all car's like nexon brezza and more look is good and dual zone temperature and memory and more thing stering mood to cool Overall car is 10 on 9", "The car looks much more sexy in real... Loaded with a tonne of useful features. Would have done with a bigger boot. But... Thumbs up to Mahindra for making such an exceptional product.", "Mahindra SUV 500 best SUV in the compare of other SUV as rate 1500000 Mahindra SUV 300 is the best SUV competing vitara brezza and Hyundai certa. Price are also super. Perfect SUV", "Riding experience is very good and car is amazing look and driving experience i suggest to all once visit Mahindra Showroom and look new xuv3oo , perfect suv in this price thanks Mahindra for launching this fantastic suv", "The car is most likely and beautiful. It is superb from exterior and interior I love this car . It is amazing and this car also give best milage if you have to buy car then buy this car ......", "Riding experience was so nice & great enjoying by myself to take a short drive of this car. I have first time drive Mahindra manufacturers cars in my life this was the great enjoying by myself", "Power, look, safety all things awesome . I love this one. a safer car in India launched. look awesome.interior design.lovely.exterior.high star power performance.more & more\nNANA", "This car is based on ssangyong Tivoli Rebadged by mahindra and named as XUV300 XUV300 rated 5 star in KNCAP Which happens to be Korean NCAP This car meets all standards In this you get many segment first features Like 7 Airbags including Knee airbag Dual Zone climate control Front and rear parking sensors Proper seatbelts for all seats with reminders Steering feedback selections in 3 modes Electric sunroof Heated ORVM All 4 disc brakes Auto dimming rear view mirror (IRVM) And many more..... The powerterrain on offer is 1.2L Turbocharged petrol engine with massive 200nm torque and 1.5 Marrazo sourced diesel engine with 300nm torque. The NVH levels are adequate Front seats are comfortable but rear seats comfort is lacking . Infotainment on offer is good with apple CarPlay and android auto. On front you get projectors setup with LED DRL With Fog lamp . Rear you also get LEDs with wiper and deffoger . Air conditioning works well on this car Mileage is also descent you may expect milage of 12 kmpl for petrol and 18 kmpl for diesel The car less frugal than competitors Pros- Saftey is on Higher side Powerful engine options Good handling and ride quality Value for money Cons-Less back seat comfort Rear ac vents are missing Less boot space Milage is less than competitors .... Conclusion - If you want to buy then Go ahead this will never dissapoint you", "It's fantastic car, good looking and featurestick, it's mileston for the Mahindra, really set on the fire, it's look like a small xuv 500, wheelbase2600 like a next generation car", "Amassing car and best of the suv segment and also best drive and comfort and best controlling best width and best engine powerful but some noise coming in cabin but all over the best", "Very successful SUV version and very luxurious. I am very poor people but car loan is available I buy the Mahindra SUV 300. My friends are very happy and well come.the greatest gift from my Mahindra.\nNANA", "It's amazing car ,it's experience is unbelievable , pick up and interior, any extraordinary features which beats the other car. Thanks mahindra....for such type of good car for indians.", "This car is game changer to car market.. its like a pre loaded ak-47 after long time i have seen a beauty with brain car...... its rock i say to all other company our car model are out dated mahindra xuv 300 are right choice baby..aahhaa...", "Best features in segment....value for money compared with Hyundai creta.. performance was very good but one thing cons is sunroof is little back it has to be on little front..after this all is good in this segment..", "This car looks mind blowing and comes with a lot of features like reverse camera with guidelines , keyless go, and there are many other features which are first in the segment. The driving quality of this 1.5 engine is supremely great There is no laking at mid-range and quite good at top speed. This car is mini xuv 5oo. It is a cool car, design of this car get full marks. It is great to buy this car which gets lot of features,at price . At the end thanks Mahindra for making such a beautiful car at this price range.", "I already planned to buy this car in coming couple of days, its show through advertising that its really a very good value for money car, exterior and interior is really feeling to fall in love", "It's new generation car for Indian segment if the people who are passionate of all needs with luxurious. Economic price with comfortable fuel efficiency to drive and live long, long live", "XUV 300 is like a little SIS of XUV 500 ! I cant imagine ...mahindra made very compact stylish SUV -MARUTI BREZZA too to GYO ! Great Styling , Good Dynamics , Interior is attaractive and aerodynamic OUTER !", "its nice in all aspects .... new look of mahindra car XUV 300 is best for short family . nice in driving aand suspension also. its lovely car . we would like to buy again it for my Friends.", "It's a beautiful car having advance features in this segment of SUV which is sub 4 meter inspired my xuv 500 and also available in petrol version. Its suits to new entrants in terms of its price"]}