{"0": [], "1": ["The suspension is bad. It makes a thudding sound even on a small pothole. The automatic gear shift is smooth and without lag. The boot space with third row seat up is so small that it wont even fit a cabin bag. You wont get a second key on delivery. They make you sign a declaration for it with a promise to provide within 4 to 6 months. This is not mentioned by the dealer before the time of delivery. Not mentioned anywhere by the company.", "Firstly the sales men were least bothered when I entered the premises ( palace cross Mahindra Bangalore ) . It's my first time driving a Indian car, all my life I've been driving Volkswagen and Skoda. And let me to you the build quality is pathetic. The doors are so hollow and light weight. The doors on my Polo is much stronger. Cars like T roc are much much better in terms of build quality. XUV 700 is just for people who need a car which has diesel engine and is big and bulky doesn't matter even if it's made of cardboard. Very disappointed with what Mahindra has done. I'm not someone who goes for the long list of unnecessary features when they've compromised on the build quality and driving dynamics. Yes it may touch 200 km/h but on bumpy Indian roads I'm very sure it's going to have loads of body roll ( based on my test drive ). I don't want to risk my family's life with this car. People who have been driving German cars regularly while absolutely hate this car.", "Was super excited for Ax5 trim, now super disappointed as it doesn't get even the bare necessities at this price point ( just sunroof and no push start, automatic climate control etc is a joke)", "Mahindra should have added one more variant, AX7 with 5 seater and all the features . No use of 7 seater option on long routes with little luggage space. Positioning of Mahindra logo at the back looks untidy. Awesome interior across variants. Fog lamp housing should have been crafted in a better way, as there is a space between lamp and body.", "Very impractical features are given and features which are very imp are ignored. Mahindra should have think about Indian roads. They just tried to give everything in one car which end up like nothing. Just a waste of money"], "2": ["Very long waiting period, currently the waiting period is approximately 1.5 years and that's way too long. Had it been on conventional chassis it would have offered better safety, especially for Indian roads and traffic safety has to be priority.", "Suspension issue refitted twice and Diesel particulate filter clogged after 6500 km run . Interior and exterior are good .power is good. First gear is hard. Mahindra news to review suspension issue and gear shifting problem.", "Went for a test drive of AX5 trim diesel model. In this price point of 16+ ex showroom where Mahindra is offering sky roof, imagine other basic features like chrome interiors and exterior engine grill is missing along with leatherette stitched dashboard, climate control and body colored ORVMs. Very disappointed with these petty cost cutting tricks by Mahindra. This is a big negative being discussed in the market. Hope they hear this loud and clear and make some upgrades in AX5 before rolling out.", "They should have AX7 luxury pack with 5 seater option, Slow initial pickup, average plastic quality, long drive may tired you, exterior is good, no push button for tailgate. off roading is perfect, huge car to drive in city roads."], "3": ["Very long waiting period, currently the waiting period is approximately 1.5 years and that's way too long. Had it been on conventional chassis it would have offered better safety, especially for Indian roads and traffic safety has to be priority.", "Suspension issue refitted twice and Diesel particulate filter clogged after 6500 km run . Interior and exterior are good .power is good. First gear is hard. Mahindra news to review suspension issue and gear shifting problem.", "No Extra Spare Key, Accessories Installation quality is Worst, Sales Manager will hide few Important Details like Extended Warranty Cost, Suspension is worst, from day One within 200 meter drive started giving sound from front & back side....Overall Vehicle is Good but Suspension is worst.... Mahindra will come out with some solution as of now they don't have permanent solution for same.", "I drove this car and realized few things. Car pickup is good as per the competition. It's interior is beautiful. Car driving experience is also good. Regarding Suspension I was very disappointed when I realized the quality of suspension of this car is not as per the price that is 27 lakh(approximate). When I was passing by from the speed breaker that time my car's speed was just 10-15 kmph and the car was noisy and I was feeling it's a big obstacle on the road. I'm giving 2 rating stars because of suspension.", "Went to showroom to check the car.Horrible experience with the dealership.No one was interested in showing and explaining things in a proper manner,expected from mahindra sales guys.Front and side looks were great,didn't like the rear look though too many unnecessary curves and cuts.Big size car but the wheel base is small,smaller than Hyundai Alcazar which is nearly 200mm shorter.There ought to much body roll. Engine options and power delivery seems great.Not sure about some ADAS features on Indian road, conditions like lane keep assist and automatic emergency braking can keep these features switched off. Mahindra has packed all the available features of a luxury car but once you are inside you can feel the low quality plastic and cheap and nasty finishings except the seats.Touch Screen was not very much responsive.You can't slide the 2nd row seats back. Piano black glossy inside door handles are prone to get scratches.No auto dimming IRVM,Really Mahindra are you joking.Auto pop-up door handles are very fragile and probably won't last longer. Lastly waiting period of 1 year, not worth. Though booked but will cancel soon.", "Pros: Good interior at most areas Engine and transmission options are available Luxury pack sound system Cons: Not a good looking car, dont expect to turn any heads. Not a great or classy road presence, hardly anyone will notice you. Too much electronics and unnecessary hassly door handles.Especially lower variants is a pain to use in night. ADAS is buggy and dangerous,already some cars are replaced so that news does not get out,but do not expect they will replace for everyone. Initial software and electronic issues, will be a nightmare to get fixed 3rd row not the best in class, so not a true 7 seater Ride quality not best in class Waiting periods Conclusion: In short lower variants are better value for money, but this is not a classy looking or a butch looking car, rather looks on MUV side. Can go for it if can digest the looks and niggles.", "Pros: feature laden car. Very good view of bonnet and road from driving seat. Blind spot camera is an excellent thing. 360° camera is best in class. Ride quality is very poor. Suspension are hard and there is no comfort while driving over speed breaker and pothead within city. Vibrations can be felt on steering. Staff: only know to deal people who by commercial vehicles. Not keen to promote the vehicle. Verdict: A jeep with cosmetic changes. Not for comfort ride while we compare with competitors (safari).", "AX5 model doesn't come with features like reverse cam, push start, cruise control, one touch window, steering wrap, rear hand rest with 60:40 seat split, it is a big cheat by Mahindra.", "Driving experience is good, price is high as compare to feature with other segment car. Mahindra should. work on price. Mahindra should add more classy and glossy finish design car."], "4": ["Amazing car Too smooth and elegant Looks are so excellent and its just wow!!!! And its features was amazing and it has adas which was really amazing and automatic breaking system and much more Haven't service yet It's really amazing.", "Great car great looks. Perfect on highway. Great performance from the engine. Good suspension. Good tech and equipment. Great comfort. Noise isolation can be better. Good service and support.", "Features like -auto dimming mirrors, ventilated seats, rear captain seats option, paddle shifter were missing. Memory seat function & Instrument cluster is too good. Overall good package.", "In short its a car that you may be searching from a long time, do a thorough research, and you are going to love it in every aspect go for it. This bloody car will definitely amaze you.", "Buying experience good on Mahindra automobiles but and all employees are so humble and gentle. My driving experience is very good with this royal luxurious car this is so cool the airport mode is disastrous blockbuster Service i try few times this service on road by activate auto pilot model. Exterior is good but interior is royal fine looks best manufacturing skills there is no maintenance charges and all of them all the service are fine.", "Issues with suspensions not as expected as an SUV I haven't bought this car yet but I am looking forward to buy it. And the driving experience is like driving a beast in less budget then fortuner or endeavor and in the service of Mahindra is a bit delayed like really slow And again problem with the suspension not as expected as an SUV though I thought it would have been better I wish Mahindra improve to it.", "The experience when I was driving the car, the feeling was like soft and comfortable.The looks which they gave for new edition was really awesome.", "Xuv700 is one heck of a car. I have given a test drive for both Scorpio n and the xuv700. The car is such a good buy. I have booked the diesel manual luxury pack midnight Black xuv700. Scorpio n was good but xuv700 was a complete package I was looking for. From interiors the touchscreen the colour combination and the features have left behind other competitors on the market. The performance being the main subject is also the best in the segment. The suspension was so smooth and the power can be felt as soon as you step the gas pedal. Highly recommend the xuv700 diesel. The only cons is the fact that the delivery for the car is so delayed like it's almost 1 year. Otherwise this piece of Mahindra is unbeatable.", "Good suv for all types customer i am happy with this car because this is my 1st suv and experience with this outstanding really i love it i hope my review helpful for all customers.", "Buying experience from Mahindra was good, I loved xuv700 design but my concern was mileage , so I bought Diesel AX5 7 seater, after almost driving for 5k km, I am getting mileage of around 18+ on highway under speed of 110km/h, and didn't use much of ac, coming to looks its eye catching design with led attractive", "Positive: Mahindra XUV 7OO vehicle outlook is really good, the rear design is inspired by BMW X series, Diesel engine have most powerful in this segment, most of the luxury features are covered, ADAS feature is really helpful in highways, ground clearance is really good, In suspension they provide independent with frequency selective damping function, which is really helpful in bumpy roads, stylish LED headlamps, led tail lamps gives premiumness to the vehicle, 5 star rating build quality, Alexa and Adrenox connected features, torque converter AT 6 speed gearbox , really perform well Steering is very very light and smooth Negative: 3rd row is very compact, in this pricing segment Innova have most space in third row, Diesel engine mileage is good, but in petrol we can get around 7-8 only, In diesel engine we can feel the turbo kick lag and roar of the engine initially Touch screen is really good, But lot of software issues system errors are occurred, sometimes camera is not showing in display, sometimes display hang is there, luckily I doesn't feel the error in ADAS feature, AIR CONDITIONING problem also there in sometimes", "Getting Starting problem. Car some not started , again tried after sometime it get started. Otherwise fantastic XUV , Comfort, driving experience, Road appearance, look everything Awesome.", "Buying experience is as you all know it has long waiting time. Overall driving experience of diesel car is much better as I felt than petrol variant and diesel have better fuel economy. Some features are missing like 12 volt power socket in front and could have provided single zone automatic climate control ac otherwise overall car is good.", "Mechanically it's a very good car. Has a lot of pros. The Adrenox system has too many bugs though. But can be easily fixed by Mahindra via patches. The car looks significantly better in person than in pics. The engine is a gem. Slow speed ride over patched surfaces can be better. The ride is excellent at higher speeds. The interior looks really nice with the big screen and sun roof. Do note that all the plastics are hard plastics. The steering is nice and light at slow speeds and weighs up nicely as the speed increases. The seats are good and comfortable. The AC is adequate and cools the car well.", "The new XUV7OO is truly a phenomenal car that you can consider buying. The ride quality, comfort and performance are much better than you think that a Mahindra can offer. The technology used in the car is up-to-date. There are some features in this car like ADAS level 2 ,which are only available in limited premium cars, that cost a lot. The build quality of the car is great. Recently, the Global NCAP graded the car a 5-star safety rating, which is really impressive. If you are going to book a XUV7OO, know that you'll be having to wait for at least a year. This is due to the ongoing Global chip shortage. Overall, I'm impressed with the new XUV7OO.This car can fulfill all your needs that a car can offer.", "We want proper black colour in at least AX5 and AX7 variant and parking sensors and also the blind view monitoring system is little bit laggy. Please launch black colour variants.", "An awesome overall package , great performance and affordable availability of ADAS. The dash is super futuristic and has all the bells and whistles you would expect at this price point . The overall fit and finish of the dash is at par . The panel gaps are fairly consistent . The adreno x super screen is very fluid and responsive . The digital instrument cluster is great however, to choose the driving modes, there is no dedicated button or knob and can only be accessed through the touchscreen, except a little punch from the zap mode the others are a little gimmicky. The glove box is decent sized and there are quite a few places to keep stuff in. They have however missed an electro chromic inside rear view mirror offered in much cheaper cars . The driver seats are electrically adjustable and the front seat offers great support . For the second row passenger , there is a boss button to increase the legroom , nifty touch . It pampers you with a lot of goodies like 360 parking aid , blind spot assist , dual zone hvac , and a humongous sky roof to name a few . The second row space is decent , the floor being flat , easy to accommodate three people . The third row space is fair enough , not suitable for adults above 5'5 for more than a short trip , but folding them increases the boot space by an awesome capacity . The boot space with the third row unfolded is just okay. Only to nitpick , one thing comes in my mind , that the AWD option is only offered with the top spec trim without the luxury pack , which would have you to choose between the extra goodies like the 360 parking aid , blind spot assist , sony 3d sound system , and an electric parking brake against the four wheel drive option ."], "5": ["2. Driving experience is very easy and the auto pilot mode is best for every safety system of car. And like highway driving or traffic driving very best operating system and accelerator is very smooth.", "I haven't buyed it but , i had listen from my friends who have this car and there experiences are very good . They were saying that the driving is so comfortable and the gorgeous look of this car is next level , the performance of the car is very good. The servicing and the maintainance of the car is so affordable.", "It is really good and best car compare to Tesla, bmw, rolls Royce.", "It was wonderful experience nice Car Very Much Comfortable and apart Features Of the Cars are Amazing With Nice Music System And Comfortable Drive with Awesome Ground Clearance Of The Car. you must Have It.", "Best car till date at a low price with a very greatest mileage and I'll suggest everyone to buy it as it is a best car at the very cheaper price and is really worth it to buy this amazing car.", "Value for money car, best car in this range in terms of quality and features....highly recommend the base model which is full of features...........................................cheers to Mahindra.", "I booked XUV700 on first round of booking on first day of launch and get delivered by dealership to my house after 2 month XUV 700 is all time best car by Mahindra it is completely a family car it's lane assist and adas is just mind blowing on highway we not even have need to touch steering it is completely automatic managed performance mode is very powerful. A big screen inside gives a vibe of Mercedes but the thing I don't like in it is third row which is not good adults children can seat there comfortable but not adults if you need a featured car it is best choice for you...", "This car is the best. Value for for money. Safest car ever. I specially liked the ADAS it helps me on highways. The seats are comfortable and soft. third row is great . I test the speakers it was excellent. I will give this car 100/100.", "We were given an estimated waiting of 12-15 months but got the car in 6 months, seamless process by Mahindra. The car is just stunning and overloaded with features for its price segment!..adas is a big pro and a few cons could be lack of OTA software updates, lack of ventilated/heated/cooled seats and absence of auto dimming irvms...other than this the car is definitely a bang for you buck and you should really consider the AX line if it fits your budget and you are okay with waiting.", "Pros: Safety rating Comfort, interiors Biggest sunroof, Last row decent leg space Good city Mileage Comfortable while driving Cons: one year waiting 5 seater version not recommended", "Excellent car, Mine is MT D AX7L. I have driven 6000kms so far. Great handling and stability. Awesome mileage. Highly recommend to buy for the price. Everything works fine. Good job Mahindra.", "The way car handles at triple figures is superb, if you ask me personally buying a petrol would be a much better option, it will take a hit on your mileage figures but if you are an enthusiast you will forget everything once you step your foot on the gas.", "Value for money , If you not purchase xuv 700, you missed something! Value for money , If you not purchase xuv 700, you missed something! Good time to prove your capability and dignity.", "Superb quality riding. Extremely comfortable 3rd row seating. I have a fortuner 2018 but the 700 is more comfortable seating in 2nd row and 3rd row. There should not be any comparisons between fortuner and xuv7oo because of the price range. But in xuv700 you get double for what you are paying. If Ones budget is around 25 to 30 lakhs ..then they should definitely and blindly go for XUV700. The best car in its segment. I Thank Mahindra for giving us such a car in this price range.", "Amazing dealership experience. Amazing after sale service and true to expectations driving pleasure as expected it was a pleasure driving the beauty and experience the amazing drive.", "I took a test drive of Mahindra XUV700.It is so comfortable and stylish.I am going to buy this heavy vehicle today.This is my favorite car ever.It's moon light roof is too good.I have not ever seen in any car.", "I enjoy the experience of Mahindra XUV700 like expensive world.My friend bought this car.I drive this car and I felt like I am flying in the sky.The car run very smooth and it is very best car in budget of 15Lakh.", "It's a good all combo car it has a great engine with excellent experience and great comfort and it's a very safe car it's looks so pretty so I think its a great car so if you want to buy a car it give you comfort, safety and enjoy full ride you can go for it.", "After 2 test drives in Bangalore I booked the variant in Nov 2021 . The car reached the dealer yard in mid September 2022 . But i took the delivery on 23 rd October as I was out of station . My dealer and SA was very cooperative and arranged a PDI once i came back in 16 October 2022. As i said earlier took delivery 23 October , and had gone for a long highway trip . The car is absolutely brilliant to drive you will feel the power of the machine right away . The best things 1. Steering its very light and easy to hold 2. You've got all most all gadgets and luxuries to pamper you . 3. Huge Sunroof 4. The powerful engine and AT combination is just awesome. The not so good things 1. Beige interior , pretty difficult to maintain 2. The NVH levels when you open the window and drive . Did the 1st service and that took 2 hours The looks .. Catchy ! a lot of motorists and the public was coming up and asking about the car. ( mine is in Red colour) .", "The buying experience was really good. The Mahindra staff helped us out and applying for the loan was also very easy. Even though waiting time is 12 months, I got it in 2 months. The driving experience is also really smooth. The car is not designed to be run locally. But on highways, it is as fast as light. The looks are dashing. Obviously, the best color is midnight blue. Servicing cost is not that much either. I applied leather seat covers to all seats and it was cheaper than my previous car. The only con is that if you're travelling far with more than 5 people,(one person has to sit in the third row with the luggage) it gets extremely uncomfortable. The last row seats aren't designed to be much comfortable and people of all heights will suffer. But, the car itself is really good especially the AdrenoX system and the built in Alexa . The panoramic sunroof gives you a great feel on mountains. The car is powerful and can accelerate to 100kmph in a few seconds. It's well air conditioned too", "Overall super car go for it without any dbt if you want sport car with in your budget best deal and such a wonderful car in India and this is made in india car also so better choice for all.", "I have not buy this car. my friend buy this car because it is the most powerful SUV in it's segment. XUV 700 is the best car from Mahindra other SUV looks better than XUV700 but but no other SUV competes it in performance. servicing and maintenance cost is not too high. it's pros of XUV700 is that is comes with a big screen ,12 Sony speakers ,ADAS which make this car premium when you sit inside it you may feel. cons of XUV700 is third row seat space is too less so i think it is for children not for adult.", "Buying was smooth but the wait time was more. Driving experience is too good. Economy was excellent. Good for long run as you don't find any discomfort in it while driving it. Did 3 servicing but all are worth doing.", "Massive road Presence , Very powerful engine, Excellent steering wheel , Very wide sunroof , when you drive the car you can feel the rush. Overall its a good one and excellent for road trips.", "", "Xuv 7oo is that car in which i feel luxurious and see my dream to convert in real. In this car features are unbelievable and happy to drive with luxury feel. In this price this car just wow.", "Beautiful design and looks, good maintenance, smooth driving experience , very comfortable and spacious , good led headlight, good display and touch , big space for luggage, cheap car.", "Excellent one from Mahindra... Love for driving .. especially zoom mode very sporty ... ultimate experience in highways, next level tech started ... I need personally massage seats", "Good & attractive vehicle. I love ADAS features also sky roof, airbag, and good safety best price, I wish book that vehicle, 5 star for safety rates all rounder vehicle 360 surrounding camera voice reminder everything is good.", "Best Suv in India Good mileage, handling, pickup Amazing suv by Mahindra Everything is fine Low volume. Good power Best Suv in India now Must purchase.", "Good buying experience Great look in Xuv model Good service When we talk about price in this range this car is excellent With good space It has best performance in hill area also", "Amazing Buying experience from Salasar Motors, Panvel. The car is worth every penny you pay, excellent driving experience and ride quality with updated feature list. The car is a true value for money!", "Best performance car and very good mileage and best comfortable car and excellent car reviews and best quality and my favourite car.", "", "", "", "I felt great driving it. It is a very nice suv car and it has good mileage. It's feature are unique. Their is 7 seater best suv car for family. It has great interior and very comfortable car.", "2. Good ride position ,You don't feel your driving a big car , ride is smooth 5200km completed without any niggles City ride mileage 10 to 11 Highway 12 to 14 depends on driving Ride and handling is very good Powerful motor will make easy while overtaking 1st service done zero fee 5.Pros: Safety Light steering , easy handling Features at this price Punchy drive Get a big car in prices of sub compact SUV Space and comfort Big boot Visibility near bonnet Cons: 2nd gear is hard sometimes Android auto will be available at July 22 end Few Spare parts availability Accessories Rear camera quality not so good", "Buying experience is good and all things are good driving experience is also good look and performance is awesome but the mileage is low 10 service is also good and maintenance.", "1.Buying experience is good 2.Driving experience in superb 3.performance is superb 3.maintenance coast is also medium 4.Servicing is also affordable price & maintenance also affordable", "The car is so fantastic as its driving pleasure can't be described in words. Excellent SUV car in this segment, very comfortable and spacious, also good driving experience, and good looking car. It is a great car in terms of power and performance. The look and feel of the vehicle are simply amazing. The build quality and mileage are also decent. The engine is 2 litre turbocharged yet the cabin is so silent as if I'm driving an electric car. If you buy petrol then it will surely affect your pocket. Highly technical features like ADAS is mind-blowing it's interior gives you feel like you're driving any car above this price range means a luxury car. Allover car is very nice and I hope I would never regret my decision to buy XUV700.", "Amazing performance. A fully loaded beast. Amazing amazing amazing... Not words to express such an amazing machine ut is. From performance to built quality everything is at its best.", "", "", "", "", "", "", "Xuv700 is awesome car. Good mileage, comfortable for long and city drive. Family car. Luxurious. No comparison of sitting space. Large seats. Feels like sitting on a sofa at home. Overall good and worth buying.", "Wonderful so far buying experience was very nice got car early as somebody cancelled and a vehicle was available earlier than expected. Looks awesome, very powerful and smooth engine and lights are very good.", "Value for money car and very fun to drive car. looks are amazing. Interior look very premium. And five star rating car which are very safe. One suggestion is please add minimum 6 airbag from base variant.", "1. It is of course a really great car we had a really great buying experience. The staff was very supportive and picks up call if enquiry to be done. 2. The driving is one of the best in segment and I felt it better than of the luxury cars. Have done couple of hundred kilometers with it now and it was quite easy to shift from a hatchback 3. It's a really dashing and muscular car and has a bang on performance. 4.Have got my first service and went well as it was general checkup not a lot time taken. 5. Cons i) High waiting period.", "", "", "I love this car. it is comfortable SUV car for family and friend for tour space is comfortable driving is better than in others cars . I feel in this car in luxury. Driving skill is comfortable.", "According to me this the best value for money car in suv segment as compared to other competitors. this is the best car I have driven so far in suv segment with the price range it offers. I am planning to buy this car in future. Let's take extra initiative to Support Indian brands.", "Driving experience is awesome .Exterior and interior is superb. Sky roof is fantastic and so many features are available in the car. In short this is full package of entertainment family car.", "I mean a lot from mahindra. This is true. I never seen this type of cars in India. Everyone should buy this car and try to move on with others cars because this has so many features and its worth the money.", "Purchased Mahindra XUV700 AX5 MT 5 Str midnight black colour car. Features provided are good at this price. Drove 1300km till date. Looks like a beast. Driving experience is awesome. Very stable at top speed. Mileage I got 10 km local and 12.6 highway and that's ok for 2l engine car. I hope it may improve further. Be Indian buy Indian.", "It is a very nice car, the look is also good, the interior is also good, the face ladies from inside is also good but a little more color should be given in it, the color is still a little less, a little convenience of color should be increased in it and some should be increased in it so that from the waiter and the waiter", "This car all wheel drive is so excellent. Performance is good and this engine performs very nicely. Experience is fully loaded in terms of features like 360 degree camera.", "", "", "", "Buying experience is good from Mahindra dealership Raipur chhattisgarh. I think this variant is value for money i think practical so i prefer manual mileage is in highway around 14.78 in city not good around 10.45 . Driving expression is good this car offer all like driving, mileage, exterior, interior, performance and all thing this car so value for money product.", "i will buy this suv for sure. I like its externals and interiror too much; it is good in shape and drive like pride, on road and of road it nice to see with me this vehicle. i will use this for personal use.", "A)Good driving experience , B)beautiful look and beasts performance C)Servicing and maintenance are also good not so High maintenance 1)Pros:- good look. Performance is very good . Good and smooth driving comfort. Premium interior.", "So far the car is performing well. I will update my detail review later. Fuel economy is approx. 10 km/l in AX7 petrol MT. Well other than that seat comfort is excellent. Don't even expect a good boot space. If you carry goods, make it a 6 seater. Infotainment system is working nice. And the looks of the car is another level. People will stare at your car if you buy midnight black color.", "Excellent Suv as of Now you can not compare this car to anyone , Especially Inside Features, I Driven This Car Nearly 2000 Km, Very Good Experience Worth to Buy, I Proud Myself for Buy ,but Only One Thing Is Now the Waiting Period Is 12 to 14 Month, Thanks to Mahindra Company to Give Such a Excellent Car in India", "", "", "", "", "One thing which I really love about the XUV 700 is it's ride quality. It has great comfort to it's occupants and feels stable and under control on both corners and long stretches of roads. The feedback is also to good.", "Overall experience is good, starting from booking to delivery. Features are good, Best in segment as compared to other cars like alcazar, harrier, safari.", "The Mahindra has made the super car in the India that is xuv700 and it is the first full of features. The car has automatic backing and it is the very good car in the world and it is the best car.", "Details about looks performance is supper car. Mind blowing driving.", "Too good experience compared to other cars. I mean driving as well as comfort like sedan but looking like SUV in presence. I am really happy to own this car. Delivered to me without any bias. I received it too fast/early beyond my expectations.", "Mahindra has done a fabulous job. Interior quality could have been little better but it's not too poor. It's driving dynamics are just amazing. Engines are punchy as well. I surely recommend it. Overall good in its segment. It's humongous impressive.", "A very nice and value for money product and recommend to everyone and to one's who are passionate driver and loves power. The design looks promising, refreshed and amazing. An unexpected product from Mahindra.", "1.Buying experience It's good to buy a Mahindra car as like a business, it grows. When you buy a car for 12 lakh, and on resale it may go for 15 lakh, by demand. 2.Riding experience Mahindra's every car are 5 star safety rated than there competitors. So I feel safe when I ride the xuv700. 3 performance My dad was having a Mahindra deluxe 2000 We sold out last few years back from then i was eagerly waiting for a Mahindra car to feel the rugged massive performance car from them, like xuv700.. 4.servicing and maintenance There won't be any problem price hiking, product demand I will receive my Mahindra car soon without any delay in workshop. 5.pros Price Technology improvement EXTERIOR looks Interiors space saving features Cons Colour option (limited) No customization option ( what ever customer need you can also make that like Rolls-Royce) Tail light need to be more attractive this is not enough compared to Mahindra competitors. '' This review is based on my opinion don't take anything serious ''", "Honestly the performance of Xuv700 is just so good. I really cant explain. The torque, the power from the engine, its incredible. The middle row seats are little hard in cushioning. But overall its just fantastic.", "The vehicle is having top notch features of premium luxury high end cars. The engine is peppy & ultra refined. People who want performance and responsive engine on the revv range must go with this SUV.", "I have not bought this car yet. But this car is like a blast. It is a full value for money car. Earlier I was about to book Tata Harrier, but when I came to know about this car and Tata's service. I was pretty much disappointed. Only one con of this car is that there is availability of only 7 seater in the top spec. But if you need good boot space you can just fold the last row which I thought is a solution for it.", "If you are going to buy a car in this segment just go and test drive this car you won't even think of other car. It's pull can't match any thing in this segment. Features are equal to bmw 5 series", "Really a great VFM product at lower price than Safari which I was about to buy. Also being a Mahindra and having mHawk engine, there's absolutely no doubt on reliability. Initially was disappointed that the luxury variant didn't have manual transmission option. But they had introduced it before the bookings open which surprised and brought smile in many people's face including me. Being a Mahindra car owner, I'm happy to move on to another Mahindra. The service center response is also great. Happy with their service.", "The car ticks all the right boxes. The front driver dashboard is simply awesome.. I have never seen such a beautiful dashboard in any cars even 3 to 4 segment above cars. I did test drive the petrol automatic. No words to express how refined the engine and performance. It was like a rocket. Waiting to test drive diesel automatic as I want a diesel one.", "An amazing car altogether! Must buy if your budget is 15-25 lakhs. Best features, performance and luxury at this price point and will offer everything you want in this budget!!! :)", "Good look and feature in this segment so I would be suggested to all my friends to buy this car and enjoy the experience of xuv700 thank you and congratulations to Mahindra team.", "This car is best in the world in my opinion. First of all this car is best in segment and it has very good engine. The power is great and torque is great of its engine Second car have great looks interior and exterior both are awesome. And it also have very technical features like 20 inch digital screen and door handles etc.", "As you all now Mahindra had been researching on their new generation product , this xuv700 is fully comfortable and have full optimistic features for making a smooth drive at any time, any climate, any terrain even at night. This car is made to provide you the best in segment features starting from its exterior to interior. The car is so adaptive that you can drive it in any terrain so that you have the all drive mode in one car only. The xuv700 is made to provide the sporty look as well as comfortable and featured loaded car to rival it's competitor in the Indian market. The car is put at the best price ever in the market with so many features that one can not give... Any of its variant can be chosen to ride it's loyalty ... The interior is so classic that u can never been bore from it as it has provided the world class featured music of Sony with a system of many feature... There are many new features also...", "Such a crazy good and futuristic product at this price is going to disrupt semi-premium SUV market. This will challenge all the SUVs upto 30 lakhs easily. Waiting for the automatic to book mine. Not to mention about how powerful the petrol engine is, in terms of power and torque, both more than the diesel variant - rare to see a petrol engine delivering more torque than their diesel siblings. Seltos, Creta, Harrier, Safari, Compass, Hector...watch out!!"]}