{"0": [], "1": ["The Mahindra Alturus G4 is not value for money. The maintenance cost is too high . Also there is big difference if we compare Alturas G4 &amp; Fortuner engine capacity.The Alturas G4 has an engine of 2157 cc and the Fortuner has an engine of  2751 cc When u sit on middle seat there is no feel of suv..."], "2": [], "3": ["Excellent work is done by Mahindra. Totally in love with the car Mahindra Alturas G4. It is hunk yet easy to drive, however, the road is, the beast makes its way like melted butter. Bought two of these together. The gearbox is very smooth and fast responding. Has many features better than its rivals (Fortuner and Endeavour). Would suggest the ..."], "4": ["Lovely SUV with full of features design and structure is also impressive...a great car with all the features needed to Drive comfortably...", "Though its a rebadged version of Rexton still it is going to give a tough competition for other big players like Toyota and Ford which are the most top in the segment right now. Getting 9 airbags in 26L-29L range is a rare thing in the Indian market", "Best in class in features like comfort, style, space, engine etc, no more words for an SUV like this from Mahindra. It's a rough &amp; tough SUV for all weathers, you can find around you and it's a more impressive feature, in my opinion.", "The build of the car is great along with the aesthetics. It has several great features, like a automatic boot opener and close button. It has a three-spoke steering wheel with amazing leather seats and cushion system with 360-degree rotator camera and parking sensors The interior has a premium feel.", "I bought this car just a week before, it's very good, no cabin noise, turning radius is good, very smooth handling, very good mileage. Good job on the exterior and the interior as well. It's value for money. Best road grip, the very fantastic different modes of drive, best colour options, sunroof is good. Overall, it's a top SUV."], "5": ["Excellent superb SUV made by Mahindra but the rate is 2to 3 lakh high comparison of Fortuner engine 2800cc. I am confused to choose both of them that which SUV is best for me.", "I BOUGHT THIS CAR AND DROVE A FEW HUNDRED KMS, THERE NO WORDS ABOUT BUILT QUALITY, COMFORT, BUT THERE ONE SMALL PROBLEM:- REAR VIEW MIRROR IS LIKE A DENT ON IT\"S ALL. ENGINE IS VERY MUCH SILENT AND WELL TUNED, NICE CONTROL, VERY MUCH SILENT CABIN, IN TOTALITY IT IS THE REAL SUV FOR THEM. I HAVE REXTON RX-7 AND FORTUNER AUTOMATIC 4X2... MUCH BETTER ...", "Mahindra Alturas G4 is not only feature loaded but also I think it dominates its rivals. It is luxurious, safe, smart, sporty, really it's a value for money car. Its gearbox is especially awesome, the Nappa leather seats are too good. I am really proud of my choice of buying Mahindra Alturas G4.", "I had a great experience with Mahindra Alturas G4. It's the best vehicle manufactured by Mahindra. ", "Mahindra Alturas is the most unique car, I like this car and I think this car can be compared with Fortuner.", "Mahindra Alturas is the topmost car of the year, I love the Mahindra Alturas.", "Simply to say, Mahindra Alturas G4 has no comparison to the recent trending SUVs, I just love its total features and performance.", "I have been driving cars ever since 40 years and I just took delivery of this SUV 4WD, as my 13th car in spite of me having driven Fortuner, Endeavour, Isuzu, Mitsubishi, with my experience and expectations. Mahindra Alturas G4 has no comparison to the above-said SUVs, both in performance and features. In fact, I'm holding a Mercedes C250d, which c...", "Mahindra Alturas G4 comes at a good price and feels much more luxurious as compared to other cars in this segment.", "Mahindra Alturas G4  is the value for money and the best luxury SUV in the segment.", "Mahindra Alturas G4 has a plush luxury well-insulated cabin. We can spend lots of time inside this car. Good engine and responsive gearbox. The LED headlamp is missing. Ride and comfort are outstanding. Steering feel could be better. Super refined smooth and silent engine feels like petrol. Overall the winner in the segment.", "It is a nice car it has 10 features more than Fortuner. It's the number one car in India.", "The car is amazing best SUV under 35 lakh rupees and Mahindra most premium car.", "This car has best technology. Totally can rival Toyota Fortuner in this segment. Also a 8 seater.", "It has great features at an affordable price with it's an inbuilt luxury, it is a car which we can compare to Toyota Fortuner, Ford Endeavour and many more cars.", "Mahindra Alturas is a very good car under certain circumstances like mid speed range ,normal acceleration and 2WD on flat roads And gives good mileage on smooth rides (10-12kmpl) despite, brutal acceleration it hassles for while and shakes when turning little bit on high speeds for overtakes also, gives little jumps on bumps (body roll) . Over...", "Awesome move by Mahindra. Loved the car. It's definitely better than the Fortuner and also much more value for ur money.", "Ultimate luxury. Recently did 1200 km and the cabin is so quiet and comfortable...Great SUV by Mahindra...", "Not that much space for last row passenger, but it is a value for money deal because it gives you each and every feature of Toyota Fortuner. And Fortuner cost around35 lakh on-road Delhi... And it costs around 30 lakh for the 4x4 option. Very practical car for the mid-range segment.very comfortable and powerful as well. If u have 30 lakh and y...", "Mahindra having the new beast Alturas G4, amazing built quality, high-class technologies and comfortable for Indian customers.", "Mahindra Alturas G4  is Muscular SUV. It has the Best price with Excellent interior. ", "Excellent SUV of this segment. Incomparable with Endeavour and Fortuner. Can be compared with Toyota Prado for its awesome features.Value for money.", "It is a very fabulous car in this segment and gives a very premium quality in interiors.", "Perfect SUV for off-road and city driving and comfortable too along with the power of 2.2 engine. It is equipped with the best in class safety and luxuries features from inside.", "This is a fantastic car all features very good and design an awesome and look great. I like it and my rating full. But I do not buy the car because am not rich.the middle family belongs to me.", "Excellent car in this SUV segment thanks Mahindra for developing Alturas", "Most people buy SUVs for sheer road presence and feel of a true luxury car. It is seldom that they take those expensive SUVs to real off road. Alturas perform well in city as its very smooth and silent for normal driving. Amazingly its turning radius is 5.5 mtrs which is wonderful and similar to that of all luxury sedans. Driver sits very high and ...", "This is the best Mahindra car in term of design and luxurious. It also comes with plenty of features which make it best in class with its rival.", "Mahindra Alturas is worth for the costing. Third-row seating is only suitable for kids. Infotainment needs to be improved, the off-road performance is also good. Overall vehicle is very muscular and bold in class", "It is the best value for money car in the segment but some Improvements need Mahindra to beat the most popular of this segment.", "The best car in the world. Mahindra Alturas G4 is a premium car from Mahindra I like all the features of the car.", "Fantastic car, it is awesome, and when driving because of its high clarity it is very nice. ", "Best car in the SUV segment in Fortuner and endeavor. The car is very dashing and is bigger than Fortuner and has a very good pickup and mileage in the city. It has the best comfort level and has 9 airbags in top variant and the company provides 4*4 also. It has a sunroof and the spare - parts of the car are very low prices compared to other S...", "Bought 4X4 version recently. Extremely happy with the car performance, its pick up, mileage, looks, comfort and safety. Had booked MG Hector earlier, but after hearing its reviews, cancelled the same and bought alturas g4 and I am very happy with the change of my decision. Best SUV car at the best price. Much much better than Toyota Fortuner and Fo...", "Nice looks and has comfortable seating. Good for long journeys and cost-efficient.", "Not sure whats wrong with people who buying Toyota, Honda, Ford. Mahindra Alturas G4 is the best SUV in its segment across all parameters. Awesome looks, great features, luxurious interiors, and best in class mileage. I have been driving this for the past 2 months with a 70:30 highway city ratio and I am getting 14 as average.", "Very nice and comfortable. Looking good. It gives royal look appearance. Very costly look. It gives good comfort.", "Muscular look.. Best in class interiors far better than fortuner and endevour Arnd 100mm wider than its competitors which gives comfortable sitting in middle and back row.. Only minus i felt is 2nd front is not electrical though driver seat is... Otherwise as a overall package its a good deal in comparison to others.", "The car has best in class interiors, they are far better than Fortuner and Endeavor and it is 100mm wider than its competitors which gives you a comfortable sitting in the middle and back row. Overall it is a full package with features and comfort.", "I own Mahindra Alturas G4 car and the experience has been ecstatic. From Mahindra's customer to the car itself, everything is just amazing. Apart from the features, which this car is loaded, the Alturas has a very efficient as well as a powerful engine. Yes, this car has old studded rivals, that being said Alturas is a great option as it's a value ...", "One of my friends is having Mahindra Alturas G4. I fell in love with this car in the first drive. Car is very impressive, comfortable, safe and powerful. India is producing great cars. Support Indian cars. Jai Bharat Mata.", "This is the best car. The features are awesome. Overall a good car. ", "The pickup is amazing. The handling is very good. The engine is smooth. The features are great. Overall a nice car in the segment.", "This car is massive in build. It is definitely the most premium car in the segment offering most features. ", "When I have seen this car I went mad in the first impression. Whatever were my requirements all I got in this SUV segment. I also tried Fortuner and Endeavour but I didn't like. My plan was to buy the car was after 2 years but when saw the car I brought it in my 1st visit. Believe me, the features that you are getting in th...", "The car is a good vehicle in its segment, this vehicle falls under high price range and the features are easily comparable with other high-end cars.    ", "Nice SUV car. The car's interior is great and in the best condition. The Ford Endeavour is famous for off-road. The Air conditioner is awesome. The endeavor's 4wd system is great.", "The Most expected Car just designed for Indian Users according to their Taste..A fair Justice is done with SUV Segments. My upcoming family member From where to start... Its design... Its wicked look, Its sharp features Its dynamite Engine, Its luxurious interiors... The choice of colors.It's beyond my expectations. A must buy vehicle.", "The interior of this car is simply stunning, and the car comes with a lot of features.", "An amazing car with best features and at an affordable price range.", "Amazing car. Practical features with thought given usage. The only drawback might be mileage of the car (9-10) city and (11-12) highway", "Outstanding performance, luxury interiors, excellent features, exciting safety measure and big in size.", "Mahindra Alturas G4 is the best car. I planned to buy Ford Endeavour, But the looks of G4 have changed my mind. It was love at first sight for me. I have driven this car a lot and getting an excellent performance, fantastic and user-friendly latest features. Very convenient to drive even in heavy traffic. Turning radius even beats any car. Rea...", "Amazing car. Amazing features including some first in class like 360° camera, ventilated seats. Is the widest and the tallest in the class. Has a sunroof, dual zone climate control and many more.", "Provide protection in all directions during collisions to ensure your grand adventure is a safe one too. Cutting edge technology for a sportier response and secure handling with Mercedes-Benz sourced 7-speed automatic transmission.", "The car is a premium model by the manufacturer and it performs well, while the price is something that can be talked upon.", "If you are planning to buy SUV cars then I'll prefer first to the all-new Mahindra Alturas G4 because this car gets the luxury features, it has the best pickup ever &amp; this car gets the seats of 7 for the large family it will be good, and it gets the mileage of 12 kmpl in city so the mileage is also not bad for this car and this car comes i...", "This a very good car. The mileage is awesome. It is a worthy purchase car.", "Almost the level of Benz this one is a mind-blowing creation of the Korean and brought out by Mahindra if you want a car which is luxury and sportive this one is the best. This G4 beats Ford Endeavour and Fortuner.", "Car is fantastic I love this car very much it is marvelous, beautiful interior parts. I like this car very much, excellent car.", "This is the best car in India, this is a good choice for the middle-class family. Great car in a good budget.", "Mahindra Alturas G4 is very brilliant, marvelous, beautiful, and lovely. I like this car, it will be the most top car in India, all features of this car are very good I like that driving seat very comfortable all car is very brilliant love you Alturas G4.", "Mahindra Alturas G4 is a brilliant idea for automatic transmission and a brand new published car and a really brilliant body and even with a 360 rotator camera and with parking sensors and with an amazing 8-inch infotainment system and a broad contour with a three-spoke steering wheel and has an amazing Neapolitan leather.", "Great car. It's new in the market but definitely beats Fortuner and Endeavour when the price is taken into consideration. It offers a great ride quality along with quite cabin and tons of features. Have already booked this car and waiting for delivery. Had test drives of Fortuner and Endeavour too but nothing like Alturas G4 premium inter...", "The car is budget-friendly, and it comes along with several features, which can be compared with other luxuries.", "Luxurious and Superb designed.", "This car is so much luxurious and gives a premium look and having a great car its design is awesome and have a Mercedes Benz engine.", "Amazing design, sexy look, Mahindra rocks, good average.", "No problem till now, Best driving experience, Amazing features.", "The car has excellent features and gives a smooth driving experience.", "Alturas G4 has a good road presence and will do good in the Indian market as well as in the international market also. Toyota offers 7 airbags in Fortuner but there are some cases in which the airbags of, Toyota didn't open so a person who is investing a good amount of money in buying Fortuner and didn't getting safety so that person can favor Altu...", "This is the best in the segment. The design is great, and the car comes along with great technologies. The engine performs well.", "Mahindra Alturas G4! I admit that it has hell a lot of features and presence and also the interiors are damn luxurious with those napa leather upholstery and what is more exciting is they have taken good care of small things like the door handles and the knobs. Every interior part of it feels luxurious and the exteriors do reflect some beefy appeal...", "Greatest SUV in India. The interior and exterior are awesome. Great road presence.", "Mahindra &amp; Mahindra introduced the Alturas G4 about 4 months back and though this premium luxury SUV segment hasn't witnessed much growth in the last few years, the Alturas G4 has been very competitive. If you see the sales of the past 4 months (216, 140, 321, 430) it seems the car has already entered the Ford Endeavour's domain. And as per the...", "Alturas - Amazing Car from Mahindra. Premium and prestigious looks and good SUV of the year. A tough competitor for Toyota Fortuner and Ford Endeavor. Safety wise 9 Airbags were given in this car apart from other safety aspects. Interior Quality is well made from Mahindra. Exterior design is attractive and rich in look.", "Good performance overall. Compared to other beasts this seems better in pick up and mileage. Not sure we may get a manual version or not. Probably this is the best beast of all. Should compare the safety features. Pricing seems equivalent. I could see some people prefer Endeavor over Alturas, may be because being a new comer. I would close my eyes ...", "I recently bought G4 2WD, not driven too much but one thing is sure. It's a wonderful SUV. Great road presence, interiors matching same as Benz, easy to drive and park, low turning radius, Brake hold is the best thing while driving in traffic. Almost silent like a patrol car, the auto gear change is smooth and steering is light. The suspension coul...", "I have Mahindra Alturas and Toyota Fortuner. But, Mahindra Alturas is far better and cheaper than the Toyota Fortuner. Mahindra Alturas is like more comfortable and smooth driving. Toyota Fortuner is a costly SUV.", "It is an amazing luxury car with many safety features. It has a very big wheelbase as compared to its rivals built quality is great when you travel in it you look like a big man it scares everybody in front of it it is given a descent look, ITV has 360 degrees camera which makes driving the gaint easily, the seats are very comfortable it even has s...", "This car excellent features along with great graphics.", "Its an awesome Value for Money package and has loads of features like 360-degree parking camera, sunroof, Electronic Tailgate and ventilated seats which is very useful in Summers! It also has soft touch materials almost everywhere and it has quilted Nappa leather which is finished in a tan color which looks like a cabin of a car which costs 50 lakh...", "Nice road test and good to know that it's almost equally the same as the Endy 3.2 in performance. The good car we are getting in economical range. Then many XUV customers would've upgraded and even some customers seeking value(how the XUV actually succeeded in the first place) over brand would've picked the Alturas over Endeavour or Fortuner. To ma...", "Mahindra company making me as the biggest fan of their company, They made Alturas G4, the best of their work, The car is a masterpiece with amazing features with dangerous power as well.", "TThis is certainly an outstanding start from an Indian carmaker in the domain ruled mostly by foreign players and that too in the high-price bracket where people don?t really count on Indian manufacturers. While Toyota Fortuner still remains the undisputable don't with 1,475 units sold in the month of November, the takers of Ford Endeavour and Skod...", "It is the best competitor of Toyota Fortuner SUV and more with more features.", "Wanted to go with the Toyota Fortuner. Found roof keep knocking the head due to less hight internally. The interior and technology, design, as well as finish, absolutely diverted my mind to go for Alturas G4.", "Nice car with excellent performance. But if it comes with a manual transmission I like more than that. amazing car.", "In India, the idea of purchasing a new car from a new brand is still not well acceptable. So, Mahindra has taken care of the same thing and launched the new Alturas G4 with its own badge instead of the original SsangYong Rexton. While products such as Bolero, Scorpio and XUV500 have been the bread and butter of the company so far, the new Alturas i...", "Mahindra has recently rolled out its flagship SUV and created a storm in the Indian market. The car falls into the domain of stalwarts Ford Endeavour and Toyota Fortuner. This is really a big game being played by Mahindra as carmakers such as Hyundai tried its hands earlier with Santa Fe but couldn't match up to the competition. On the other hand, ..."]}