{"0": [], "1": ["Bolero is made full of complaints. While driving it getting breakdown in the middle of the road. After using it for 4 years, all sensors are getting damage. Now they are saying the engine unit (EQ) is damaged. Bolero is giving a really bad experience.", "Only 1 airbag has come at this price. No safety features available, body roll too high little bit you can turn the vehicle is disbalance"], "2": ["The Bolero does not have such features, it should have given a bigger screen instead of a music player for entertainment.", "The Comfort level in the car is very low, the safety level is zero, no airbags, no ABS, and EBD, the quality of the music system is also very low.", "Great Report and unbiased assessment. I would like to add that bolero Facia is not much updated too and the instrument cluster is old and unattractive. We love it but change needed.", "The Mahindra Bolero is best suited for a person that mostly finds himself/herself driving off-road as the oBlero offers such ground clearance that would be more than sufficient for everyone and it also has great torque which means that it can tackle almost everything but if you are expecting a smooth comfortable and tech-filled car then you might n...", "Mahindra Bolero is a great SUV for the village and city also, but if you want to go on long-distance. So it is not a comfortable vehicle. You need a good body massage. 😜", "This car is not a luxurious car for sure. The safety features are totally 0 this car is ruff and tuff typically made for the Indian roads although the car more or less looks like a truck. Extremely bad looks stereo system is of a poor quality Mahindra needs to work on these points. The level of comfort remains below the average. The engine is noisy..."], "3": ["I m driving bolero since from the year 2011 it is a more powerful car it is also used as MUV it can go on an off-roading road. We have purchased 5 bolero first one in 2011 the second one in 2013 the third one in 2014 the fourth one in 2017 and the fifth one in 2020. I love its build quality its engine noise is much more than another SUV car it...", "It's a power full and massive car in India... And performance is a very high and smooth driving experience...", "Mahindra Bolero is a good car if you like it... It is not an unreliable car. Just pretty crude and highly used in rural areas or for off-roading.", "I'm a customer of Mahindra bolero since 2010 and I love this SUV. But in this rugged SUV there no entertainment system at least basic infotainment system must be in this car like any other car's had, base model like Mahindra xuv300, thar, kuv, and all Maruti cars have basic infotainment system. I say that this SUV must have a touchscreen but at lea...", "Good car for commercial use, zero maintenance, good mileage. Safe traveling. Overall a nice car.", "Bolero is a powerful car for long term use maintenance very low performance best in Indian road and this price range. My car runs 260000km in 2009 -2020. And, engine performance similar to a like-new car no issue. I'm very happy and proud of Mahindra. ", "Thik hai par khas nhi. Me use kar raha hu thodi chalne me khas nhi hai steering tight he gumana mushkil hota he.", "Most powerful engine and good comfortable space. This is actually an official car but mileage is so weak.", "The best vehicle for heavy-duty and best for those who leave in the rural area and no one beat with this bike.", "My Mahendra Bolero profomence is very best speed very good no any problems in my Mahendra Bolero ZLX.", "This is a stylish SUV but worst seating condition. Rear seats are not comfortable, we have to fold our legs into three-fold. And another worst thing is the big turning radius. It is poor to turn a U-turn. 5.8 metres is too high turning radius so you can't turn it easily in a small street road.", "It is comfortable and easy is drive. Low maintenance and service are very good. Every condition and ways are complete easily. In the option of seven sheets SUV very best. I use this car. And fell comfortable and joyful service. Services are batter then other. I love it ...", "The facelift of this new Bolero look fabulous and the powerful engine is also a great thing about this new Bolero. It does not have a lot of difference in the base variant and top variant but it does not have a touch infotainment system in any variant buts it's ok the music system also has Bluetooth so you can connect your android or ios devise and...", "I love its space and rough body.", "Overall Mahindra Bolero mileage is 15 km per liter with AC on the highway. Bolero is a good vehicle for highway and off road vehicle.", "This is an amazing car which comes in the segment with a sturdy build.", "I have an slx 2012 model and its performance is 10/10 as am from hilly terrain. It's the best car for a rough and tough road."], "4": ["This segment is much better from old shape BS6 design is very attractive 2020 are very inspired design really good look.", "Very comfortable and stylish design. Various type of colour's my favourite colour is black.", "I can't see any SUV like this. It's good for the mountain as well as all Terrains are good.", "Good for rough use. Satisfactory power. I used it for long trips but the comfort level is not so good. I would suggest it only for offroad or heavy use. Definitely not a family car. Fog lamps had not been installed initially. Also, the gearbox is not that smooth to use. Overall, a good SUV.", "I really love this car best SUV under 10 lakhs. I use this as my family car. Satisfied customer. It is a low maintenance car.", "Comfortable and good to drive. Maratha is suitable for this car and this is more comfortable.", "The Mahindra Bolero is one of my most favorite Indian styled SVU. When it comes to its build the feel is awesome and feels strong and powerful. The Rom of the vehicle which also very grace-full. The off-road performance is unmatchable. Once my bolero went into 2 feet road hole which is filled with water and this machine easily comes out of it witho...", "Milage is better compared to other vehicles in the market for SUV. Its looks cool with a low maintenance cost, the budget-friendly vehicle for the Indian market", "Most wonderful Suv car in this expected price range and best for off-roading. It is the most trustable car.", "This is the best all rounder Suv under 10 lakhs. Easy to drive through uneven terrain. Helps in a hurry and it is great.", "I am driving Bolero from the last 10-year. It's the engine is good and mileage18 km per litter. I am waiting for a new model to buy.", "Classy looking Interior. The seven-seat layout inside is suitable for large families. Although, the seats are positioned a bit low and luggage space is compromised to accommodate the additional two seats at the back. Styling is elementary with chunky dials on the console and wood finish on the dashboard.", "It is an excellent SUV for family and off-road. For rough riding in bad roads also in city. ", "The Bolero is a properly rugged vehicle. The car is built like a tank with all metal parts on the body. The ruggedness of the vehicle is very useful to the customers, especially in rural areas where the vehicle is very popular. The rugged Bolero can take on any kind of surface, with any kind of load, without much fuss. This is what makes the Bolero...", "Bolero is a nice car, Very majboot in every type of road, very low maintenance for the first 7 years. But it should have a touch screen system, Alloy wheels, Cruise Control and should be launched in CNG. Mini bolero should also be launched like XUV 300. ", "I have Bolero plus AC PS and I had a great performance from this car. But only safety is the big issue for me Otherwise Bolero is a legend car of all time.", "The Bolero is no.1 Gadi in India. Bolero is most comfortable. This is very safe than other cars.", "Bolero is a good car in terms of road visibility. Comfort is good but it lacks features. The overall experience is 8/10 Its built quality is good.", "This is the best Suv Indian car for rough and tough roads. All features in this car are good, average, comfortable and sufficient space.", "Excellent commercial vehicles for this segment totally value for money... good comfort awesome performance and design is unique. It will more awesome some upgrade features have to introduce.", "Everything is good but it should be improved music system is not upgraded it has to develop itself by that console is also need to develop itself seat is quite good but not too much comfortable. In other hand, alloys are also nit provided by to company but cars of same price range are providing more features so thats why I think the Mahindra h...", "The drive and the comfort of the car are great it gives stability while overtaking any vehicle.", "Low maintenance and use for regular mode with the best mileage but a little thing which disappoints. This car not so comfortable.", "This is an awesome car for family and its safety and performance are best.", "It's a budget car and best for rough users with extraordinary capacity and it has more comfortable for a long drive and headlight is the drop of this car.", "Best budget car in this segment. This car offers you 7 seats. This car build quality is very nice.", "Great SUV, I love it, its comfort is best in the segment but safety is a bit low. The mileage is good. It gives in the city 12-14kmpl and highways 17-18kmpl.", "It is a comfortable and safest car with a stylish design.", "My dad bought a storm in 2010 and the performance is so great to date. It never failed to impress. Though, many safety features are not available. They give awesome feels.", "Our buying experience is very good with Mahindra. I shortlisted this because I want a rough and tough SUV. Bolero is like an Indian road king SUV. New features of bs6 are excellent like airbag, comfortable seats, interior colour combination, all over my experience is very good with Bolero b6. Mileage is 14-15kmpl which is good for SUV and the mHAWK...", "Superb vehicle, very low maintenance, and BS6 engine are super smooth and punchy. It is value for money", "My favorite car. The best car Is have ever sit in or drive The best thing is it is tough and that is what we Indians want", "It's a wonderful SUV. Very practical family car. Excellent quality, rugged, good mileage, and drivability.", "Bolero is best powerful. Mileage bhi bahut achai h and  safar bhi acha h.", "Recently got this vehicle BS6, top model. Price, mileage, and build quality are awesome. The Interior and music system and other features are normal. It's good for long journeys and rough roads.", "It's a very good car from Mahindra and I am feeling better.", "It is a wonderful car. Its features are amazing and have a stylish body. Very comfortable.", "The most economical and safest SUV in the Nation. The vehicle comes with a 1500 CC engine which obviously gives the best mileage. It accommodates 10 in all though it's a 7 seater. I wish to travel to the Himalayas once in this SUV which is my all-time dream."], "5": ["Mahindra Bolero is very comfortable for a long ride. This is the best 7 sitting car. Very less maintenance required for this vehicle.", "Excellent for urban areas.there are no words to describe these cars it is perfectly made for the urban areas.there are no functions many because it is not made for comfortable its made for tough road and for hilly areas. Its visibility area is excellent. You feel like you are sitting in a truck. its ride quality and suspension are also good.", "All over a good car in rate, in price, in milage, inlook and rough and solid body and very good interior I salute Mahindra Bolero. All over the very good car is not India but all over the world thanks Mahindra Bolero. I suggest all people purchase. This car for personal and for taxi also.", "I give full stars for Bolero because Bolero is a great model like the Mercedes G class. Same use of a car but also like a car. For ride comfort, I give an average score. But stability is major. Better mileage in this segment 12km per litre. Road and load is not an issue. Road also not an issue. A/C average seating comfort also average.", "Mahindra Bolero is a very good and comfortable SUV. It is not so much expensive. It is the best SUV in the best prices. And, it is also easy to maintain and not so much cost is used for the service of this SUV. It is also the vehicle that is selling so fast in India.", "My dream vehicle and best in terms of safety and comfort. A joyful ride. Vehicle for the family to celebrate every occasion together.", "Bolero one of d best car in this segment. I am having Mahindra Marshal Deluxe of 2001 model and Mahindra build-up quality is excellent.", "The new Mahindra Bolero has a very nice look, the lights and interior are so nice, exterior and front of the Bolero are so awesome.", "The car has the most satisfactory features and has a perfect look. Highly recommended.", "It is a very good SUV for the long drive and so good to off riding and urban areas. It's a strong muscular car. The design is attractive.", "Very comfortable, smart look, strong engine. Suitable for offroad. Safety features like big wheelbase, length, and the height are good. When I drive it I feel vey comfortable.", "What the price of bolero, new model and old model for Mahindra bolero.Low maintenance cost and comfortable.", "It is low budget SUV in India with rough and tough style and performance...and it older version is more powerful than other SUVs in India at the budget of 5-15 Lakhs.", "Great car so far as it has multiple safety features. It is available in multiple attractive colors. Highly recommended.", "Super fantastic mini SUV, best on off-roading Best performance Super four-wheeler Mahindra Bolero Low-cost maintenance.", "Mahindra is updating the Bolero yearly with new get up and change in exterior and interior with a new engine which is 1498cc engine which was earlier used in Hindustan motors ambassador car if the new bolero runs in 21 km per liter is value for money and from my view, people will buy new bolero for mileage earlier model is 2523 cc engine ...", "This is a powerful car with the best features and it has a very good performance on the road. This comes with a good budget with low maintenance cost.", "This car is really a royal car. Very good performance by this car and this is really a royal stylist and nonstop car. In my area everyone like Bolero I like it.", "Bolero is a power pack with strong engine and strong body. The Bolero features are mind-blowing.", "The maintenance and servicing of the vehicle are pretty great. It gives great mileage and comfort for long drives.", "Very nice looking and mileage are best, safety-wise it is good. very comfortable and spacious and very good features", "Good and mind-blowing, this is the best car for me, this car performance is very high. I love this car. ", "The Mahindra Bolero is the best car, and it's the very largest SUV for sitting. The Bolero is The best for a big family, and it's a very smooth car.", "Best diesel SUV under 10 Lakh. It gives superb mileage around 18 to 20kmpl easily, with the best in class comfort and strong build quality.  ", "I am very happy with this vehicle, It is a low-maintenance car which gives a smooth driving experience. You can say, it is value for money. Overall best SUV in the segment. ", "The Mahindra Bolero vehicle is very convenient to drive in the hilly area. Very convenient for all seasons especially in the rainy season as the road are very rough during the rainy season. The mileage of the vehicle is good, and it is good to travel anywhere not only in the hilly areas. But also in the plains.", "My favorite car. While driving I feel very comfortable, awesome, and offroading with this car is unbelievable. The value of this vehicle was also reasonable. I feel that I have bought an Innova Crysta. This means I see my Bolero BS 6 (o) as Innova Crysta. Because the BS 6 engine made the vehicle more smooth as compare to BS...", "Bolero is one of the top SUVs. After few years, I realize that Scorpio creates disturbance but bolero after 9 years no problem no suspension problem, That's why I and we all love Bolero", "The fair condition means that like a new car running condition. This vehicle has clean title history, the paint, body, and interior work like a professional. The tires may need to be replaced. There may be repairable rust damage."]}