{"0": [], "1": ["TUV ka front grill change karke bolero ka naam lagake BOLERO ki izzat mitti me miladi. Kon si weed marke kaam karte hai pata nahi. Aur ise pass karne walo ne to pakka kashmiri class 1 ki weed ka dum lagake design pass kiya hai. "], "2": ["Bolero ruff and tuff car no doubt, but the interior of this SUV is too bad. Need to update. Please think about it. Thank you, Mahindra.", "Road Balance is not good and more features.", "It is the same TUV. The ground clearance of Bolero Neo is 160mm, and it is too low😊even TUV300 is better bcoz it has 180mm ground clearance. Moreover, Bolero Neo has only halogen lamps😂even my bike is having an LED headlamp🤣. So Bolero Neo is an utter waste😂"], "3": ["I own the car, Bolero Neo N10 Infotainment got changed with blue sense app, voice message system, e-manual is not available, rear parking sensor on 2 nos has been fixed. Totally disappointed with the actual delivered car with the demo car."], "4": ["Excellent vehicle. Definitely, a vehicle with power compared to other fancy cars. True SUV within a budget. People who like power and vehicle to be rough and tough can opt for it. ", "Nice car. Comfortable, pickup is good, 7 seater SUV family car with great performance.", "Sub 4 meter car but its height and width give it a large, bold, and bulky look. Best for people who love big cars. 7 seater officially but 9 adults can sit easily. Much better option in 7 seater range. So much is packed in my budget range.", "Very good car for the city and urban roads. Good space and driving comfort. Do not go with negative reviews. Drive it to believe it. Much better than standard Bolero.", "Bolero is the best SUV and very nice looking. The best car adjusts all city and village.", "This is my favorite car."], "5": ["Good Vehicle comfort is good but if you're paying 12lakhs and you're getting 7 seaters SUV that is good under budget, 3rd row is also spacious so don't think that 3rd row is not a useful and overall good performance.", "I think there are three drawbacks: One is engine noise, the second one is AC control system and the third one is centre seat folding. Rest car is good. ", "It's a really good vehicle. Don't go with negative comments. Go to your nearby dealership and take a test drive then, only you will get to know better about this vehicle. Because recently, I purchased a Neo N10 which performance is unexpected.", "Awesome new bolero neo 2021 model. And very smart fiction and a very smart exterior. The maintenance is very good. I like it. Thanks, Mahindra", "Kafi acchi gaadi hai, kafi aaramdayak hai or Mahindra ki sabse acchi car hume bahut pasand aayi, isse dekh kar kafi accha laga.", "Really nice. Bolero the most trusted car is now with a new look and features. Please also launch it in the dual-tone exterior.", "This is the best off-road comfortable car for the person who can work on-sites and features also good so no problem🤗", "Best looking car, TUV300 with bolero badge. Same as TUV300 safety is priority. Nothing else to say. 7 speaker Bose system cannot save.", "The look is very good, for the car price is low, nice performers no hight in the car dashboard", "Good looking and design from Mahindra and price also good compared to another same segment seven-seater", "Jordar h damdar h. Good looking h. Beautiful h or good build quality h. Features are awesome."]}