{"0": [], "1": ["Very bad experience with Mahindra Marazzo. Daily suffering some new problem with the car. ", "Worst car ever, multiple issues in the car. Please, don't buy, and the Mahindra staff also not supporting.", "Poor service, our new vehicle 3 times break down. Very bad experience with Marazzo. The Uppal Hyderabad service center people are not able to fix the problem.", "Very bad vehicle it, not safe, parts are not available chalti gadi mai aag lag jati hai total waste of money.", "Mahindra Marazzo Vehicles are good and it is comfortable in ruler area etc.", "I owned Marazzo M6 18th may. Really outstanding saved my 5 to 6 lakh rupees on Innova. It is spacious powerful best built quality MUV mainly road presence is good.", "I have been driving the car for 5 months and have driven 8000kms. It is a perfect family car, very spacious, ease of handling makes it money worthy. ", "Mahindra Marazzo has excellent finishing. The look is amazing, the car is worth money. The performance is great and it is very smooth with great pickup. ", "It is a lovely family car. The comfort is great. The driveability in the city is nice. It is a fantastic car.", "I own this car. This car is best because is ride is comfortable and pleasant. The safety measures are too good.", "Hi, just bought M6 .It has great experience to drove with it. Key advantage are appropriate price, really good space room, boot space, fuel efficient (15.3 kmpl) right now and smooth. It's perfect family car for 5-6 person don't buy if you want to race, it's really a great family car and good for long drive too. It could be much bett..."], "2": ["Mahindra Marazzo is a nice car excellent one thing but  I have to still test the mileage.", "There is a heating problem with my Marazzo. After repair, the problem still persists. I don't recommend this car to anybody."], "3": ["I have M4 plus Variant, In the city, the average is 15.6 kmpl approx, Highway average is 19.5 kmpl approx. Good performance on Hilly terrains also did not find any Lag in the pickup (as shared in few reviews online). Super Spacious, Highly effective cooling. Few issues I found in Vehicle are with upholstery. Apart from this, Other than that I ...", "Finally, I own this vehicle in February 2020 but I am not much satisfied with the pickup and little uncomfortable.", "Good car but bad service support, difficult to get spares in time, it is a failure in the Indian market.", "Gear lever and hand brake position are not good. Uses of the gear lever with armrest are not suitable. Hopefully, the facelift version will fix it.", "Good and performance are very good and its mileage is awesome. Good in price and comfortable for a family car", "This car is the best car for driving, and comfort entertainment system is also good exterior and front look so pretty.", "Mahindra Marazzo is the best in the segment, the car has great stability and performance. The mileage on highways is18kmpl and in the city it is14kmpl. It has the best in class AC.", "Pathetic Car Poor Performance just 1500 CC Full Waste", "Mahindra Marazzo has an Excellent stunning design with awesome interiors. The Mahindra Marazzo is a good MPV at a stunning price.", "Mahindra Marazzo is the one of the Best Budget Indian MUV, there's no other challengers in this segment.", "I didn't expected this much from Mahindra. But this car is fully loaded with nice space power and main thing is driving experience. It is awesome. I love this car.", "Best car in this segment Mahindra rise doing best it recover lose of Xylo car I think big tyre get stability on road and off roading is great. It is a best car and I love it's engine as this is best you get in Mahindra Motors. I think it will break all record of selling. If you want to enjoy suv with your family Mahindra Marazzo..."], "4": ["Best in MPV class at this price level, missing android auto in m6 version is sad, hope the update will come soon.", "I'm the owner of Mahindra Marazzo for the last two years. Faced 2 accidents, one of which is major, but thanks and hats off to Mahindra's build quality that I'm safe. Talking about long route comfort, mileage with off-roading, looks, and alloy wheels(M8) which are best in the segment and way better than Fortuner &amp; Endeavour....", "It's a big MUV with excellent boot space Marazzo is bigger than Innova width and height in both terms.  In the rear, there are 8 AC vents that look so attractive. The safety and security system is so impressive.", "Perfect MPV for a family. Big car in the small budget. I believe better than Innova automatic hoti toh aur better hota.", "Its an excellent car overall very happy. I would suggest for a family car and innova other 7 8 seters car waste. Though is my 5th car.", "I am happy to share my reviews about Mahindra Marazzo Car. I bought this car and this is really a good car with Cruise Control. I loved it from day one, I didn't face any problem. It is a very good car and its suspension was good and comfortable to ride. It has good mileage also. It is the best 8 seater MPV Car by Mahindra.", "I bought a perfect car to drive on city roads in traffic with easy overtakes and has the perfect length for small roads and the newly designed Marazzo car has an attractive headlight and Automatic Climate Control. It is in budget and easy to drive. I gifted this car to my father on his wedding anniversary and now he is very happy with that car.", "Overall performance of Mahindra Marrazzo car is so good, Mileage 17.2 km/l, Pickup is great, Comfort level is highly recommended. I just love this car at this price. you don't forget to buy this car. you are searching for the 8 seater car with low price and better look. ", "It is a very good looking car I love to drive it we can do off-roading on it but tires are very weak.", "This is the best car within its segment, it has all good features and gives a good performance. It has all the facilities that are needed for giving a better experience. The car is full of comfort and the review of this car is fantastic and it is a great choice for the family.", "I bought it because it was not so expensive and it was having a very good design. it is very comfortable.", "A perfectly spacious MPV suiting its cost to comfort and driving ratio. Real value for money in its segment.", " Mahindra has recently unleashed an attractive MPV named Marazzo. The company has worked a lot and left no stone unturned in order to grab a slice in the segment that has been dominated by the unbeatable Toyota Innova Crysta. Mahindra Marazzo is the perfect car for long journeys with the big family. The MPV is designed mainly for the Indian cu...", "I was not referring Mahindra but when I tested the drive Marazzo I was mad behind it. this car is just amazing.", "Mahindra Marazzo is a marvelous, elegant, unique and worth purchasing it is right to value which is excellent.", "Mahindra Marazzo a good vehicle, replacement of Innova. I owned one Marrazzo better than Innova...", "Mahindra Marazzo is an outstanding car overall. It has a refined engine and space at an affordable price.", "Mahindra Marazzo is a very good car with good space, good performance, good mileage &amp; good road presence. Excellent MPV by Mahindra.", "The vehicle is all good in city and Highway, good interior and suspension. But the vehicle struggles at high altitude like Shimla, the vehicle used to go down the opposite way if the ac is on and the vehicle is filled. We had put rocks and on full acceleration in 1st gear hardly pulled the vehicle. We struggled a lot if the vehicle stops at a slope...", "I am having a good experience with my Marazzo. Whatever that has been said by the company is real and can be experienced while using the car.", "I feel very comfortable in this car, this is the best car and this model is too good and this car looks nice. Design is very good and the performance is also good.", "Awesome, powerful, stylish, powerful engine, sporty front, ground clearance good more spacious.", "Amazing Car with the comfort and if we talk about the mileage it's just awesome. 7 inch Screen display is good and I wish that we get an apple update in the next update of this car.", "I found the vehicle has a low pickup at a hill station and usage of brake pad is higher in the hill station.", "Perfect family car if you wanna buy dreams for your family. I promise it's good value for money car.", "Mahindra Marazzo is a good looking car with the best performance at the best price, so why go for other options. ", "Excellent interiors and safety but engine performance not much cant able to climb hills alerting engine overheat issue.", "I feel comfortable in this car. The looks, amazing smooth driving, pick up, fantastic features, sound quality and air conditioning is very good. Also, has an ultimate power steering, seating capacity is very cool. In fact, the dashboard is also spacious.", "Excellent interior space with a silent cabin. Loved driving on long rides, absolutely smooth, smoother than melted butter. The AC has quick cooling after the engine starts. Excellent handling and seamless drive using Cruise control (M8 Only). It has a very aggressive front look with a good road presence. Best value for money. With fully l...", "Comfortable easy to drive good in looking lots of space comfort seats are great and the mileage is good for long-distance traveled.", "Excellent car while I took a test drive, very smooth while driving and suspension is very nice, Gear shifting very smooth very comfortable seating arrangement.", "Mahindra has recently launched the all new marazzo which is known as MUV car , the best luxury 7 seater car in mahindra &amp; this car has launched in just 9.99 lakhs. It will be very much benefit for the people because in the minimum budget they can get a luxurious car with mind blowing features also, When I drive this car on highway at the s...", "We already own a WagonR, but that;s not enough for our family of seven members. Being low on budget, we were left with a few options to choose from, with Mahindra bringing in the Marazzo truly felt like a blessing. The car is cheap is attractive and we all can go together anywhere we want. All the three rows are spacious, and our parents even find ...", "Engineered jointly by Mahindra North America Technical Center(MNATC), Detroit &amp; Mahindra Research Valley (MRV), Chennai, the Mahindra Marazzo is truly a great car. It looks too good and driving it makes me so happy. Not only me, but my entire family loves it, its spacious and the entertainment system is really nice, the speakers are effective. ...", "Amazing looks, superb interior, and I just love the way it goes around it is so smooth and effortless. The suspension is the best and the steering wheel is super-super soft. The interior is also good, the features provided are good, mine is the one variant down the top one. Also, while taking my friends for a ride, I noticed that at high speed...", "When I first read about the Marazzo, I thought it's another Mahindra car with probably same old, seen design. However, research about it more revealed that it has been designed in collaboration with Pin-infarina, the Italian Design House. It really took me by surprise, and the next thing I know, I was at the dealership checking out and soon booking...", "The Marazzo starts at Rs 10 lakh for the base M2 varinat and goes up to 14 lakh for the top M8 variant, which makes it a value for money proposition. It can accommodate up to 8 people comfortably and is loaded with some good features as well. The customers who were looking for a spacious MPV and could not afford the Innova Crysta, finally have a go...", "I am planning to buy a muv in the price range of around 15 lakh, right now I am considering following vehicles 1. Toyota Innova - A good Car, but out of the budget 2. Maruti Ertiga - Current one doesn't look a good one, waiting for its facelift version 3. Renault Lodgy - Considering it, but not much impressed 4. Mahindra Marazzo - only see the spy ..."], "5": ["Mahindra Marazzo is the best MPV in India. I think because of its comfort, styling, ac events, etc., it is better than Innova Crysta and this car's budget is all so ok. It has even more safety for Mahindra Marazzo.I like this car very much because of its interior styling of this car. I like this car's hand brake, so unique.", "Best car, good performance, handling is also good, surrounding AC technology is different but good.", "Very comfortable car in this segment, easy and smooth in long drive with good mileage with a silent cabin and feel like a journey in an Aeroplane.", "Mahindra Marazzo fulfills all the features a car wants. Looks are dashing, superb performance, excellent comfort, and good safety. Very spacious, decent mileage. Value for money.", "Value for money and best looks comfortable. It has a good feature and spacious. It gives good mileage and it is a multi-purpose vehicle. It is best in class and silent.", "Its been a month since I brought home my car and what a feeling it had been. Never expected such a silent smooth and spacious cabin from the house of Mahindra. Amazing comfort and super easy to drive in city traffic too. Plus, it came with the highest NCAP Safety ratings in the MPV segment. Whether you buy it for personal or commerci...", "Good comfort, good performance,  better than Innova. Badget MPV.", "One of the amazing car on Indian road. It is a very comfortable and high luxurious vehicle with spectacular features. The design is such that one could neither reject this car. Value to money on purchasing this car. While driving gives a high positive feeling. A challenge to everyone who has not set their mind to purchase this car. Vehicle controls...", "Great car for family and for highway use. the variant m2 is the value for money, in that we can do top model for that, then why to waste your money in the upper variant. if u want the upper variant you can buy for it but in my opinion, the m2 is the best option to buy no negative in a car, not that luxury but it's enough for our daily use for famil...", "No automatic even engine performance at lower gear is worst only fit for taxi design is good though some roll is observed during turns.", "Mahindra Marazzo is a nice car which i like the most. All features are good from outside or inside.", "Very nice family car for small budget buyers, ladder on a chase from, value for money...the car is just insane in the MPV segment and won't be beaten for years...", "Very nice car fantastic Cooling and very spacious I would like to buy this car now...the car is a perfect MPV with awesome style and a sharky look...", "No push start, No A/C For Last Row, Bumper was Made with Low Quality. ? With the 3rd seat row in place, the boot is rather small for a vehicle of this size ? Concerns over niggles in a freshly baked product &amp; engine from Mahindra ? M8 variant's price overlap with the XUV500 &amp; Hexa (especially after discounts on the latter two) ? Bench seat ...", "First Talks First.......I had been in the Marazzo while on 26 Dec we met with an accident ......it was a major one and would have been fatal for all the 8 of us traveling in it only if it's not a paparazzo...Hatasoffbto the sturdy structure and the robustly built vehicle.....A groundbreaking safety studded vehicle and a Life safer.......love you Ma...", "Superb its too much ultimate luxurious interior, high-class power, and performance no noise in car..ac and car power very powerful engine no vibration...and suspension and seating very comfortable...", "Mahindra Marazzo is a landmark venture by the homegrown company as it has used its own expertise in big diesel cars and expanding global resources to create a vehicle that is unique in many aspects, other than the pioneering use of hybrid chassis with front-wheel drive and transverse engine layout. The exterior and interior design is so classy, und...", "The feel you when your driving is of SUV type. Confidence level high with 4 star safety. What else you need with such competitive pricing. All in All.. you want a 7 seater go for it.", "Marrazo is the best MPV car of the year, It is a fully satisfied car.", "Awesome car, I had a very good experience because I bought this car m8 model very much power and good off-roader.", "Mahindra Marazzo is a perfect family MPV. It has great Space and very comfortable. Overall It is a very Good car.", "It is a spacious car and the best value for money car.", "MARAZZO - Overall the best fit &amp; ride in the SUV segment. Sharky looks amazing shine on the body. MPV segment is emerging a lot and Marrazzo is a great hike to it.", "This is equivalent to Toyota Innova in Quality but very cheap in price. Safety is best feature of this car.", "After lots of speculation and apprehension finally, we bought an hour 2nd family car, A Marrazzo M8. After driving 1000 km in the first week; now I share my view on this car. My requirement was a 7 seater good car at a decent price. Innova is good but was out of budget for me. I had to decide among Ertiga, Lodgy, Marrazzo, BRV and lower variant of ...", "It is very smooth as a shark, silent as a shark, Mahindra Marazzo.", "As per the price the interior Marrazzo an excellent choice. Perfect MPV and will show up great if someone buys it.", "After being the owner of Toyota Innova for last 13 years this time I opted for the Marazzo 8 seater M6 model. Although I was skeptical initially during booking all my doubts and fears vanished once I received and started using it. I have already used it for 400 Kms at a stretch and another 400 on return journey.....it was a very good and smooth dri...", "Mahendra Marrazo is a real super Shark in the upcoming cars, this car is fulfilling all the demands of power, space, speed, and looks.", "I think, first of all, its a proud moment to us we Indians became the shark of the car market. Now I am telling you guys, it is not only a shark by name but it is by looking or performance. I would like to tell you guys, \"Don't think just buy it\".", "I have done a test drive this car on Dec 17/2018... I have a lot of expectations for this car, I didn't meet expectations for this.", "Full of technology's blessings liked the car very much no complaints yet.", "Have been driving it from the past four months. It has been a great experience all the while. It never disappoints and the roasted presence is extraordinary. The interior space is excellent. Driving is smooth and silent as being advertised. You don't feel that you are driving a diesel vehicle. I am proud that I have made a right choice. Strongly su...", "Mahindra Marazzo is a supercar of the year Marazzo good MPV India, I love it", "Mahindra Marazzo  is an Excellent Stylish and comfortable Vehicle to match Indian roads", "Mahindra Marazzo is Overall too good looking and spacious.", "Mahindra Matarazzo. Super driving without any problem there was 7 seaters sitting freely unfaithfully in Mahindra Marrazzo super mileage, Super gearbox, super tire button, and super excellent car.", "This car is one of the best cars Mahindra has ever manufactured. Inspired by the shark. The car can fit in a family of 7 easily, comfortably and easily. #mahindraonnextlevel", "Excellence design with high features, everyone makes a different style to ride.", "Good car, all facility available. I am so happy with this car features.", "Great SUV, comfortable riding, effortless drive, smooth engine, quietest cabin.", "It is a very good looking car of the year in 2019.", "Mahindra Marazzo is a very good lucking and amazing powerful car...Greta MPV in India by Mahindra...", "After driving my Marazzo M6 for nearly one month, I can clearly say it was a fine decision to go for it. Mahindra has a good reputation for good engines, but this vehicle has surpassed my expectations. The suspension is good. The car feels solid. Only negative I can think is the absence of keyless entry and push-button start. The second key they ga...", "The vehicle is too good and very useful for middle-class people. Safe and classy looks.", "It is the best car. I am the owner of Marazzo M8. Its awesome, excellent, superb, lovely. I don't have words for this car.", "Mahindra Marazzo is Very well but it is bit expensive as per the worth may it get it's price down in future.....", "Mahindra Marazzo is an Excellent family car, value for money. Mahindra is improving day by day.", "If you are someone looking for 7-8 seater MPV with 10-15 lakhs of rupees than Mahindra Marazzo is the car you are looking for! It is based on design of shark looks. It was very comfortable and cushioned seats. You will not get tired even after a long journey. The third row of this car is better than any other car in this segment. Second and Third r...", "Mahindra Marazzo is a very nice family pack car just like dream come true. ", " The Marazzo look is very attractive and much specification..... 7 airbags, extended fenders, sunroof, all the stuff are incredible... ", "I have a big family and therefore wanted a 7-8 seater car. My initial choice was Innova Crysta but it was out of my budget and thus I bought the Marazzo. It is really worth every penny that I spent. It has a great pick up and provides a very comfortable ride even on high speeds. It smoothly glides over the road bumps, thanks to a great suspension s...", "I recently purchased the Mahindra Marazzo. I won't lie but getting home a Mahindra car was never an option let alone be a choice. However, my perception changed a bit after seeing the XUV. And after seeing Marazzo, me and my dad seriously considered of buying it as we were already looking to an MPV and the available options like Innova was way out ...", "A Car not only with feel but also with a deal. To experience the drive into a seventh cloud which makes you feel spell bounded along with the person of your dreams. It worth driving.", "I didn't like the Marazzo when I first saw it. The vehicle looked like a love child of the Xylo and the XUV. Since we were on the lookout for a new MPV within Rs 15 lakh, we test drove the vehicle. It was leagues ahead of any Mahindra we had experienced so far. The vehicle was not only refined but was very easy to drive. We all loved the engine thr...", "I have a big family and hence I need a large car. I have owned the Toyota Innova in the past and was looking for something new and fresh. I've heard positive reviews of the Mahindra XUV but it just didn?t click for me, perhaps because of the way it looks. Then I got to know that Mahindra is coming up with their new Marazzo. So I decided to wait for...", "I am the owner of a Mahindra Marazzo M8, the top spec variant. If you want a car for 7-8 people and can not afford the Innova, Marazzo is the car for you. The 1500cc engine might sound a bit underpowered for such a big vehicle but when we go out on a trip with luggage at the back as well, the Marazzo doesn't break a sweat. The air conditioning...", "Beautiful look and best safety feature Comfortable seating for all passenger powerful engine good dynamic building quality is good safety rating is in 4-5 star that is good in a similar segment.", "Very good in driving and controlling, balancing and safety.", "Spacious, luxurious, super smooth and so noiseless...to say in a word. Here we have a killer for the Innova crysta..beats it in price ...drive comfort ...seating comfort and mileage.", "The best car of Mahindra. I love Marazzo. The interior is very nice.", "Mahindra Marrazo is a great family car and value for money. Best vehicle offered by Mahindra till date. Very spacious, comfortable, silent and smooth. True 8 seater family car for daily use as well as for long trips. ", "Mahindra Marrazzo is a good choice &amp; comfortable setting. Also smooth driving.", "Congrats Mahindra for excellent Marazzo. So smooth, silent and comfortable with best features at this price. I got nearly 17 KMPL of mileage, so happy to own this car.", "Marazzo is very comfortable and spacious, mileage is much better than Innova. Very good option if you want to save money rather than spending on overpriced Innova. ", "I bought Mahindra Marazzo M8 on 20th Feb 2019, it delivers 17.9 KMPL mileage on the highway from Hisar to Ludhiana and 15.1 KMPL mileage in Ludhiana city driving. Love this MPV and it is very comfortable. ", "This was an awesome car and as much i accept this was a very luxury car Mahindra do good work with this car and this was very useful for our family this was perfect car and i love this car so much.", "Mahindra Marazzo is an ultimate MPV as it is very silent moreover it definitely beat Innova. ", "Mahindra Marazzo is a complete family car. Basically, first I went to check Ertiga car but after checking Marrazzo I completely loved it, decided to buy this car and another day I got Mahindra Marazzo. ", "Mahindra Marazzo is a very good MPV. The seat comfort, space and comfortability are totally suitable for Indian roads.", "Very comfortable and stylish car with safety measures.", "Marazzo is one of the MUV who can give a tough fight to Innova, as well as Ertiga and could have a big share in the MUV segment which is the fastest growing and have very high ASP. Few observations 1- Driving comfort is far better than Innova or Ertiga or Hexa. 2- AC scheme of things to last row ia awesome and looks are amazing. 3- 1500 cc engine m...", "Mahindra Marazzo is a fantastic car, I loved it as it is the best affordable MPV of India.", "Mahindra Marazzo is a great car. It is an MPV segment which has all the features.", "Mahindra Marazzo is an excellent car to ride on. Value for money car.", "I'm using Mahindra Marazzo from 5 months. It is an awesome car to go on a long trip. One of the best in this segment car and totally made for the middle-class customer.", "Mahindra Marazzo is the most powerful car. The company is the best for all consumers life. I am also buying this car.", "Mahindra Marazzo is an SUV for a long drive and even its very smooth.", "I have purchased a Mahindra Marazzo in October 2018, I am completely satisfied with the performance and the services for the car. I am so happy to have this vehicle.", "I have been using from one month. It is a Superb vehicle at a moderate cost. Interiors and driving comfort are amazing. The long drive is very exciting with Marazzo.", "Mahindra Marazzo is a good car when compared to the Toyota Innova. it is a middle-class MPV segment vehicle.", "Mahindra Marazzo has a good space, nice wheels, everything is perfect on the Indian road conditions and for Indian middle-class transportation.", "This car is a bumper package for all the MUV lovers because this car stands best in all conditions such as in seating plan, safety, looks. These things attract you a lot towards the car and really it is a best cheap package in this segment and this car make you feel royal as many of us are not able to buy Innova Crysta but now we have something com...", "We were waiting for Mahindra Marazzo to launch and we got this car more than expectation. Till now the car mileage, suspension and comfort are up to mark. I would like to thank Mahindra to make budget cars in this range lovely experience of 2K km in 2 days was awesome.", "Mahindra Marazzo is one of the best cars in MUV, with 4-Star rating in safety. Also a very comfortable car and stylish performance car. Such a supercar is meant to be purchased.", "Again a great car by Mahindra but in a new segment that is MPV, the car is spacious and powerful having a streamline body design...", "This is a good car. The looks are amazing. The safety features are great. ", "Mahindra Marazzo is an unforgettable paradisal experience while riding this Marrazo M6. After my experiment with many cars beginning from Ambassador Classic finally, I have found the best one for myself and my family. The apple car play is fun. The fuel and mileage updates are so useful. It is like a friend, another companion journeying with me, fo...", "This is a great vehicle in its segment. The power, pickup, mileage, and space is great.", "My car is cherry red in Colour, very spacious and easily 8 people can sit, it is smooth we have been using it for more than 5 months nothing has problematic has happened yet. Very good looking and nice car. It gives good mileage and has a very nice finish coating. I will recommend it for everyone with a large family, easy to drive too.", "My car is cherry red in color, very spacious and easily accommodates 8 people, it is smooth we have been using it for more than 5 months nothing has problematic has happened yet. Very good looking and nice car. Gives good mileage and has a very nice finish coating. I will recommend it for everyone with a large family, easy to drive too.", "First of all, it is a great car from Mahindra which gives us an extra level of security and it has a clean look with a robust, abuse-friendly build? Nice &amp; roomy cabin. 1st &amp; 2nd seat rows are spacious? 1.5L diesel offers good driveability &amp; fuel economy. 6-speed MT is smooth to use? Impressively refined &amp; more carlike-to-drive than...", "I have bought the car recently and drove it for 600 kms. What I experienced is that the driving was good and smooth but the car is struggling to pick from 2nd gear as sometimes it gets off.", "Mahindra had made this best for budgeted people, with all advanced feature this 8seater car comes with best overall feeling with great space for sitting and luggage its a big family car.", "Mahindra Marazzo is a very nice car, smooth driving, good control, even the person sitting in the last seat finds comfort rear ac is superb I would recommend Marazzo better than Innova, 100% comfortable than Maruti Ertiga,", "Mahindra Marazzo has a world-class suspension. Most silent cabin. Luxurious feeling.", "I bought this car in Nov 2018. I am really happy to be part of the Mahindra family, a good choice for the family-oriented vehicle. Smooth and clean. Good mileage as of now, I've driven 10000 km and getting 16.3km/l.", "Got a Marazzo last month. It is a very good value for money family car. Only suggestion to Mahindra is to improve the fit and finish of the plastic interiors especially the dash board. Overall super happy.", "It is a very comfortable car which gives a great driving experience. The features are amazing. The looks are classic. ", "It's a very good MUV and best in the segment. It gives very good and comfortable rides. ", "Excellent car with great features and space. Looks are superb and comfort level is very nice.", "This is an excellent car. The features are really good. The looks are amazing. Overall a worthy purchase. ", "Best MUV in its class, the engine is very smooth. Having great riding comfort. Noise proof cabin. Cooling is also great. No tiredness after a long drive. Having great fun to drive.", "MPV with optimum power and good looks. The road presence of this vehicle is exceptionally good with better handling. Launched at a very attractive price.", "Superb SUV, nice in driving. Looks ultimate, performance good, hand brakes in new style looks good. AC especially diffuse option is awesome. Cons: Normal antenna, instead of shark tail fine antenna as shown in TV ads, only 2 airbags, start engine button absent, its a good option to buy SUV instead of Innova which is very expensive and not...", "Manindra Marrazzo is a superb car. The seating capacity is also good accordingly. It is a really comfortable car which gives it a smoother driving experience. The looks are also attractive. Overall it is a nice car. ", "An amazing car I ever got a nice pickup and very silent in the road but the mileage drops but it is worthy for the money.", "Good car. I like the car very much and it's priced within a budget. An amazing MUV.", "One of the best cars of Mahindra which is affordable and classic. It is the best MPV with the best qualitative and safety measures and is quite luxurious and comfortable as compared to other cars of different companies.", "Very nice, driving this car is comfortable with all new advanced features. The engine is noiseless. All the passengers seated behind also feel comfortable. AC is very good at the rear also. A must buy.", "This car is very luxurious and very spacious. This car is very Smooth and feels like Shark. This car comes with 6th-speed Manual gear transmission. This car can easily absorb every jerk and gives a smooth and comfortable journey. This car has a very good Infotainment system. The speaker sounds decent and this Looks like Shark and feels like Lion wh...", "Mahindra Marazzo is a spacious and powerful car. This car didnt create any noise. I drove it to 400kms and the ride was non tired. Car gives best mileage. AC and AC vent ar good.", "We call our Most dreamed and loved car Mahindra Marrazzo as \"Marina\". She is ..Stylish, Tall, Comfortable to all seats, Comfortable in driving, Good Control, and Runs on the road like a Shark in Sea while driving. Lots of happy things to write..about Marrazzo...It's really a Value for Money Car. Also, Good Mileage as claimed..17km /liter. Thanks to...", "It is a nice car, smooth and comfortable car. It is smooth and safe. It has some premium features.", "Mahindra Marazzo comes with great looks and gives you great performance. The driving experience is really smooth. ", "Mahindra Marazzo is an awesome Car. It has excellent finishing. The look is amazing, the car is worth money. The performance is great and it is very smooth with great pickup.", "This car comes with a 1.5ltr diesel engine and delivers 121bhp power and 300nm torque. The car is very responsive on the highways as well as in the city traffic. Perfect Family car.", "It is my first day of Marazzo ownership. It is lovely! I mean for the features offered and prices are satisfactory. I drew Ertiga earlier, that's a great car but Marazzo is superior. Acceleration is good, ample space, the Gear lever is at a more comfortable height, driving seat height adjustment is good, the instrument control panel is clean and in...", "Mahindra Marazzo is a very good vehicle which improves its performance whilst driving. Really we fall in love with the fragrance of its gentleness and flexibility. A silent performer winning all the hurdles and settling in the hearts of people. The spacious interior is indeed an interactive element for those who experience the architecture of the v...", "Impressive design but it has an underpowered engine. The car doesn't perform up to the mark while driving on the highways.", "Awesome car with great performance. Value for money car and also a perfect car for the family. The car is very smooth and the design is very different from its competitors. ", "The driving is nice and comfortable. The music system is very impressive.", "This is a nice looking car. It is a very comfortable car. The interior is good. The mileage is impressive. ", "Nice looking, spacious, comfortable, smooth driving, good mileage, and nice cooling. The navigation feature is Nice.", "Best MUV in this segment and the perfect vehicle for a family for long comfortable drives, proud to be the owner of Indian make four-wheeler.", "Very bad car in all things because its engine is not working and a very poor average.", "1st day with Marazzo, firstly it attracts all eyes to see my Marrazzo, simple but Quite luxurious, cabin is just given a feeling of peace, as Indian we know that how many temperatures in India during summers, but in Marrazzo, I didn't feel any hotness in cabin, just amazing, after an hour I feel cold, very fast cooling technology, space is good eno...", "I am driving this car and must say it is a very smooth and comfortable car and it contains a lot of space. Everything is fine .", "Riding is comfortable and smooth in highways even at 140kmph. In village roads, some shocks are being transferred to the passengers.", "There is a heating problem in my Mahindra Marazzo. After repair the problem still persist I don't recommend this car to any body.", "Best in class space... you have enough space in all three rows for your long drives... Best in class mileage.... in daily traffic hustle of Gurgaon to Delhi..i am getting around 14km/L, while on the highway you can get up to 16 - 17, depending upon your driving style. This car is a full package with an absolute price range. The only con which I hav...", "It's just one month I bought the 8-seater Marazzo, the drive is awesome. Very smooth ride, Easy handling of the car is what u get with this MPV. Awesome experience as a whole.", "This is a very comfortable car. The looks are really nice. It is a very spacious car in the segment. ", "This is the best MUV safety features are very good and looks are very good. Comfort level is very good and the engine is very powerful.", "Marrazo is the clear winner in terms of styling looks easy to ride spacious enough to fit in 7 adults comfortably with fuel efficacy on road off road and with such pricing, I think Innova will be extinct soon. Beware Toyota's and Hondas from Japan India's Mahindra will rule the world soon.", "I bought Marazzo m2 last week. It is really silent and while driving on the highway to my surprise I got more than 20 km/l of mileage. I did not feel any stress after 300 km continuous ride. Good one.", "The seating area is awesome, having a lot of space in this car, my height is 6 feet that's why I can't adjust in any car easily but this car is really great for its space, comfort and look. A really good car. I love this car.", "Mahindra Marazzo is a very nice and comfortable vehicle and would like to appreciate the designers and development teams.I bought this car after a lot of comparisons and found Mahindra Marazzo's best car among all compared cars. Really very happy after delivery.", "The engine is powerful. The steering responds well &amp; you don't feel like you are maneuvering a big car. The large windshield allows lots of sunlight and it becomes uncomfortable. I felt that interiors should have been soft brown, as beige will get dirty.", "Awesome Experience: It sails on the Road. It's smooth and Silent. You can take it up to any speed and it won't make any noise. Grabs attention on the road of every other car driver. Gives out a fuel economy of 17.3 on the Highways. Already done 1100Kms in 10 Days and I am in love with the Marazzo. Highly Recommended.", "Good performance of Mahindra Marazzo, new car mileage of Marazzo is poor and the Marazzo's road performance is good, air conditions and cooling is superb and interior features and design are stylish and the hopper hand brake is good. Marazzo is a high class vehicle.", "It's amazing, superb and in this segment most comfortable car for a long drive &amp; also the city drive. I am so happy. I purchased this car, no doubt this is the best car.", "Dream car for all car lovers and awesome looking and thanks to Mahindra for the perfect MUV.", "Very nice family car. Very silent engine along with the very nice features and very good pickup.", "It looks like a very big car, it's look is simply superb slightly different from other cars, it has a large seating capacity compared to other cars among these variants, It's Good and it is very comfortable for a big family.", "Mahindra Marazzo is a good car, its suspensions are really great when we touch 100 KMPH it goes as smooth as a shark and silent as a shark. It is also giving good mileage in the city which is 12 KMPL and on the highway, it is giving 15-16 KMPL. ", "It's a fantastic choice for Indians to drive like a smooth and silent car. Designing is mindblowing. It's the best choice for India.", "Excellent car with beautiful design. Very good performance.", "It is a perfect car by Mahindra and the best thing is it is a value for money car. Great car at a very affordable car.  ", "Marazzo vehicle is the best and smooth vehicle, comfortable multi-utility vehicle and also it's exterior and interior features are looking good.", "Good car. The interior and the exterior are good looking.", "The best car I ever have seen. When I sit in this car I feel very comfortable. I have bought the M8 model of this I feel this much good that I can not express my feelings. Thank you, Mahindra for building such a good car.", "Superb car, very spacious and comfortable, the Ecosystem is very helpful to maintain the speed and average.", "After a lot of speculation and apprehension finally, I bought my new car \"Mahindra Marazzo \".. And I m also satisfied with the quality I get because in this price no other car can beat Marazzo. The ride quality is really very good. Driving is superb, easy steering, gear transmission is smooth and comfortable to use and other functions of ...", "Mahindra has always done something different. These people have the best understanding of their existence in the Indian market.", "Mahindra Marazzo is very comfortable car for a family,very smooth in driving and also very spacious MPV car.It has a 4-star level of safety features. I LOVE IT.", "Ease of drive, handling is awesome, comfort, spacious with needed safety and features. Best in the segment. ", "Marazzo is a beautifully crafted car keeping in mind the quality of ride for the passengers. The ride quality is too good and as far as the cabin noise is considered it's far better than petrol cars. Having a diesel engine under its hood and having a quiet cabin is a perfect match of the refined engine and good insulation On the mileage front witho...", "A very nice look and refined engine. No noise in the cabin and safety features are also good.", "Very nice look and a very refined engine... The crew cabin is a very silent Safest car of Mahindra. Safer than Scorpio.", "The driving experience is too good, truly loved the car, very comfortable, smooth and speedy vehicle.", "It is a great car. Looks are very beautiful and the engine is very powerful. Pickup and mileage are also good.", "No.1 car in its segment. Best in its class features with smooth drive and best mileage. It's a value for money product.", "Excellent Car. Undoubtedly best in this range. Excellent Mileage - 18.5 in highways with full AC superior comfort - Best in class suspension. Drive quality - smoother than butter. ", "The car is very comfortable and also delivers good mileage.", "Really awesome car. Packed with safety, comfort and luxury. The mileage is also better than other cars in this segment. Car is packed with aeroplane AC style.", "Just super, my wife and kids love sitting in the car, wife describes sitting in the car as sitting in luxury AC bus, comforting. Good milage. Regarding engine capacity, it doesn't matter for my use. Its a perfect family car.", "Best in the segment at this price but interior plastic quality can be improved. Mileage reduces to 12 kmpl after 10000kms.", "Mahindra Marazzo is the best family car having huge space With the best comfort and effective fuel efficiency. Great in terms of looks of the vehicle.", "It is an excellent car light steering, good feeling, spacious car and much more but there are some cons with it like pickup and low power on 2 and 3 gear.", "I have a Mahindra Marazzo I liked this SUV, it is a 7 seater car. Recently, I drove 650 km in 10 hours with my village and it was amazing to run a total of 2000 km. I would like to say to all Mahindra lovers, the best option is to drive in SUV 7 seater, trust me, you will forget the Innova Crysta.", "Have been using the SHARK for last 6 months...excellent vehicle to take your family out and to relax on a lovely date..makes the whole driving cosy, silent, and smooth.. Be it a family get together or relaxing weekend friends chat it'll all come alive I a Marazzo Ultimate, seductive, and cool driving is what ...", "Mahindra Marazzo is super sturdy and best for highway. It is recently driven to put behind all cars on highway with ease with no engine sound inside the cabin.", "Mahindra Marazzo gives excellent performance. This car is value for money. It has large boot space, best a.c, and smooth handling.", "Awesome even on hills. We had a trip to nainitaal, no one felt tired due to ample of leg room. AC also supports each and every one. As per my experience and expectations this is a very successful model by Mahindra.", "I bought this car before three months and It impressed me in all the aspects for which I chose it and they are 5 \"S\" which made it my final choice against its rivals Space (Comfortably Drive with 8 Adults with long journey), Safety (ABS, EBD, Dual Front Airbags), Suspensions (Excellent over bumpy roads), Stylish and smoothness in&amp;nbs...", "Nice car with more space and comfort. This car is secure with good safety features, best pick up and nice boot space.", "I like the sitting arrangement of my car and the AC really works great. It's really cooling and the main thing is I like the big space which is very comfortable for the long journey n the car runs very smoothly like a butter. The looks which Mahindra company started designing is really awesome, good metallic finishing of the car and nice handb...", "I am very happy with this car the Mahindra Marazzo. seats are very comfortable and the dashboard is stunning and the overall looks are awesome.", "Mahindra Marazzo is a very comfortable and spacious car. The air conditioner is very powerful and it has a low maintenance cost.", "Mahindra Marrazzo best and the excellent car my first new family car is Mahindra Marrazzo M6 to compare Toyota Innova so costly Mahindra Marrazzo is my budget full space car big family car I love this Mahindra Marrazzo.", "My experience is awesome in this car. Total value for money. Power handling comfort is wonderful. Marazzo is for those who can't afford Innova and don't want to buy Ertiga. The only problem is like ac blower sound is a little noisy.", "Mahindra means safety and great service. It's very comfortable with more legroom and headroom. Interiors and exterior graphics are amazing. Best for family outings and picnics.", "I have Mahindra Marazzo M6, which is really value for money. As compared to its competitors, it is good among all. It gives premium feeling during driving. If you want MUV then I recommend this to everyone. It is a 4-star crash test rating car. I purchased this car at 16 lacks (on-road). I know in this price segment I can buy Maruti Ertiga but...", "This car is very smooth and comfortable and it gives me great mileage. Overall had a great experience with this car.", "Mahindra Marazzo is basically a family vehicle. It doesn't have an automatic transmission system. Looking at the fuel efficiency it's a good vehicle.", "Very bad experience with Mahindra Marazzo, it always creates noise. It has a poor engine. The engine is not good need to work on it.  ", "I had brought Mahindra Marazzo,  the car is having very smooth steering and gears, pick up after rpm touching 1750 is superb. The car is a good family car at an affordable price, driving comfort is superb, pick up is excellent, all internal features and interiors are good. AC is superb. The boot space is very less, the back shape of the c...", "I took my Marrazzo on 8th November Deepavali day .now covered distance of around 2800 km.I liked the vehicle and I am happy to purchase the good things are interior space , suspension, comfort ,a.c, and steering is very smooth .I got mileage 16.3 in my Bangalore trip including city drive in traffic around 650 kkm.don't worry about 1500 cc it is eno...", "Really the car comes with a full driving compact like you have the throttle of a beast into your legs the stunning design the edges cuts the air the fully functional interior for safety and comfort the car is very impressive and worth to bye", "This is a very good family car with lots of features and space. It is a competitor of Toyota Innova Crysta. Marazzo is more spacious than Toyota Innova &amp; more efficient than Maruti Suzuki Ertiga. A person will be enjoying driving Mahindra Marazzohs car than Innova crysta as innova's ride full load is tiring.", "Complete family car idol for kids and grandparents. Matching all benefits with its leader which is 10 lakh higher in price. Torque, mileage, BHP outstanding. Seating is better than other options available including the biggest competitor. Value for money. Indian brand can give competition and now ready to export. Thanks, Mahindra. Keep it up.", "Marazzo is so far the best Mahindra car ever. The transmission is smoothest among any other cars in this segment. It has many other best in class features like 3rd-row space, premium dashboard, build quality, mileage, and many more. It also has the best NCAP rating in this class.", "Wow! what an amazing car it is. Build quality and the interior is really awesome. Thank you Mahindra for Marazzo.", "I did test drive today. Great vehicle. Lots of frills inside and outside of the vehicle. Powerful and easy comfortable drive. Indent buying in 2019. Only worried for after sales service and resale value.", "Some may think MPV segment is shrinking due to the demand of other cars in the different segment, but carmakers are in no mood to pay heed to these rumors. Mahindra has recently unleashed its first-ever MPV for the Indian market with the name Marazzo. The car slots between Maruti Suzuki Ertiga and Toyota Innova Crysta. I was also searching for an M...", "This is the best car in segments because of size like Innova average good than Innova and not small like Ertiga and to more variant available. I have m2 variant is best to the road trip.", "Its a spacious and comfortable car to drive  spacious car. Very comfortable to drive. Had to shift quickly within the gears from 3 to 6 between 40 to 70 km. Could have given more threshold to shift the gears.", "I took test drive of Marrazo and I liked this car for few reasons. 1. Spacious 2. Stylish look 3. Lots of features at best price 4. Real silent and smooth riding quality but if I didn't mentioned the actual lag in this car then it will not be useful for people who are planning to buy this car. Here are few drawbacks. 1. Not enough power in engine, ...", "This is a good Family car with a very reasonable cost &amp; Interior also nice &amp; looks muscular as well if We talk about the exterior looks.", "The new strategy of Mahindra which is launching 'Facelifts' under name of 'New Cars' is just not enough. Cutting it short and simple: 1) No AT in whole range. 2) Looks like a Van and not an MPV (New Ertiga looks even better) 3) Cramped third row, just a namesake 4) Better options at this price point, definitely HEXA 5) A 7 Seater which is Front whe...", "This is ac perfect car for big family for comfort, style &amp; comes in budget as well as well. I have driven 7000 kms &amp; I am not facing any complaints &amp; I always get people admiring my car about looks.", "Its like a complete package of SUV and family car its much spacious then Innova, Crysta and Ertiga. It's like one of the most stylish muv. Its price is worth its comfort level . Its sound system is not that good but its fine..", "Recently purchased Mahindra Marazzo from Koncept Mahindra in Gurgaon. The over all experience with showroom was excellent. So far I have driven my M8 for around 300 KM in both within city and on highway and following are my feedback. This is my first experience moving from small petrol car to MUV of Diesel. Pros - Very good grip on road Good respon...", "Good and spacious car with lesser price, it is much more comfortable than Innova. So why should one go to purchase Innova.", "Best car I had in my life so spacious why you need to buy Innova Crysta when this is here with lesser price and more wheelbase than that and so elegant interior as well as exterior and has a fresher design.", "I have a big family and hence I need a large car. I have owned the Toyota Innova in the past and was looking for something new and fresh. I?ve heard positive reviews of the Mahindra XUV but it just didn't click for me, perhaps because of the way it looks. Then I got to know that Mahindra is coming up with their new Marazzo. So I decided to wait for...", "I am the owner of a Mahindra Marazzo M8, the top spec variant. If you want a car for 7-8 people and can not afford the Innova, Marazzo is the car for you. The 1500cc engine might sound a bit underpowered for such a big vehicle but when we go out on a trip with luggage at the back as well, the Marazzo doesn't break a sweat. The air conditioning is a...", "Superb car, value for money, best family car, look, style , power, everything is good , pick up is good, comfort is more, over my family we loved it.", "Good car at decent price. Great engine refinement and better Ergonomics. Let wait and see how it takes over MPV market . Innova always ahead, but this doesn't trails much. Innova is good, but Marazzo is great, better, decent for this price . Mahindra has done quiet a great work. ", "Mahindra is a very good car its features are excellent and it's new shape is also too much very good . It is good in handling also. I drive it 100 KM very comfortably.", "I had done test drive at Salasar Thane Mahindra showroom it's great experience to drive Marrazzo. Since last couple of years I am looking for perfect family car which can accommodate 7 to 8 people's. It's right one no doubt to say. Refined engineering, softer suspension, smooth pick up and required all important features of family car. I am plannin...", "The Marazzo is a value for money car with all the necessary elements. It is spacious, has features, is comfortable and most important, it doesn't burn a hole in your pocket. Some people may criticize it for a small engine, but trust me it is sufficient for most of your requirements. Obviously, you can't compete with the Innova or a Fortuner on the ...", "Mahindra Marazzo feels good as the refinement is good and nice 300 nm of torque with 121hp. The comfort is superb and the surround cool techno is really amazing i have a suggestion if the position of DRL will be good if it is in the head lamp unit", "This is actually a good engineering product from Mahindra which is known for rugged and macho products like Scorpio, Bolero , Thar &amp; then XUV 500 But the ruggedness and the muscle came along with bit of roughness &amp; harshness which all M&amp;M vehicles are associated with. But Marazzo seems thoroughly engineered product with new standar...", "I have the M8 and that is superb MUV great comfort to entail 3 adults in back seat. Great suspensions and spacious. Only the pick up is little low but that ought to happen with 1500 cc engine but that is a issue only in 3rd shift or so for a while. All in all a great family car by Mahindra.", "Only two days ago I got the delivery on my very first car, the Mahindra Marazzo. It is really a fun car to drive, I really enjoy taking my family and friends for a ride in it, the steering is smooth and the overall comfort level is high. We are a family of seven, so it is the perfect car for ous. The third row AC is very effective and the mileage i...", "Interior is beautiful with good mileage, there is no engine noise. Sometime you will feel that engine has stopped and need to restart. Cooling of A.C. is  good, it is very spacious with good suspension. It is simply fantabulous and a marvel from Mahindra &amp; Mahindra stable.", "Good ride quality, Good amount of Boot Space, Good Performance, Nice Clutch, Smooth Gearbox, Luxurious feel interiors, Silent Cabin, Good Turn radius, Ground clearance and Wheel Base are good, Nice Suspension Agile Steering, Comfort Seating, Good Mileage, Spacious Cabin, Nice Infotainment System, Best Family Car, Top of the MPV segment.", "In terms of design and look, Marazzo is different from other brand's model within this price range. Being a 7 seater MPV, engine vibrations are very less and the clutch is surprisingly very light as compared to other which makes it easy for long distance journey. This car can be called as \"perfect family car\".", "Outstanding look with reasonable price brought below the cut off for premium for heavy vehicle deserved hand shaken. Very nice interior as well as exterior apart from performance adds another golden feather on the crown of Mahindra, a indigenous car manufacturer. Thankyou  for the new design...", "Pickup of car is fabulous that's what expectation of good riders. It is one of excellent product having excellent torque to pick up the car. Suspension is very nice comparing Sedan or any other SUV.", "This is a very nice car and everything is very good. Mainly the engine sound was very low. This is the best car in the segment compared to others manufacturers. It will rule the market like Scorpio. Thanks to Mahindra for launching this car.", "The Mahindra Marazzo is a premium product which is silent, smother, ride quality is better than Innova Crysta and Hexa. The mileage is about 19 without AC. The best quality ever in Indian cars.", "It is the best car in this segment. Mahindra doing best it recover lose of Xylo car. I think big tyre get stability on road and off road. I love the engine, as it works always good. I think it will break all record of selling, If you want to enjoy an SUV car and family car for both usage, then it is a good car.", "Yesterday I got delivery of my awaited mpv when I drive it is super marvelous what a best suspension really amazing and its riding quality is marvelous and super soft steering and what a astonishing interior really it is a value for money.", "Those who want MPV in SUV style like looks, performance, space and atmosphere inside vehicle etc. This vehicle will surely fulfil your requirement. Pros - Sufficient length, width and height. Sufficient Engine capacity, 7 seater car, SUV style. Everything is excellent on the car. Only con is it didnt have push button start/stop featu...", "The model is based on the Shark, Mahindra Marazzo is one kickass MUV which is feature packed for this price point. It aims to break the long run of supremacy that Innova enjoyed so far in this segment. The low cost of maintenance and rugged working of the machine makes it a possible favourite of the tourism economy. I'd love to get my hands on a wh...", "As I took test drive yesterday it was very smooth &amp; silent. 120 bhp power with 6 speed gearbox experience was awesome. Suspension was fabulous. I booked it &amp; now I am waiting for delivery. I think it will be best buy. New air conditioning system for rear seats also seems to be exclusive in this product.", "I am yet to test drive this new offspring from the Indigenous Mahindra. Its specifications &amp; features are really impressive and sound value for money. This Car may face competition from its own brother TUV 300 Plus which has more power, fuel efficient and rouged. Front looks seems to be pale for car of this class. Lags in terms of Ground cleara...", "A great car here ,put up by mahindra in the segment . An amazing choice for the people who are thinking for an mpv. A lot more cleaner exterior as well as interior language . Feels quite a more premium than the sluggish ertiga. Here is the mpv what the people were waiting for...", "First of all it's equipped with front dual airbags, a passenger airbag off-switch, a speed sensitive door lock/unlock feature, ABS with EBD and brake assist and Isofix child seat mounts as standard equipment, this is why I love Mahindra, either go for lowest model or highest one, you'll be safe. A 1.5-litre four-cylinder diesel good for 130hp and 3...", "Waiting for Mahindra Marazzo to launch, I have eagerly waiting for this since the announcement of the MPV from Mahindra. Currently, I am using Mahindra Xylo, and it's spacious, but the performance was not up to the mark, hoping to get some better product from Mahindra end just like XUV500.", "The upcoming Marazzo certainly looks impressive. The interiors feel premium and comfortable, and it is also expected to be loaded with features. With an expected price of 10 to 15 lakh, it is going to threat the sales of Innova Crysta as now the Crysta has become very expensive."]}