{"0": [], "1": [], "2": [], "3": ["The car is an attempt to keep the rural market for the classic Mahindra still open as a lot of people don't have faith in the new Scorpio N. Long waiting period for the new Scorpio is also a reason the classic was launched (or relaunched because it looks the same). However, the Scorpio is loved by people across India and thus the new classic Scorpi..."], "4": ["Good off-road vehicle. Front seats comfortable than the back seats, and suspensions are best. Style is incredible, with mileage better. Value for money car.", "I have been using Mahindra Scorpio for the last 15 years totally satisfied with the overall performance. Though a two-wheel drive car, it has great capability while off-roading. The features are decent enough. ", "One of the best SUV in this price segment. Best suspension on the rough road. Mileage is also good maintenance cost is also affordable.", "With good eyebrow-like headlights with a halogen lamp and with two sets of Day Time Running Lights, the first of its case. A little bit of tweaking is done with the front grille which gives rowdy look to the car. However, two things that are a little disappointing in the new Classic are the bonnet scoop is not functional and Scorpio written on the ...", "Mahindra has launched its facelifted edition in the price range of INR 9.29-16.01 lakh (ex-showroom, Delhi). Available in S3, S5, S7, and S11 variants, the new Mahindra Scorpio can be had in three different engine options - a 2.5-liter putting out 75PS/200Nm mated to 5-speed manual transmission, a 2.2-liter. ", "Good off-road vehicle. Front seats comfortable than the back seats, and suspensions are best. Style is incredible, with mileage better. Value for money car.", "It's best in class car in terms of performance, maintenance, and road presence. The gear shifting, handling and torque performance are best at this price.", "You can go ahead and buy the Mahindra Scorpio. It has got a muscular stance, a wide and spacious cabin, a powerful diesel engine, and good riding comfort. Mahindra Scorpio is a very well-designed SUV that requires minimal maintenance to keep it running smoothly. The users have to consult the maintenance manual that comes with this SUV to keep it in...", "Excellence car in SUV. One of the favorite cars in India. Pickup of car is best. Queen of the road, top-class features with good mileage. Good drive grip in rural areas is rugged and reliable. The Scorpio will guarantee you peace of mind over rough terrains. The Scorpio is also a reliable SUV that can keep going on for thousands of kilometers ...", "Mahindra Scorpio Classic gets the same design for the 17-inch alloy wheels as the existing Scorpio, but it now gets a diamond-cut finish. The car gets a bunch of updates to improve its handling. It comes with all the required features which make you feel comfortable and safe.", "No one can beat the design of the classic Scorpio. It looks more muscular than an old Scorpio.", "This car comes at a low price with new features, safety, amazing comfort and new changes amazing. ", "Best SUV ever, past 10 years of driving it has great performance and is the best mileage car in the segment. Looking fantastic and stylish.", "The new Scorpio looks awesome, and the power of the engine is also good. It is a comfortable SUV with great performance."], "5": ["Perfect car with the best looks it is a great car good in safety with amazing looks, it is a really good choice in SUV.", "This is an amazing car with awesome features and great drive quality. It has a powerful engine that is good for off-roading and overall performance is really awesome. \n", "The new Scorpio security is better than the previous Scorpio, and the looks too good. Its features and performance are also good.", "Very Strong and outstanding performer in all aspects. Excellent safety features, powerful vehicle, instant pick-up, spacious.", "The looks of this car are great from the inside and outside. The car has a lot of safety features. You can go anywhere with this car, the infotainment system is great and the wheels are great. ", "The new Scorpio security is better than the previous Scorpio and the look is too smart. Its features are amazing and its performance is also good. ", "Mahindra Scorpio classic is a very comfortable and low-maintenance car. This car's suspension is very good.", "This car's performance is very good, and the overall experience is very good.", "Mahindra Scorpio is the best SUV from Mahindra. It has a robust body, all style and comfort with immense power, driving S11 for last 5 years with no maintenance till date, done almost 70000 km, overall it is best in its segment.", "Mahindra Scorpio Classic gets the same design for the 17-inch alloy wheels as the existing Scorpio, but it now gets a diamond-cut finish. The car gets a bunch of updates to improve its handling. It comes with all the required features which make you feel comfortable and safe.", "The best SUV in the segment with cost-effective and comfortable. The best on hills and off-roading.", "Mahindra Scorpio Classic is a very good car. I like the power of the engine and its mileage. It is very good for off-roading. ", "Excellent design, massive upgrade. It is worth going for this brand new Mahindra Scorpio classic. It has good performance on road and ground clearance."]}