{"0": [], "1": ["Very bad car, no safety. We can get more good options at this price point like MG Hector or Creta.", "Jitana kam mileage batate h utana deti nahi h. Esa kyo hota h Mahindra Scorpio achhi h par mahnagi h.", "Purchased Scorpio S9 on 15/06/2020 since I purchased this scrap after wasting my hard-earned 17.5lakh. I am been mentally physically torched by Mahindra from 15/6/20 till. I am putting this review my car went to their workshop for more than 5 times. No response from team moreover when called to their VP he said I am not your servant. Same on you Ma...", "Good but interior exterior things zero so Mahindra teams need more upgrade to this Scorpio vehicle for customer satisfaction.", "I used Mahindra Scorpio from May 2012 to Jan 2020, Recently I sold this car. Very good exterior and interior design &amp; best economical cars in SUV type. Good experience for long drive and hills area. Personally I feel Scorpio is my family member, In the future, I will purchase Scorpio only. If anyone wants to purchase SUV type car, I recommend S...", "Mahindra Scorpio is the best SUV in 7 seaters powerful engine, soft fell dashboard and expensive interiors styles, alloy wheel, extra-large space in the cabin, front and rear ac.", "The wheel nuts of Scorpio vehicles are of very very poor quality. There is no way you can open them in case you want to change the tyre . All people report this very common problem and a serious security issue.", "My car is Mahindra Scorpio s7plus 140 bhp I buy my car on 31 December 2019 and its very good car and comfortable car.", "Best car of my life I have an Innova and Baleno else but my Scorpio s11 is best. The design is supreme and speed is awesome must have the car.", "I have been driving Mahindra Scorpio for quite some time now, and for me, the best thing about the SUV is that the car is exclusively designed for the Indian road conditions. I enjoy everything about the car since the day I bought it. Mahindra Scorpio is the proven vehicle across some of the toughest terrains and is better known for its rugged and ..."], "2": ["Not best but good. The back seats are not comfortable. The price is also a little bit high.", "This car is not good it looks are really very aggressive due to its large design. This won't be suitable for city driving. Not a safe car, no safety features not recommended.", "Scorpio a big giant from Mahindra. Love the exteriors but very poorly designed interior also the material used in the interior is very poor... for car of approx 16 lakhs...", "The power I enjoy. Comfort for front seating only suspension to wobbling effects Safety is good. A perfect Indian.", "Good but need lots of important as the comfort level are not so good and when we drive on a road which is not good it does not give good performance", "The maintenance cost is high, the safety rating is zero, very poor build quality and the colour is also not good.", "Only for roughly used, comfort missing, it's good for off-roading, big size tires, better ground clearance, overall, it's a good car", "I used Mahindra Scorpio from May 2012 to Jan 2020, Recently I sold this car. Very good exterior and interior design and best economical cars in SUV type. Good experience for long drive and hills area. Personally I feel Scorpio is my family member.", "The overall styling is outdated. The safety is almost not comparable as other price range rivals. Mahindra should update the Scorpio, not in terms of design but also the features, safety and the shock absorber.", "Well, I think that the old look was more masculine and more appealing than this facelifted car. The handling is also not as good as the earlier one. The earlier model looked like you are driving. American muscle cars, but this one looks like more of a matchbox design. The braking system is not as sharp as the earlier model that model used to like t...", "Pros: 1.Performance is best in class. 2. Comfortable than many SUVs in the segment. 3. 7 seaters 4. Mileage is somewhat better than many 1.5cc engine cars. 5. No speed lags on lower speeds. Cons: 1.Lacks major safety features. 2. entertainment features. 3. Need massive interior upgradations. 4. Minimum 18\" Alloys are required 5. Lower the body roll...", "I've been using the Scorpio CRDe engine model for more than 6 yrs. The car has a 2.5-liter engine best performer even in the toughest road the beast did it works. The giant looks and massive boot space with the best visibility while driving. But the fuel consumption is high and the gear transmission is not smooth, feel less comfortab...", "The car is too uncomfortable to seat especially for old people. The pickup is very good but when it comes to bad roads, it's horrible. Mahindra should improve the suspension for the hill areas and also interiors are not well fixed.", "There is so much body roll that I feel like I am in a boat and sailing on the sea. Mahindra should work on its body roll.", "Seating comfort is a major issue, High-Speed stability is a concern area.", "Felt like riding a lion but gear shifting is hard. You need not change to 3rd gears as the vehicle still goes on 40kmh. Good powerful engine.", "The perfect SUV with the perfect engine at a fair price", "In 7 seater SUV Low Maintenance car compare to other 7 seater SUV. Good in power and muscular looks is awesome spacious. But poor in comfort Like AC, not so powerful and shock absorber. Worse still it's not even safe in a crash. Low safety features. Although good for rural areas and height is also good.", "Superb car. The look is very attractive. All the accessories are so good.", "Mahindra Scorpio is the best vehicle, you can drive anywhere and such a smooth steering and comfort seats with all the thing you need while driving but don't expect too much, its still not a Ferrari not a Limo, but if you want a car which can go anywhere, this is the perfect car for you.", "Mahindra Scorpio has great comfort for long drive moreover it looks nice in zed black color.", "Look and Style : I am big fan of sports utility vehicle and last year I bought Mahindra Scorpio. I am very much satisfied with its overall performance. The stunning and massive exterior appearance provides a complete feel of sporty four-wheeler. The jazzy body graphics and stylish body curves make the exterior look of the SUV astonishingly class ap..."], "3": ["It's a good car and also my dream car but the price is too high. I like Scorpio S11 but I cannot afford it.", "Good pickup and the engine is so powerful. The Design looks marvelous but the interior is average. Overall It is a fantastic car.", "Like a powerful beast. Most loved car in the villages.", "The best SUV you can in India, It will never disappoint you and always provide you a great performance and the car is also a great value for money.", "Automatic transmission and 4 wheel drive features are missing in car. These additions in Scorpio would scale up the sales. I am eagerly waiting for new the Scorpio with Automatic transmission and 4 wheel drive option. Currently, the  Automatic transmission is necessary and not an option considering heavy traffic in most of the cities. It makes...", "Very poor service of lohchab Mahindra. Anytime my Scorpio shows technical issues. Very poor service of lohchab auto Rohtak and Bahadurgarh.", "Amazing SUV by Mahindra India  Smooth operation, tough in power, looks so strong, exellent mileage.", "Mahindra Scorpio is my dream car because I'm the person who always wants to buy the car which can take my feelings to a standard and high position and when I ride my dream vehicle it always gives me next level feeling every time. When I look at sedan other mini SUVs and SUVs I always feel that I have best. Which make me high and others positio...", "Best car comfort level is at the heaven, best features available and heavy power with the large tires and suspension best ever car, especially for the family all are happy with the Mahindra Scorpio, we all loved it. Scorpio is really muscular best in its class and value for money the only problem is its bouncy ride but it gives you an attractive lo...", "Amazing and stylish sports SUV. One of my favorite SUV. I always love to driver Scorpio for long and short drive amazing driving experience.", "Mahindra scorpio gives a great perfomance. Best in suv car for youth. Very comfortable while driving. ", "Mahindra Scorpio is a very comfortable car. It has low cost maintenance as compare to other suv cars. When it is on the road there is no engine sound.", "This is my experience for Scorpio. It is sporty and powerful car it looks nice and comfortable SUV.", "I feel very comfortable after sitting in this car as there is a good space. It is the best 7 seater car.", "Beautiful cars and no problems top of cars available and all guys. Mahendra Scorpio that's it good to see.", "Nice but can be much better.. need to more comfortable space and security.", "I just loved Mahindra Scorpio. I have Scorpio S11 2017 diesel variant. It comes with a fully loaded SUV and road appearance was amazing. To be truly owner mileage issue but performance gives you vibes. The power was truly amazing.", "Overall good performances but comfortable is not very good but it is good and mileage is the good and main focus of real SUV power very good. I like this main reason of purchasing Scorpio is loving this feel the real SUV for driving Scorpio.", "Good SUV in low budget. Good mileage and low maintenance. Very comfortable for a long-distance trip. Variety of colour.", "It is a fabulous car and perfect for long drives, but not so suitable for the city and the mileage is also average.", "It is in fact a very good SUV. If you have a good budget. Mahindra Scorpio is an SUV for buyers who prefer a rugged vehicle with a butch stance and not a sleek and curvy vehicle. Mahindra has regularly updated this capable SUV with improvised bits, both technical and cosmetic alike. You can go ahead...", "This is a suitable car for the family and feels good and safe in the car.", "The performance of the car is awesome with great design and best in performance.", "It has a very tough look in exterior as well as the interior. Since 2002 Scorpio knows for its toughness and power and it is also worthy. It is a good offroader in a budget. Apart from that the service of Scorpio is affordable. But it also had some negative points and that is. Safety is not as good as we think as we showed in the NCAP test. The car...", "Highest selling because of its looks. And performance. People love their presence. That's why they put their amount on this machine.", "Scorpio is really good car but comfort is not good and ride and handling quality is better I love Scorpio.", "Bubble at high speed, good looks, good drives, mileage is a bit low, and seating capacity is good for Indian big families.", "When I was driving the car I fell like sitting at home. There is no problem each and everything must be properly.", "Nice car and the car is good for the new buyers.", "Mahindra cars are always strong and attractive. This is one of my favourite car however I also recommend to try XUV 500.", "Performance of the scorpio is very good. But fit and finish is very poor. Safety of the vehicle is also poor", "For a 15 lakh price, the Mahindra Scorpio car doesn't provide a remote key. Where a 15 lakh price from another brand you gets a keyless entry, climate control, etc", "I purchased Scorpio VLX in 2010 and the SUV to be one of the best in its class. In fact, at that time, there was no SUV as competition to Scorpio at that cost. The maintenance cost has been very minimal till I crossed 80 K. Thereafter, only I experienced some break down such as AC leak, clutch plate replacement, COOLANT leaks. But these things happ...", "They should update its steering as well, still, body sounds are there when you are inside. I mean vibration sounds!", "It has no comparison all cars fail against them love from till 2002.", "This car is so maintenance costs. This car is so powerful car &amp; looks are great.", "This car has a great combination of power, style, and mileage and has good resale value. The maintenance costs are low compared to other cars in the same segment.", "Scorpio is my dream car, its a rough and tuff and strongly made for typical Indian roads. The new generation of Scorpio is very beautiful and aggressive in looks. It is like a beauty and the beast combination. The performance is good but the mileage is a bit disappointing.", "Well, my car is Mahindra Scorpio model is S6+. It is not so comfortable, but its performance is too good. If one has to go for a powerfull performance on the engine then I should say that Scorpio is one type of a vehicle. The style is a matter of fact that it is luxury and the interior is acceptable for me. The mileage is proper for me. The size of...", "I am the owner of this car from the last 3 years... It's powerful and reliable, but it's not as comfortable and luxurious as of the Innova Crysta... ", "This is the best SUV in India and its power and performance are very good. Interior and exterior are very stylish. I'm have driven the car 5000 kilometres and this is very fuel-efficient. ", "Scorpio is one of the highly loved cars in India. The road presence and exterior design are amazing that play a major role for Scorpio. Overall quality is good cabin quality and features inside the car are fine. Under the hood 2.5-litre engine performance and design of vehicle hides the cabin quality and some segment class features like 6 airbags 3...", "Very good car but features was not a extraordinary to other car like music stereo but luck ways very good.", "Very good in rural areas but least on the style in big cities... For farmers, it truly works due to roads but good city people need styling in this price and good interior.", "I have Scorpio S11 this car is very nice and l use this car very roughly but after that this car gives nice performance nice pickup we drive this car in the desert area and mountain type area. We drive this car roughly road.", "Nice car but safety and body roll make it worse. I hope in future Mahindra will do it better... ", "My experience in Mahindra Scorpio its comfort level is very low and upgrading a Scorpio for a new generation.", "It has a very tough look in exterior as well as the interior. Since 2002 Scorpio knows for its toughness and power and it is also worthy. It is a good offroader in a budget. Apart from that the service of Scorpio is affordable. But it also had some negative points and that is safety is not as good as we think as we showed in the NCAP test. The...", "Great car in terms of road presence, looks, and feel with good performance but it lacks a bit in the comfortable driving experience.", "Best car for off and on-road purposes, little less comfortable, but very good in performance on road with a heavy body. ", "Overall a good car but the price is high. The car is comfortable as per others, the drive is good in off-road and hill areas.", "This car should be of 9 to 12 lakhs its cost is too much in 16 lakhs. We can get more features and future cars. We can get at this price like Kia seltos. We didn't get the great features and safety at this price it's not the car of our expectation.", "Superb and comport long rides and family friends. it's very enjoyable each every one compirt fell stress-free.", "I like the black colour one, its seem nice look, strong body and also feel like a king in driver seat is very comfortable .hence must buy Scorpio black colour thanks......", "Pros: 1. Good off-roading ability 2. Massive Power 3. Decent acceleration 4. Good ride comfort Cons: 1. Mileage", "When the car statrts, it feels so good, as their is no engine sound noise and the ground clearance is also very good.", "It is a car that most of us would dream to buy. Whosoever have a real craziness for SUVs will surely consider this car. It is people's first choice. It has the good build quality and rigid structure. Loaded with features but misses out on some tweaks like the auto-folding mirrors and a sunroof. The ride quality of Scorpio in punchy and feels comfor...", "The Mahindra Scorpio is one of the best off-roader and on roader SUV. It has the best grip and power for all the road conditions. Scorpio is best suitable for the off-roader. In villages and in the rough road always Scorpio is preferred. In my opinion, Scorpio is really suitable for INDIAN terrains.", "Amazing car comfortable, styling, safety, low maintenance cost, durable all over its a value for money car.", "Enjoy tourist place and so beautiful looking and comfortable seats and wonderful safety anyone first choice in car safety.", "Scorpio is a great car I ever have driven. The car feels like driving a bike. I had two old models Scorpios whichever awesome to drive. The maintenance of cars is very less compared to other car companies.", "Mahindra Scorpio is the SUV. I own this car in 2016 and It has been my partner in all my tours. Seats can be improved otherwise the car is fabulous.", "The good quality of the car and the mileage of the car is very good and the suspension is also good. Overall the car is good for driving.", "I like the black color in this looks good and in features this a very friendly car. You can take anywhere off-road either highway in those looks this beast is just awesome.", "The Mahindra Scorpio is one of the popular SUVs in its segment. This SUV is well-liked due to the bold and muscular look. Now the company is bringing the next-generation model of Scorpio. The new Scorpio, codenamed Z101, has been spotted several times during testing. Leaked pictures during testing have revealed a lot of details of the new-generatio...", "I experience Mahindra Scorpio of my friend it has good pick up as compare to another SUV in that price range. But one bad thing in that is its comfort. Its comfort is not too good I just request to Mahindra to work on comfort of their SUV because everything is a comfort we all need to be in comfort. That's my experience about Mahindra Scorpio", "It is a very powerful SUV one of the best SUV. I have ever seen it should improve its automatic gear shift and make it a CVT. It should be made more powerful and should get all-terrain to control its comfort should be improved. The best model is s11 all-wheel-drive it's the most powerful.", "The Scorpio Mahendra is good for any person good drive feel like a king The Scorpio Mahendra road king master.", "The experience was great but some issue regarding turning off the vehicle while speed is 70 - 90.", "Scorpio is a very nice SUV but the company wants to upgrade the interior like a sunroof and make the seat comfortable.", "This car is best for offroad driving and also smooth in city driving and it is comfortable for a long trip but their last row seat is not comfortable because this upon on rear tyre and when we seat we feel unconscious but its performance was best and confidence to drive on the highway.", "Scorpio is really strong car its torque helps a lot in hill area 7 seaters accommodate is goods enough for enjoyment in the hills area.", "If you see that the exterior of the car is straight unlike the Hyundai Creta which goes on getting broader as we go from the bonnet to the boot(in creta). The seating is good for people with an average height of 5.7,5.8 but if we talk about buyers above the height of 6feet their legs need to be adjusted according to the car not according to th...", "It's good for joint family... It's giving best cushion effect. It's very useful for elder members, they will feel very happy and beautiful journey in this driver.", "King of the road no doubt about that however now Mahindra are developing a wonderful car and past years. They were able to work on their engine in a wonderful manner however I think if possible Mahindra needs to work on cost if they are able to manage to cost they may be able to increase the sale.", "This is the most comfortable and stylish SUV in this price range..... S11, It is for everywhere means town village or else.", "Driving of car in the rough road and the rear door is not locked properly so the dust particles enter into the car.", "The feelings of Mahindra Scorpio are totally different from other SUVs. Specially, it has too much power, amazing ground clearance. I like it because it easily drives any highway in India or hills like Ladakh.", "Mahindra Scorpio SUV is a family tourer, great smooth handling on the curves, even the 2x4 is good enough for me. With 2.6 CC diesel displacement, easily can cross 160kmph. Mahindra Scorpio comes with the M-hawk engine. Mahindra Scorpio likes a monster car. Scorpio was a perfect SUV car for a family. But Mahindra Scorpio suspension was very ha...", "Scorpio which is a ragged car which sells more in India and nice offroading car and the car has poor quality.", "The vehicle is powerful but at higher speeds, the car feels bumpy, and the interior fit and finish is not that good. The comfort of the seats not good as well.", "This is very important of all-time favourite things and then we could have.", "Buying guides are so good delivery time is so good. But mileage is good but not very good. This car is my dream car Mahindra was a good service for all cars and the black color was so good.", "Super ground clearance and comfortable to travel for a long drive and its much easy to do offroad. Without any struggle, it is going in all kinds of road conditions and it is unbeatable to drive a car. I love the Scorpio and in the city around 11kms mileage and 14kms in highway mileage. It is nice to travel without any objection.", "Very good try by Mahindra Scorpio s11 top model everything in this car is good but it is not a comfortable car.", "The car is so beautiful and they had very good mileage and the car is nice", "Mahindra Scorpio. I personally have Scorpio s10 and I have to say that it is a very good car. The muscular look it has is different from all other cars. Its power is great. Great pickup with the turbo whistle. The comfort level is not that great, body roll is present. But it is a tough offroader. It is the best car in its segment.", "I like very best and very smooth and full safety .i like all of Mahindra cars. and I like another Mahindra car", "This is my favourite SUV car and this car has a royal look and this car is my dream car.", "Best car, I have ever seen and stylish with awesome performance. The car makes us feel like a king...with Scorpio.", "The after-sales maintenance costs are a bit high but performance is very nice and all parts are easily available, long drives are very smooth.", "A nice SUV. 7seater which gives you a pleasure to work on and anon. I like it because it is like a monster but with a sporty look. 🚐I trust it as my family car. We enjoy when we are going anywhere in our Scorpio. I wish to thanks the company for such a family wali car.", "Scorpio is the best SUV. Its best performance in all the roads highways or off-road. You must buy Mahindra Scorpio", "Scorpio is a big car, space, mileage is good, the body is durable and the lighting system is very good and charming.", "Very good car but one problem is that it is a very tall car and at high speeds, we don't have much confidence on turns we feel that our car will topple and we have to slow down the car and safety issues also. If we want safety equipment, we have to purchase the top model of the car but according to government rules. Now every manufactured car is ha...", "I have S5 variant, Not worth it at the price of 15 lacs. Lacking many features and the worst part is the services of Mahindra. It doesn't have a digital clock, it doesn't come with the infotainment system, don't have armrest which you can't even buy aftermarket. Middle raw passenger seats are very uncomfortable. ", "The household hero doubles up as a status symbol, although I still see the Dodge Charger when I see the front end. Surprisingly refined and efficient engine, Mahindra has come a long way. The ultra-popular car in its newest alteration has better ride and handling than its predecessor which was very roll-ly. No competition here really since all the ...", "The body noise started after 50000km. The body roll and the steering wheel is not up to the mark. Mileage is 10 km/l in the city and on the highway its 13-15 km/l. It started rusting after 50,000km-60,000km. My Scorpio is 2017 model and is running 70,000 km plus.", "Mahindra is losing the individual buyers, Mahindra Scorpio is the perfect car for family and individuals. They should offer in 1600 1800 and 2000cc options as well maybe in 6str 8str and 9 str options, also must include music system and multifunction steering in all variant. Then no one will stand in front of Mahindra Scorpio.", "Mahindra Scorpio is the best SUV for ruler area, Great comfort and mileage even in bad roads as well. Easy to maintain also the service centre is easily available everywhere. Good ground clearance, More legroom very affordable service cost under 10k, Good space for tall height person and at last we all know about Mahindra trust.", "Scorpio is a superb car and has a good engine and power. It has a huge amount of space and decent equipment list but it lacks in ride quality, ergonomics, and finishes. Mahindra should also offer at least 6 airbags. Overall, Scorpio is a good car and I think Mahindra will solve all its cons in the next generation which will be l...", "This vehicle is very comfortable on the rough road and it looks very gorgeous also its design is amazing.", "Mahindra Scorpio is a powerful and value for money car. This car is a very strong and very good car for long routes.", "Mahindra Scorpio is king in its segment. Best and all-rounder car under 20 lacks. I have amazing riding experience of Mahindra Scorpio. It has good interiors and exteriors. It has a top-class road experience. Nice seating experience for the passenger and for the driver. Top class road grip.", "Mahindra Scorpio is a nice car for long and hard roads. Their suspension system is very good and seating capacity is large.", "This is the best car, it looks and design is superb. It comes with various necessary features and the built quality is great.", "I love this vehicle so much. It has lots of offroading potential. I have participated in some off-roading events with this vehicle. I really enjoyed how she pulls me out off the dirt track. The new model of the Scorpio has some very good looks in the interior as well as the exterior. The variant which I had driven in the track was a 2019 S11 4WD.", "Good SUV with sporty looks and it is the best car in its segment. The comfort level is also good.", "Aggressive and royal SUV. I love this vehicle from last 10 years and I am planning to purchase the new model S11 again.", "The most powerful SUV named Scorpio is a very fabulous car. Too much comfortable and controllable, It gives you the best on-road performance.", "Driver Information System (DIS). Power Window Switches On Driver Door. Dual Tone Dashboard. Luxurious New Blue-Grey Interiors. Static Bending Projector Headlamps With LED Eyebrows. Futuristic Instrument Cluster. Sporty Steering Wheel With Audio And Cruise Controls.", "Amazing drive but lacks few essential features like a rearview camera and the cost at which it comes it should have that.", "Good at its own name, like its name it goes wherever to want...only problem you may face the rattling sound and high turning radius which may tense you toppling kind drive experience.", "I own a Scorpio S2. I purchased it in 2017 for about 12 lakh because of EMI. This car is not for a luxurious ride. The seats are not comfortable, 1 or 2 hours regular ride leads to backache. If the road is clean it's good otherwise feel vomiting. My next car is Range Rover Velar.", "Scorpio has always a royalty. If you are inside the car you feel the premium comfort.", "Scorpio is a good SUV but have literally no boot space I am having 7 seater king seats little bumpy and it is down from the front side and little up from back so when we apply brakes all the passengers seated come forward towards the front glass that is not good need to work on these and air noise come inside the cabin with so much noise need work ...", "I didn't get satisfaction by buying this. After two months the Colour started turning white to yellowish. Needed maintenance every month. I was distracted by its problems. I liked some of the features like auto lid open, well-designed speedometer, the interior was also good. ", "Mahindra Scorpio now comes with M-hawk engine and a glorious look and a comfortable SUV for damaged road and long road trips.", "The car is great in all aspects only drawback is no features as compared to other cars of the same price range.", "Same popular SUV package, now improved in the 2018 version. Robust, abuse-friendly build &amp; construction. Does aggressive front-end styling have a good street presence? The hawk turbo diesel is a jewel of an engine. 140 BHP tune even more. Finally gets a 6-gear transmission, although only on the higher variants. The Scorpio enjoys...", "Heaven for a middle-class people .look, power, seating capacity that is why Scorpio is the best SUV of India since 2002.", "Nice product of Mahindra but need some smarter designing such as - Must provide electrically operated ORVMS -Nees to work on the suspension while travelling on long route its give u a vibratory ride. - At this price range somewhere somehow product lacks - The 3rd Row seat need to be designed well - The dashboard to be reviewed, as in s11 having suc...", "The Mahindra Scorpio is a good car but the seating arrangement is not so good and the seat is also hard and small.", "It is a great car but only if you could do with the body roll. Mahindra should immediately address all the ergonomic issues in the Scorpio.., if they do that then it would be a great car. Speaking of the engine the common rail diesel engine, the 2179cc motor is a gem producing 140hp and 320nm of torque., Most of which is active in the bottom end., ...", "I'll keep it simple and sweet. Performance-5, Comfort-3, Driving Experience-4, Convince-1, (too many design flaws ex.- unaccessible bottle holder, faulty roof rail which causes water draining route through the front mirror) Customer service-5.", "I like Mahindra Scorpio very much and it's controlling is very smooth.", "Mahindra Scorpio best seller in the Indian market scope is best SUV in others compare.", "Best car in India as an SUV which has a very good exterior and interior which makes it stand out of other cars and is a very good off-roading vehicle which is trusted by most of the Indians.", "I recently got a chance to drive Mahindra Scorpio in an off-road rally and would say the experience was not very good. I have been driving SUVs for approximately 3-4 years and expected a lot from the Scorpio. The car has got good looks and you will be impressed by them. But the real thing about an SUV is its performance off-road and this is where S...", "I have been using Mahindra Scorpio for a year and my love for the car increases with time. I am a core SUV lover and this is the place where Scorpio nails it. I had checked its competitors while buying it and I really don't repent my decision. I just love off-roading and in the next para I will be covering some marvellous points about the car. Impo...", "Look and Style: Looks wise I would give it a thumbs up but that s only when I compare it to the older versions of Scorpio. Comfort: Better comfort than before. The side hand rest does makes for more comfort driving for long distance especially. Pickup: Not bad at all. I liked the engine response. Mileage: Seems low to me. Not a plus here. Best Feat...", "Lets us see how Scorpio is the perfect combination of power, looks and comfort. Engine: Powerful 2.2 litre, mHawk Engine which can speed the Scorpio from 0 to 60 in about 5.7 seconds. I would say, that is monster power for Indian roads. The engine is very silent as it is CRDe. Low Maintenance: The Scorpio is a SUV meant for rough driving. The only ...", "I bought my Mahindra Scorpio after looking many factors that any Indian would do. This begins with fuel efficiency, budget, number of passengers, look and feel, terrain where we are going to use. After three years of use I am very happy to write a positive review about the machine. To take a good approach I am also taking you to pros and cons and y...", "I also have Mahindra Scorpio 2003, this one is a LEGEND KILLER CAR of this century."], "4": ["It is a nice vehicle. Performance is good and we can give five stars for comfort.", "Scorpio is one of the best and most high-performance superb SUV. It's look make us impressed and proud feeling to honor Scorpio. Its 7 gear and 140 bhp power are massive. I have used more cars but no one is compared with Scorpio. Handling and front view, as well as driving, is awesome and good control over the road.", "Scorpio is best for rough roads and gives the best mileage for hills. Scorpio is a desi SUV favoured for Indian style.", "I have a good experience with my car.", "Best in the feature with maintained with care since bought. There is no damage in history. So it is a good choice.", "A monster SUV. King of roads. 2200cc Italian m-hawk engine with good mileage. ", "Superb vehicle by Mahindra. A power feature vehicle with excellent mileage and comfort.", "Nice car to be driven. I think it's the best in the market. I just want to purchase it and drive this car as soon as possible.", "Nice vehicle in this price segment and everything which are used in this car is very good. The performance of the car is great.", "Mahindra Scorpio is a great car with awesome features, styling, great performance, and great mileage. The overall car is great.", "Mindblowing outlook and long durability with good mileage, power, and nice features combined with a ruff and tuff car.", "Scorpio is a great vehicle for a family, getting good mileage and safety features are also good. The best break I have seen ever, good control on road. I have never faced any issue with this car.", "All over love this car because it's a very stylish car and it's a complete offroad car other it is the best car for Indian roads.", "The best car which will be there for you &amp; take you anywhere you wish. A great buy for Indian roads.", "Very nice car and safety car for a family. When you travel with a family you feel safe and comfortable.", "I like this car but the things I like the most is its design horsepower and its rear look so cool. By the way, I do not have this car but I have used my friend's Scorpio many time and I also want to purchase it. I hope in future.", "Mahindra Scorpio on this road the best driving performance Mahindra Scorpio the best price car.", "The car is very beautiful for travel single or with family and it is very essential for office work.", "The Mahindra Scorpio is one of my favourite cars and the speciality of that car is mind-blowing according to me.", "Good safety i like it...  I love it very much...  I have Scorpio S11 2WD Mahindra and Mahindra LTD....", "Very good car and low maintenance cost very good expression. The king of the car in all over World and king of all type of road.", "Mahindra Scorpio is a wonderful car. The design of the body is like a bull and the performance of this car is superb. Comfort level is also very good. ", "Mahindra Scorpio is very good and such an amazing car. It has a very good interior as such a luxury feeling.  As this car in an SUV model which feels the high feelings. It also has a good pickup which makes it a good start. Its cost is also good as compared to other related cars. Its average is also very good in range 13 kmpl.  ...", "Best car ever in Mahindra best in all comfort best in driving beast look the best car around twenty lakhs.", "This is the best car and this is my favourite car. This is a very comfortable and good safety and most luxurious look.", "It is the right choice to buy Scorpio. It's a very comfortable and safe car in this range", "This is the best car for family and awesome for long tour and the drive quality of the car is amazing.", "The best SUV for any type of ride. comfort is very.good and the driving experience is also optimum. One should go for it if looking for some good monster and affordable SUV.", "  The car is super and the feature is Adam god and the design of the car is just mindblowing. In comfort and mileage, the car is perfect. ", "This car is an amazing car when I'm in 7th class. I see the first time. This car was Scorpio s3. After that, I love this car because this is proud of an Indian company and proof of villagers because in most of the village in Uttar Pradesh most liked car is Scorpio. It is a heavy car and a strong car in performance and its build quality is very...", "Mahindra Scorpio is nice and the engine is so nice and the problem is the comfort is so worst and the car for off-road will be superb.", "An amazing vehicle with great comfort and style and safety. This vehicle is a symbol of prosperity and wealth.", "It's a powerful car and a good price. We can say that it is a segment king but not much good in comfort.", "It has 6 gear in it. It has a nice comfortable seat. It has a large seat for me. Its speed is cool.", "This is a good comfortable car for middle-class families. The performance of this car is good than another SUV in the market.", "Head turner. The top model is awesome. Using the car for 1 year. Can go anywhere. Beast. Overall good, but the interior quality is not so good.", "Awesome car. Mahindra Scorpio is the best car performance and the features are also awesome. Everything is Great.", "Best looks car and has very well ground clearance, and the seats are so comfortable. 😊 And its headlamps Look too good as a devil eye", "Nice car, good pickup, and excellent suspension, It's very good looking up to now from the purchase. I am happy with my Scorpio S10", "Road King attitude car please safety feature or karo baki sab best hai. Bahut badiya car hai har cheez me best hai Scorpio", "Scorpio has amazing features like no other car in this price segment. And really luxury feels if talk about the power. It has been a rock star in comparison with other cars", "Bought Mahindra 2021 (S5) Black. After a lot of research, I found this is the best car at this price. Looks can not be Better than Scorpio. It always shows its presence when you are on road. You will find people turn their heads to look at it again, and this feeling you won't get with any other vehicle.", "I like the car. But the only disappointment is the absence of an airbag. Other than that all other features are cool.", "One of the best SUV models. And top-end model Mahindra but needed the interior some more stylish and luxurious.", "Undoubtedly it's a good machine, but there are technical glitches in BS6 variants. Need extra care and attention. Being a new technology, they don't educate and guide their customers properly.", "This car was more Safety and more Comfortable. This is one of the best SUV cars. This is Best for Big Family", "Very powerful and attractive car. Giving a lot of joy while drive. Better performance on off-roading. Its feeling like seating in luxury car. There are no ac in 3rd row. Not stable on roads,like dancing car Overall good suv for middle class.", "Scorpio on fire but need some safety features. Car is an awesome comfort level. ", "Best Car with lots of space and super performance with good mileage, remaining all it is an excellent SUV with bold looks. I'm using the car for the past 6 months satisfied with the performance.", "This car is my favorite one. This car is very smooth and comfortable for me and my family. I am very satisfied with this car.", "I am finding this decision the best, which I made to buy Scorpio but the only  drawback is that Tata does not offer any automatic variant.", "Good SUV for this price, pretty good in performance and comfort is decent, mileage is 9-11 kmpl which is good for this size of SUV, service cost is approximately 10-12k.", "Very good performance, mileage is better than other Suv, features are updated, pent quality is best, no sound engine.", "I bought the Mahindra Scorpio S5 about 8 months ago. I am still using the Mahindra Scorpio car without any problem. The best thing about this car is that is easy to handle and also looks very stylish. It has the best mileage with comfort. I love big cars always and I used many cars but I like most Mahindra Scorpio.", "Driven Scorpio almost 67000 km till now and it is easy to maintain to date after 5 years I never felt any major problem with anything in the car. Also is very easy to drive because it is very good at handling and comfortable. Strongly built body and good ground clearance plays a major role to drive it offroad still gives very good mileage and it is...", "Powerful Mahindra Scorpio has a Turbocharged Engine that produces 140 bhp Power with 6 Speed Manual Transmission for 7 Seater SUV with Premium features like Reverse Parking Camera, GPS, 7inch Touchscreen that makes Scorpio stylish and powerful. Rear Wheel Drive helps to drive in every condition, the powerpack for Indian roads. Overall it is a nice ...", "There are many cars on the market. This Scorpio is very comfortable and stylish. I like the S11 model because that is too stylish and comfortable.", "Very nice car for personal use and all tyres and engine is very good. I suggest to everyone to buy this car.", "I have purchased the car. I love Scorpio and its mileage is awesome and it has a killer looks with the best performance and it has good comfort.", "Overall it is a good experience. Though it is not very comfortable but still gives the best feel and experience.", "Scorpio car, its a rough and tough and strongly made for typical Indian roads. Low-cost maintenance. This car is very stylish. I have driven the car 4000 kilometres and this is very fuel-efficient. I have been using Scorpio and the first thing. I have noticed in this beast that door's noise keeps you irritate. no storage in the suv, like ...", "The best one can own.. No comparison in indian market. Style and power. There can't be any alternative to this beast. Scorpio with powerful m hawk engine and beautiful make especially in xls model makes it a beautiful choice. Hence Haven't found any alternative till date. Shall replace Scorpio with scorpio only.", "Dashboard and glub box should have premium quality in the base model. I am not satisfied with the quality of the material.", "Best SUV segment with brilliant looks. I am proud to be a Scorpio S11 owner. This SUV performance is awesome and comfortable.", "I have been driving this vehicle since 2015 and its amazing weather. It is road presence or styling, I'm in love with this vehicle.", "By the look of its design, Mahindra Scorpio attracts all the people into it. And, I'm also one of the people attracted by Mahindra Scorpio.", "Low-cost maintenance and best body parts. For the average person, the bike looks so awesome.", "Vehicle torque is awesome handling the vehicle at high speed is at risk. Comfort wise you cannot offered anything better than this.", "Nice car by Mahindra this car feels like hummer of the Indian car market in this car I feel like the champion, comfort is awesome.", "This car is so nice.it's wonderful car. Its the mileage is nice and battery life is good. Its performance is better.", "Scorpio is one of the oldest and trusted Mahindra suv. I have 6 scorpio and all are in well condition best off-road suv at budget of 13 to 18 lack.", "Mahindra Scorpio is my passion for enjoyment draws you to Sagittarius, lifts you out of the depths, broadens your experience, and provides new opportunities for improving the character of your life.", "I have owned Mahindra Scorpio, it is really fantastic car. No problem but safety is priority therefore the lower model must have the airbags. The rest of the performance is best and the mileage is fantastic. I suggest the new buyer that they can use their money for this car. The car is best and the lower model is also good.", "Very exclusive car there was the grateful seat was all good and head light was also good. Overall there was 7 seat in the car.", "One of the best SUV I have driven safety depends upon your driving skill this car gives a king of roads feeling when we drive on highways yeah there are more SUV's with excellent features but this Mahindra Scorpio is known as a bad boy. SUV's only thing if 2020 Mahindra Scorpio comes with a sunroof then it will be the best of all times. ", "Scorpio is the best SUV car according to me. Its pickup is superb and I really like to drive this car. This is my first love. It has brilliant comfort zone.we have 2 Scorpio cars its design is amazing. I love 4×4 cars. I wish to buy the latest 2020 model of this car. I have already a 2018 model car. Finally its superb car.", "It is a superb SUV car with an amazing design and gives an overall mileage satisfaction. Love this car, it is good for long rides and comes with some cool features. It provides good space and provides good power it feels so good in it.", "Overall the car is very nice. The pickup of this car is awesome and the comfort is decent. The offroad experience of this car is amazing and road presence is also good.", "Mahindra Scorpio is the best SUV. The thing I like about it is (1)styling and (2)performance. (3)road presence. (4)power. (5)pickup etc. This is the best SUV I have ever driven.", "This car is the best power and performance car in this budget. It is also the best off-roading car.", "This car is very nice. It has an amazing interior with comfortable seats. Value for money.", "The maintenance of the vehicle is pretty low and the look and feel are amazing. It gives great mileage and its features are also good.", "The maintenance of the vehicle is pretty low and the look and feel are amazing. It gives great mileage and its features are also good.", "Excellent car and very good internal looking and it has amazing exterior. Overall it's an amazing car. Mahindra Scorpio best buys.", "It's a very good car. Amazing features and looks. Mahindra has to work on Scorpio's comfort and built quality but still loves Scorpio.", "Great interior, nice display, and more spacious. It's absolutely value for money. This Scorpio will be the best choice.", "I am using my Scorpio from 2017 s10 and I get the best performance with the car. The best ever mileage of 15kmpl overall normal city traffic and highways till now. I have driven 72,000 km and I had not faced any issues with this vehicle in performance, style, and power everything is good. The only issue is tyre bubbling and jerking on bed...", "Great vehicle with all the necessary features required. The performance is fantastic. There is a bit of body roll but not enough to avoid the vehicle for that particular con.", "This is the best car for this budget, its performance is good, mileage, and comfort level are also. king of all the categories without any doubt. ", "There is No Other Suv Which Can Tackle Such Situations As Scorpio Does, Comfort Is Not That Great, But Superb SUV In The Segment", "Mind-blowing. Not comparable. Terrible nice car dream car to everyone best SUV Safest car. Ground clearance is so nice.", "Superb decent look, comfortable with safety. Easy to maintain as parts available easily options available with variants.", "When I drive this car feeling like... A lion on the road... It's giving our family so comfortable, pickup is best then other cars... So finally my rating is 5star... Because Scorpio was my dream... When I buy I was so happy.", "It is a car that most of us would dream to buy. Whosoever have a real craziness for SUVs will surely consider this car. It has the good build quality and rigid structure. Loaded with features but misses out on some tweaks like the auto-folding mirrors and a sunroof. The ride quality of Scorpio is punchy and feels comfortable on lsmall rid...", "I bought this vehicle 2years back and highly satisfied with this performance. I had Mahindra thar before this But this vehicle gave me feel of thar and comfortability of car too", "This car is best when it comes about mileage and the way it is designed is good. It is a very comfortable car. ", "Mahindra Scorpio most styles SUV of the year. The most popular SUV in India and beautiful SUV style car big wheels and perform are so good.", "As much I have driven Scorpio I like the style and look of this car and even comfort level is better than every car of this price level and this car didn't also require any cost of service and maintenance and at last its a best of the best car between 10-15 lakh rupees ratio the everyone should once try.", "This car looks good, comfortable while driving. Its comes with good colours. ", "Mahindra Scorpio is best car in india. This is wonderful suv car with a very attractive interior and exterior. This is my favourite car.", "Excellent... The feeling is awesome and it looks like the royal lifestyle and after seating inside we feel like a king...", "That was Amazing car... Amazing string Nice looking... Like that real scorpion... I give..5$tar.", "Good car but all features are not available in this car like steering key button steering adjustable.", "Marvelous fantastic excellent superb safe less fuel more mileage vibrant colours smooth in all Terrain and bumpy road condition.", "My dream is to purchase this for my Mom Dad in few years... Scorpio has great presence and it's feel like king. When we are driving it's like a king of roads. This SUV is safe for family or other use. Because its large mad good quality and capacity to seat. For the long journey, I suggest this SUV because you really enjoy the journeys. There is goo...", "Scorpio is a beautiful looking car. I love Scorpio car. Millage is good for this car. Affordable and balancing is very good. Suspension is very good. AC system is good. Pickup is very fast. Sets are the most comfortable in any cars. This car is a black horse. A music system is good. This car engine is very good.", "Best comfortable car, perfect XUV family sedan can't feel rough roads and its hybrid version its best love. This car and its slogan live young live free it's perfect caption for it, enjoying the ride of this car. Although we start car usually it reminds us to wear a seat belt for save drive. And it's pickup it's awesome.", "This car is awesome for off-road purpose. The suspension of the car is very excellent. My family liked this car. This car looked very pretty. This car is completely a family package. Scorpio averages are good compare to all XUV cars. Scorpio dashboard light and fog light are very cool and these are some small feature crate a good.", "I have experience in this car and I have my own at home and performance are very better than before and good from all parts and good services thank you Mahindra. I am very happy with you and your all work.", "This car pickup is so high and very happy to buy this car. This car is so comfortable and safe I'm happy to buy this car.", "I like Scorpio because of one of the best of India's motor...It looking best.... beat style shine much more ...", "Looks good high comfort and royalty over the all SUV best SUV in this price segment awesome features and look.", "Cool and very gorgeous car good mileage and high quite mahindra company any car is good and beautiful and good Scorpio long destiny go but the family car and high standard car because this car beautiful and very good festive in this car input and output the very fast job in this car mahindra is mahindra this car not compared another car.", "Good strong car. The car gives a premium feel. The car has top colour options. Power and cruise control are excellent. The only thing that makes us worried is fuel efficiency. It is not a good fuel-efficient car. The best part of the car is a rowdy look which by itself creates an appeal to people.", "This is a safest and powerful SUV, It is a nice car for off-roading, because of its ground clearance. Its overall performance is great.", "Is a very nice car Its look is very good, it looks very good. I drive it at high speed on the highway but didn't realize it was going so fast", "My 2011 Scorpio is an excellent car. I have driven it over 150000 km and it hasn't given me a single problem. I love the body roll of my car. My car variant is 2011 Scorpio Micro Hybrid VLX Special Edition. It has cruise control on offer. It is 7 Seater car and all seats have enough legroom and knee room. My Scorpio is the best car.", "I would like to give this car Four-star because this car is royal &amp; its features are awesome. I like this car very much. But this car has some safety issues. Like In this car the ground clearance is very high. Which may cause rotating the car 360 degrees. But it happens only in rare cases. If you buy the top model of this car the company takes ...", "A very good car for rural areas as well as urban areas but, it is slightly overpriced compared to features. The car looks very boxy and premium from outside but, inside there are limited features for comfort and convenience. It could be greater if the starting price will be in the range of 9 to 10 lac.", "Comfortable SUV and it gives a feeling of Fortuner. Ground clearance is good. Its a rough and tough car and can be used in various purposes. It is also good for offroading. Its look is also good and it is a loving car of most drivers. Its speed is also good and we can say that overall this car is perfect for people.", "I would like to say that Mahindra Scorpio 2020 is so stylish design and looking expensive in this range or budget. Mahindra always gives well features in minimum budget. In Scorpio, there is so well safety management systems that the Indian customer first priority about the safety. It is so good SUV in this range and it is more stylish from his old...", "Mahindra Scorpio is a very good SUV. It is very quiet as it does not make noise. Its seat is very comfortable. It had a leather seat cover. It also doesn't make me feel that there is a hole in the road the suspension of the SUV is mind-blowing. I don't know what type of fluid or suspension is used in it. The AC of the car is so good that it cools t...", "Mahindra Scorpio is a nice car, Scorpio performance is very too good. This mileage is best and India's famous this SUV.....", "But, there is a white beauty that has taken my heart for all times to come. Yes, it's a 2014 model Scorpio. If you ignore the mileage which is somewhat around 8, the car is best. The car has all the great features. No other car can run 249539 km and enter into servicing center only 2 times. Sitting on the front seat gives you a king-like feel. The ...", "Mahindra Scorpio car is an amazing car because it's the very royal and classy car. Mahindra Scorpio is better for a long drive tour.", "The car is an awesome car, every model is great, and the driving experience is smooth and safe.", "I have been a Mahindra Scorpio lover for a decade now and have upgraded to the 2015 model after I sold the previous generation Scorpio. Beginning with the things I love about the car is the whole exterior- LED Headlamps, the aggressive grille, the bonnet scoop, the tail lamps. It appeals to me as an overall package oozing strength when looked ...", "Drive quality is very good. When it passes the viewer looks at the car every time. It is the best car.", "The car is best in its segment because of its style and the comfort offered, the mileage is great too. It is suitable for people of all ages and when it comes to looks, it looks aesthetic. The car looks best in black colour.", "Attractive look, fair price according to features and comfort, fully safe drive and easily control balance", "This car is awesome. And best SUV in India. This car's maintenance is so good. Mileage is also good in highway and seating also comfortable.", "It is a very good SUV if you have a good budget. Mahindra Scorpio is an SUV for buyers who prefer a rugged vehicle and curvy vehicle.", "It is a perfect SUV, It is the best off-roader car in India for a middle-class family and its performance is very better than other similar cars. Its mileage is also better on-road and also in off-road. Its size is good with good hight and Its good pickup is better and speed is also good. It is the best family car in under 15 lac.", "Most heavy-duty SUV in India. Best for off-road driving and also best for the highway. Some features not included.", "Very good performance. Scorpio is the best car for off-roads.", "Mahindra Scorpio all model is a very good look, safety driving and seating space is good. Scorpio engine is powerfully engine", "This car is owesome. This car in all facility and no.1 safety car. Scorpio car is a best suv car. This car wonderful.", "Mahindra Scorpio is truly a good car I ever see in this range. Mahindra Scorpio is a great SUV car because of its power.", "The car is very good it is perfect in cost not so cheap even expensive its a car with a name that everyone has a dream to own a Scorpio just by its perfect look power engine and comfort in middle range..! I mean I am in love with the Scorpio best ever car in India ", "Very good and beautiful model suspension and speed are good for Scorpio. The new Scorpio new model is a very creative and beautiful design.", "Good performance and also the mileage is good.", "Wow, its awesome experience with Scorpio and good handling car perfect run on-road and its headlight looking too good and I mostly like black colour variant it too good.", "Scorpio is a great car, I have ever seen. If you have a joint family so it's a great car for you. If you are talking about its interior so so you will see the best music system and its control on steering and its steering is so so beautiful and the seat cover is amazing .when you sit on that you will feel comfortable and relaxable. If you are talki...", "Wow! It is a nice SUV in India. It is a dashing SUV. Its interior is very beautiful. The seats are very comfortable and the leg space is good. So, we can enjoy the long ride of it. W Best SUV for Indian roads and even that suspension is very good", "Good SUV car and good for driving. Good interior design and good outlook. ", "The seating and mileage are not good. They need it to improve its features.", "Best for Indian streets And Roads, It's Space is awesome and Company Fitted Sound System also very good, Best car for friends and family It's average is too good for Villages, Best comfort and Wheel Base is also longer than another seven-seater car Like Xuv, Ecco, Eartiga Etc.", "Supercar Mahindra Scorpio and the looks of the car are great. My driving experience with this car is wonderful.", "Scorpio is the best car of 7 seaters and it helps to climb at hill-stations. The music system is extraordinary in Mahindra Scorpio has a lot of space to sit and we can go for a long drive without any tiredness", "One of the best SUV in India. Most easy to drive in the city. Drive is a little bumpy with some body roll on highways.", "Best of a cruiser. Power of an elephant &amp; swiftness of a cheetah. Comfortable &amp; Suspension makes it feel like a camel ride. A turning ability a boon for congested cities &amp; bylanes but can be extremely risky while driving on highways. A masterpiece of its time. Interiors now outdated, may be enhanced in the new version.", "The Mahindra Scorpio is a very powerful engine and a minimum 7 to 8 seater car, music system, and car steering is powerful and cruise control enable, the seats are comfortable and soft. AC vent and car lighting system, fog lamp, rear reverse light, rear camera, front disc brake, and rear drum breaks are great.", "Best car with great comfort and mileage. I am happy with this car.", "Scorpio is a legend car, its most popular car still selling in the Indian market. I hope Mahindra should make a strong body structure and with including to provide safety package. ", "The Mahindra Scorpio has its nice angles but, as ever, the high roof and narrow width do give it lopsided proportions. It is a bit of a climb into the cabin but you will like what you see. The dashboard is smart and quality is largely good. Still, there are ergonomic issues and some cheap bits on the inside too. The seats are also not the comf...", "The price is good. A good car for a big family. Stylish and attractive. Maintenance is low in new car.good pickup at every type of road and mileage is around 20 per liter .feel power in hand when I drive it an awesome point of attraction in any field. It is comfortable with joint family and friends also.satisfied with all comfortable features lovel...", "It is a comfortable car and it is too much easy to drive and its power is too high that can easily reach high speed. But one bad thing is the sound quality is not too good.", "Except for the interiors, The car is overall very good. The car is heavy and tough. Mileage is pretty good for this kind of heavy vehicle which is about 10-12km/liter. Highly recommended.", "This is an excellent car in the SUV segment. All its features are good, the maintenance cost is low.  ", "I like this in the black variant. It looks fabulous and unique like luxurious cars. The design of the bottom of the bonnet likes rain of fires.", "This car is best in all its features, good interior, beautiful alloy tires. Highly recommend.", "It is the best family SUV and is very comfortable at an affordable price. This will be very safe and with nice look. In this SUV interior and space will be amazing. View from inside is very clear and the seat also very comfortable and the driver seat is adjustable. You can adjust height also. Highly recommended.", "It is a good car. It is very famous for looks, safety, and performance. The seats are very comfortable. The safety is also good comes with the airbags and their body was also very powerful.", "Mahindra Scorpio is the best 7 seater SUV, it offers the most powerful engine in the segment, best in class AC the stock tires performance is amazing.", "My favourite 😍 car its good for off-roading I love this car especially in black colour its features are too good and the mileage are quite insane", "Mahindra Scorpio is a very comfortable SUV, and it has a powerful engine. Also, it is giving more pickup to accelerate the speed with good safety features.", "Scorpio is a good car and has a powerful engine. It's comfort level and mileage is wonderful. ", "The NVH level should be improved else everything is perfect here. Mahindra is equivalent to perfection.", "Very spacious with high comfort level experience good fuel-efficient overall a good SUV experience also good for travel long distance, and carry a large number of people, overall a good SUV.", "Its an amazing off-roader I have both S10 and S11 car and is made for Indian road. Looks are very muscular. Have a lot of vibration on the steering wheel and gear but it is manageable. Overall, It is a very good and handy car. Maintaining the car is also not very expensive. Have a very good resale market at any time. There are a lot of cars in...", "It is comfortable and has a very good engine. It is the best SUV in India. It gives a smooth ride even on a rough roads.", "Overall performance wise Mahindra Scorpio is a good car. Also low maintenance cost. But for this base model very fewer features are provided by the company. They charge 12+ lakhs for this car and features are very outdated. No switches for power windows on the door. No remote lock, No ABS, Not a bottle holder in the door, a...", "Mahindra Scorpio looks very good externally but is full of internal problems. In order to adjust the driver seat we have to open the door. Bottle holders are useless and too small. Internal design in terms of usage of space is poor. Even though the car is big but the middle row is not too spacious my legs touch the front seat. There is a long ...", "It's amazing, I love it, outstanding features with comfortable on Indian road.", "It is a powerful and efficient car. Automatic stop and start feature on releasing clutch when stopped is a nice addition.", "Mahindra Scorpio is one of the best cars which I would prefer to buy. As its exterior is so amazing and it is best to drive it on the Hills or for tracking. Its face looks its damn good. I had a wish to buy it and when I buy it I'm feeling that I have made the right choice. As this is an SUV so for those who have a budget of 20 lakh its good f...", "Mahindra Scorpio is a good rough and tough SUV. It is the best off-roading 7 seater SUV. It has strong built quality, amazing pick-up, smooth drive quality, A.C is fantastic, steering is light. This car is the best in the segment. It has good infotainment system.", "Mahindra Scorpio is the best 7 seater SUV. It is the best powerful car. It has the best A.C, best engine, best tyre.", "Mahindra Scorpio is really amazing car. The car is really cool as it gives you awesome feeling. The looks of the car in the black colour are so dashing that anyone can have a crush on it.", "Scorpio is the best in segment compared to others. But the top model is best the best in the design of a complete SUV. All the features are good.", "Car is good but there's not enough power as the car looks. M-hawk isn't enough if you have such a bold-looking SUV, but in comparison to other cars of this segment, this car makes the cut. So Car is great in features and looks but isn't that much good in terms of power.", "King of all SUV segment, in this price range. So I strongly recommend this to ever.", "This car is mostly used in for politics heroes for a rally But his speedometer is about 180 kmph .I expect his speedometer about 200 /220", "Overall, Scorpio S 11 is very good car .. I purchased it since 10 months ago ... before this I had a car which was also a Scorpio but that was VLX micro hybrid 2010 ... everything was perfect in this car but the last row of this car is not comfortable... there are no AC vents for the last row ... if the company would be given push-button start...", "Nice car, mileage is better, powerful engine, and a strong body.", "Very good machine and one can feel luxury with muscles.", "Mahindra Scorpio is a nice car to drive. Its power steering is very smooth and helps to control the car. Its ground clearance is also good, So, we do not face any issue at the speed breakers. The car has comfortable space to sitting. Its engine is strong and mileage is also very good.", "Awesome experience with Scorpio since 2004 and now I have four Scorpio, I love this car.", "It's a great experience between me and Scorpio the car is very comfortable and very dashing looking and very smooth for the drive.", "This car has very good looks with great balancing. I loved it!", "Mahindra Scorpio Pros- Best SUV under 18 Laks Looks bold and massive, the engine has a lot of power to offer, can go on long rides as well as for off-roading with no problem, maintenance is also not very expensive. Cons- It has a lot of body roll but its a body on frame SUV, so it will be there. Rest everything else is great.", "Scorpion car has a good ground clearance and also with good pulling power but the only disadvantage is that it shakes a lot for the passenger side.", "Good space, smooth drive and good mileage with automatic transmission. Very good for the city and long distance drives.", "Mahindra Scorpio is a very nice car with a very good pickup. It has own shine and looks. It has 11 models. I have S10 plus and It has very good pickup when drives on highways and normal roads as well.", "I own this vehicle since 2016 and I have noticed that the vehicle is although well designed and engineered but there is a lack of quality on the new version, plastic is not upmarket and there is an issue with alignment od wheels which remains there no matter how many times you get them fixed. Overall, a good boxy SUV for Indian roads.", "Very good looks with high-performance, good milage, better interior, and music system. Looks are also awesome.", "It is the best SUV I have ever seen but one thing is that It only comes with a diesel engine, and its performance is amazing.", "Awesome car, fantastic features, and mileage is also very good. The suspension is very good for driving is very good, comfortable seats, and a very good space.", "Best for youth family. Very good pick up and a powerful car. Its design is fabulous. My wife liked it a lot. It is the best for a long drive.", "Best car so far and the comfort level is better. The performance is commendable. ", "The handling is not that impressive. The driving is amazing.  ", "Scorpio is a most selling SUV in India I am the owner of Mahindra Scorpio. Scorpio like a beast suv.the power generate very fast .the riding and handling are very smooth.off-roading or highways.they gives up result superb. the Scorpio ground clearance is best or compare to the other suv.they designs are more attractive and sharper.", "The most popular SUV car in India Scorpio is very good for offroading. Scorpio's engine is a powerful engine.", "It is a perfect platform to perfect information to buy a perfect car, it's an excellent experience for me.", "The car I have is a 14yrs old scorpio....what a car after 14yrs in this car I have not to face any problem solid engine solid car.", "Mahindra Scorpio is an excellent car with good AC and an excellent braking system. The seats are comfortable and it also has a good sound system.", "I had bought a car of Mahindra Scorpio s6 in 2016 I had bought this car because it was good looking and it was running on road smoothly and off-road also because of big size of tires and have nice features in this sound system is also good it had 4 speakers on gate front and rear and its pickup is very nice and performance is also and u can modify ...", "Mahindra Scorpio is providing the best look and best driving experience. Also, Mahindra Scorpio is a powerful SUV.", "This is an awesome car. The ground clearance is very good. The looks are very attractive. The engine is very smooth. It is a very spacious car. ", "This SUV has great performance and very durable build quality. This car is a perfect off-road vehicle. One thing that needs to be better is cabin noise and interior design. The materials used for the interior doesn't look so good.", "I just bought Mahindra Scorpio S11, it's a perfect SUV with all latest features while driving I just feel like I am on top of the road , this is the only SUV with hardcore muscular look specially in black color, Thanks to CarDekho for making such decision.", "It's an amazing car with dashing interiors. Its adventure model is best of all other models. It is always my favorite car thank you.", "The car with stunning looks, adorable design, most powerful engine, required safety features, to me, too amazing than any girl in the world no words to describe.", "I own a Mahindra Scorpio 2019 model in white color. I bought it in the month of February. Since then I have driven 2000 kms. It was an amazing experience. The road presence is wonderful. I bought the S9 variant. That one is the best value for money. I then went for aftermarket alloys and tires worth Rs 1 lakh. Now the SUV looks like a beast. Everyo...", "Car is very stylish and spacious available in an affordable budget", "A good vehicle with the mass look and good performance and best 7seater vehicle.", "One of the best offroad driving vehicles and a tough diesel engine.", "Looks like a lion, I really like this car for the look, performance wise there is no backdrop for Mahindra vehicles.", "Its an amazing car and gives good feel while driving and available at an affirdable price range.", "This is the best car in this segment. The engine is really powerful. The maintainence is very low. The driving is very comfortable.", "Scorpio is really very top class SUV vehicle. Here I'm putting first bad side about this vehicle, and then good side. The bad side of the Scorpio: Although Mahindra Scorpio is a very tough SUV vehicle still some of the features are missing or the given features is not comfortable. 1. Door bottle holder: You can not keep even 1-liter bottle in ...", "Scorpio is really very top class SUV vehicle. Here I'm putting first bad side about this vehicle, and then good side. Bad side of the Scorpio: Although Mahindra Scorpio is very tough SUV vehicle but some features are still missing or the given features are not comfortable. 1. Door bottle holder: You...", "Mahindra Scorpio is very stylish and very comfortable no noise and no sound pollution perfect for environmental benefits.", "The suspension of the car is very excellent. This car provides a proper and good leg room on each of its seats. This vehicle gives average around 15 km/l. Which is very good for the likes of these big vehicles. There is an awesome music system with 4 speakers and a touchscreen display. This car gives you a very smooth rides on bumpy roads...", "The Mahindra Scorpio is an SUV manufactured by Mahindra &amp; Mahindra It was the first SUV from the company built for the global market. The Scorpio was conceptualized and designed by the in-house integrated design and manufacturing team of M&amp;M. The car has been the recipient of three prestigious Indian awards: the \"Car of ...", "Fewer security features, but feel is good while driving the vehicle.", "Appearance: Look is very good, most of the owner's selfie include Scorpio at the back. Performance: Performance is good. Driving feels amazing and the driver has the commanding position, hood of the car can be visible while driving. Engine seems more punchy between 1500 to 2000rpm. Useful Accessories: Headlights are attractive, and with fog lamps, ...", "The real SUV is Scorpio and it is really a good SUV for a family.  ", "Ruf and tuff Scorpio. Best in class, best in mileage. superb comfort and overall compact in all good things.  ", "I got a smooth drive &amp; looking very well but features are old.", "Mahindra Scorpio is smooth to drive and its looks are very good but features are not modern. ", "I love Mahindra Scorpio for regular use. It has a muscular look all the time and power is always high in this car.", "The Mahindra Scorpio is a rugged SUV that offers bold looks, seating capacity for 7 people, lots of features and a powerful engine with a 6-speed manual gearbox. However, the vehicle loses out on the ergonomics front. The ride is on the stiffer side and while it causes some bounciness for passengers, it makes the Scorpio a fairly decent handler.", "Mahindra Scorpio is famous for their boldness drift style and sleek design, sharp and crisp LED front halogens gives insane look. Scorpio gives you the best seating experience and new variants are come up with great dynamic modifications.", "Space in the car is not sufficient. Comfort is almost average. But, the power is very good. Overall a monster car in this budget.", "It is a very good car with very responsive pick-up. I've had this for last 8 years and I don't have a single complaint about it also after 8 years I also own another Scorpio s11 AWD variant. Great car.", "Well, this car is really powerful, spacious, but only one problem is the bumpy drive it gives, while most of the cars go smoothly on a bad road, I mean we can't get hurt.", "I have felt very happy after purchasing the new Mahindra Scorpio s11 its look impresses me very much and also it's designed. The car is full of comfortable and maintenance due to driver feel relax and ease after travel long distance whereas, I also had a dream to purchase this genius car and god fulfil my desires and now enjoy very well.", "Mahindra Scorpio is the best SUV and instruments are a cluster of good design engineering.", "Power of Mahindra Scorpio is high but the body has been built with low-quality material at a high price. No doubt, looks of Mahindra Scorpio are good. ", "It's a great experience of buying a vehicle in my life. My scorpio is in very good condition. I want to thankyou mahindra company for providing a good vehicle for us. It is very comfortable and luxurious vehicle in comparison of all other vehicles.", "My dream car is Mahindra Scorpio because it is better for me. ", "Mahindra Scorpio exotic SUV will make many stories. Made for true wanderers, it is excellent in offroading and the best thing is its price which is comparatively very less as per the features, body and looks.", "My Mahindra Scorpio is very good in the pickup and delivers a powerful torque than this new Scorpio, but my car gives low mileage because the new Scorpio lighter than the old one but the old one is heavy. Light one gives good mileage but low power than the older version.", "Mahindra Scorpio is a very good vehicle in its class but does not have a good pickup.", "I like the design of the Mahindra Scorpio. It looks great but the fuel economy is absolutely not ok and the performance is something that you need.", "Mahindra brand is the no.1 brand of car but especially I like Mahindra Scorpio black color most impressive car. I like this car very much.", "Okay, so I am giving 4 stars to the Scorpio because I own one the S11 model. Scorpio in its own is a very simple but powerful SUV to drive. It gives a very nice view on the road while driving due to low bonnet height and shorter pillars. In the 17 lac price quote, you get a very good option of features in your 7 seater SUV such as tiretronics ...", "Nice car Mahindra Scorpio S11 looks good interior well good.", "It's very better and attractive jam looks feel very comfortable works good in the town area. Its A/C is very good and best. Scorpio10 better than Scorpio 11. It's a very cool SUV better than other SUVs, for example, It's tires are best. Its rim is very attractive look My father tells it was his dream to buy a Scorpio.", "Very good at driving. Excellent in torque and interior of the car. Has a classy and decent front grill.", "The suspension of the car is very excellent. This car provides a very proper and good leg room on each of its seats. This vehicle gives average around 15 km/l. Which is very good for this big vehicle. There is an awesome music system with 4 speakers and a touchscreen display. This car gives you a very smooth ride on bumpy roads but as wel...", "Mahindra Scorpio is a very nice car with good handling, I am driving this from the last five years. ", "Mahindra Scorpio is the king of mid-range SUVs. It is truly a big car though looks compact from the exterior. The car is extremely powerful and elegant. The black colour explains the real scorpion. Overall a fantastic car for the city and for those who need a 7 seater.", "The Best Indian brand SUV so far. It's got the looks, a great road presence, can go anywhere, seats for 7-8 people with comfort, has a powerful M-Hawk engine delivering 140 ps power &amp; a very useful 320 Nm torque. With best in class ground clearance, it is easy to drive in town &amp; countryside. I just love the way people give way to this SUV o...", "Mahindra Scorpio is the best SUV for the off-roading purpose.", "Mahindra Scorpio is one of the best looking cars in India. I think this has got the best design. In fact, this car has a very good engine. But the problem with this car is about its interior quality, The safety features and ergonomics issues and if the company can sort out these issues then it becomes a very good car.", "Mahindra Scorpio is the best SUV, it has the best design and the speed is also good.", "I love the Mahindra Scorpio, its performance and looks are mind-blowing. I already have two Mahindra Scorpio and I am planning to purchase the new Mahindra Scorpio S11.", "It is a nice and fabulous SUV car in India for a normal and high-class family both.", "Mahindra Scorpio is a wonderful SUV. With comfortable seats and great power, it is the best, but security issues are there, there should be airbags in base variant also.", "The Mahindra Scorpio has a very good looking front and also sports a high powered engine.", "The car is a very comfortable and very nicely designed car. when I ride it feels some difference in this car.", "Mahindra Scorpio is a powerful SUV with the great looks and Indian Automobile best production.", "It's a very good car it provides comfort very good performance.", "I have Scorpio 2011 m hawk engine my experience with Scorpio in hilly areas is best and mileage is good. The suspension is also good.", "This car is very nice in running, shape, structure. I love the torque of this car and boy o boy personality this car has. Every single interior, exteriors, have their individual impact on this car, make this car one hell of a beast. There are no drawbacks to be shown in this car!!", "I am privileged to be the proud owner of a Mahindra Scorpio. With much delight, I am delivering the following for your kind consideration..! The pride and comfort in driving and travelling in a Mahindra Scorpio have claimed me enormous appreciation from my family members as well as friends.", "Mahindra Scorpio is an awesome SUV, I have this beautiful car and I have driven it up to 2,50,000 km. Still, it is running very smoothly.", "Hard looking car liked by hard looking peoples nice space and sitting pattern in the mid row.", "Amazing car for my experience very dashing car and good looking. Muscular and powerful car.", "Excellent Wonderful car (tiger) hai sir nice looking comfortable sitting comfortable driving.", "Scorpio is loved by millions for its bold SUV styling, dominating road presence, high seating position and all-terrain capability that make you feel like the King-of-the-Road. The Scorpio, offers a power packed thrilling drive with its 103 kW (140 BHP) power and 320 Nm torque. Its 6-speed transmission allows you to optimise performance in each gear...", "One of the best cars in India, as comparing the comfort and look it, is like as the beast is on the road scorpio...the best SUV of all time and runs like a bull both on a road and off-road...No issues everything is perfect.....", "Exterior Looks are at once discretion, &amp; is a individuals perseption hence no comments on this front. Interior (Features, Space &amp; Comfort) Features: Absolutely nothing. LX is a cheapest version &amp; has nothing in it which you can call a feature. in thst sense @ same price Safari has lot more of features which come really handy. Interirors...", "Using Scorpio since last 4 years &amp; as M&amp;M is on the verge of launching next gen of Scorpio, I suggest that use of more Chrome will not do any Good. Please improve ride quality and AC above all. Of course, Road presence and Looks of the SUV are unmatched as well as unbeatable and We all like it that way. Comparing to its Arch rival Safari St...", "I am not an auto expert but I would like to share my experience with mahindra scorpio, my first car. Before this i have driven different cars like safari, jeep etc but Scorpio is my first choice. I brought my car from Somya Vehicles Indore. The overall experience while purchasing car was nice. The consultants explained every feature of car to me. (...", "I purchased Mahindra Scorpio in december 2016...and I am fully satisfy this black lady...This car makes us very proud..when we drive we feel awesome...its very spacious..and comfort level is to much...black colour looks royal..when we ride everyone in colony will be jealous i know..becouse scorpio to scorpio hai...dream car for every youngster...", "Mahindra Scorpio have Stunnig Alloy wheels. New contemporary interiors coupled with futuristic instrument cluster and dual tone dashboard welcome you to an unparalleled cabin experience. The New Generation Scorpio comes with cushion suspension &amp; anti-roll technology that makes driving a breeze. Get behind the wheel and be in complete control.Fu...", "With 2011 model , 69k Kms done, I was little bit nervous to go trip for 1400km. I started at 2.45AM on 19th nov 2016 at Gurgaon and left for Gharsana, Rajasthan (500km), reached at 9:40AM on the same day with 30 mins stops. Then I started at 4:45PM on same day and left for Etawah UP (850kms) and reached at 4:30AM on 20th Nov .. I must say, it was m...", "Looks wise, I would give it a thumbs up but that's only when I compare it to the older versions of Scorpio. It has better comfort than the older models. The side hand rest does make for more comfort driving position, when on long distance. Pickup is not bad at all. I liked the engine response. The mileage seems low to me which is a negative here. T...", "Scorpio is my favorite car. The Mahindra Scorpio is the most popular car in India. The car looks so much better than Mahindra Thar. I love this car. No other car can compete with Scorpio. It is the most affordable car. It is so stronger than the XUV500. Its engine is very powerful.", "Scorpio is a very good car according to its features because it is a 7 seater. I like the car because of its good mileage according to a normal 7 seater.", "I am in love with Scorpio and a huge fan. We own Scorpio since 2002 and we have almost all the generations of Scorpio in different colors. 2002 Model is my favorite and its still with us in the best condition.", "Last year Mahindra gave its best-selling SUV Scorpio a facelift which gave a new lease of life to the vehicle. At the year end, I was too searching for an SUV and heard of Mahindra launched a new Scorpio. It took me a minute or two to make my mind as I am fond of this car very much. I gave my nod to the Molten Red color which still turns head on th..."], "5": ["Scorpio is a supercar and very comfortable.", "Scorpio 2021 is the worst in looking style. The current Scorpio is very good. I don't want the 2021 Scorpio model in India. I want the current one to be in India for more years", "I love the Scorpio S11 Molten Red.", "Scorpio is one of the best and most high-performance super vehicle. In Mahindra we love Scorpio. It's structure and outlook make us impressed.", "Good looking Scorpio s11. India's no one SUV, good performance, best maintenance,  best pic-up, and powered by mhawk engine.", "I just love this SUV, it has great power and perfect for Indian roads, Scorpio is my dream SUV.", "Best in performance, classic interior, and already driven 1 lakh kilometer still there is no engine noise, Highly satisfied with the car.", "Mahindra Scorpio is very best car. I like Mahindra Scorpio good mileage low Maintenance. Very comfort seat very fast speed high seating capacity and airbag system are very good in this vehicle. All disc brake is very good car control in few second gearboxes are very comfort and technical and car's light very fast and clear.", "Excellent car luxury and powerful engine with best engine nice performance in the offroad area in sand and desert area very power in the engine and its interior is very nice and its AC is very powerful. Large space inside large and comfortable seats nice music system with nice sound and comfortable staring.", "Really liked the car and way of the car designed good built quality as well as value for money. The car looks very luxurious and is so interested in this car this model is highly appreciated in the Indian market and there is no complain about this car. I'll highly appreciate this car and as well as value for money.", "Ride quality are too good and off-roading also to good in this car. This is the perfect SUV in India", "This is not a car it is a dream best in class fully safe and the performance is better then other cars value of money I buy its top model is the best not compare any cars in this power of horse it is a dream and this power full vehicle so drive carefully and good for off-road also and the style of the car is best in class...", "I fully comfortable for this car , this car is used in any life style.this is also a adventure car .", "This car is very much comfortable for passengers with a comfortable drive and superb features.", "This car is a royal car in its own right. Its go-to style everything is different in this... It is the best car for the new boys of today.", "Good and comfortable car for a family . Comfort seat.", "All Mahindra Scorpio Reviews. Superb experience of buying this car, smooth-riding, seating and Best mileage.", "It is a VIP vehicle and the performance is very good and comfortable to drive off-road. I can say this with my buying experience because of the car.", "Good SUV with an automatic gearbox. I have been driving my SUV for a few months now. It has served me well. Good service from Mahindra also from last 2 years. The engine has a lot of power. I went on many trips across the country. It is a very good vehicle and I am very happy with it.", "It is a superb SUV car with a good design and gives an overall average satisfaction. Love this car, it is good for long rides and comes with some cool features, it provides good space, provides good power it feels so good on it. The mileage is the best. ", "Everything one can get. Its wonderful design adds to Scorpio greatly. Build around sophisticatedly nice.", "Looks are premium. When Driving In City Very High PirckUp In First Gear. It is a very nice car!!", "This car is beautiful, because of its heavy-duty and performance in the feature. This is my dream car. I love this car.", "Nice car, nice driving system and best mileage car.", "This car is the best SUV in this segment at this price. This car is best in style and in black or white color with little outsides modifications it can compete with cars with a price of crores. I have two Scorpio one 2015 white color S10 and 2017 S11 black 2019 model", "Very good car but very costly. I cannot buy it because of the very costly price for me and I don't have space to put this car.", "A good comfortable car. Designed good, looks-wise awesome, the capacity of seating is good for families. features perfect", "Scorpio is the best car. This car is ultimate. Good interior, good exterior, good engine, good body, and good ground clearance.", "This is a nice and brilliant car. Scorpio is the best car.", "The looks, performance, power, stability, and the black color of this car, it's my dream car, and also my father dream.", "Mahindra Scorpio S11 is a very hard and ragged vehicle on the dirty roads. A highway gives good mileage.", "Nice car with an awesome design but they should also give front parking sensors and a sunroof. These features make the Scorpio a complete urban SUV.", "I never felt any major problem with anything in the car. Also, it is very easy to drive because it is very good at handling and comfortable. Strongly built body and good ground clearance play a major role to drive. Its offroad still gives very good mileage and it is very easy to maintain.", "I love Scorpio is the best or better koi car nhi hai. Iss se jyda power full or best car koi nhi look mai bhi sb se best.", "My one of the favourite car, maintenance is also good..looks stylish and comfortable car... The car is a good family car", "I'm in love with Scorpio. Much more expensive and luxurious SUV's available in Indian market. But, Scorpio is superb, matchless. In South Africa, Mahindra Scorpio is working hard the same as Land Cruiser in half of its price. ", "Scorpio is really muscular best in its class and value for money. The only problem is its bouncy ride, but it gives you an attractive look and fuel economy is really good according to its engine size. Servicing cost is very low and very good...", "It is a fantastic car and delivers more power more mileage safety and hard of all new-age. It gives excellent performance in off-road driving and on-road driving more power Mahindra Scorpio heart off all new ages in India, I love that car I love the exterior, interior and the look no other car can compare with Mahindra Scorpio. ", "It is a very good car-less price and features are like a very expensive car. It beats every car in the show. If anybody is trying to buy a new car and want safety, look, features and maintenance in Budget etc. I would recommend Mahindra Scorpio. According to me there no car in this range that can beat Mahindra Scorpio. I am saying these very c...", "It's a good car.... with a good foot space in it.... all the members of the car can seat comfortably and most importantly. It has a good engine power which makes it a good car when it comes to carrying lots for luggage with it... It has good air conditioning... Overall the car is really good if you are looking in an SUV range.", "Brilliant, this is a very good car with a strong and powerful engine especially seating capacity is very good.", "Awesome experience very nice loved it can't express in words. Every feature was awesome. A good car manufactured by Mahindra. Hope that Mahindra brings a good car this year too. The price of Scorpio is good. It's very comfortable the air conditioner is awesome.", "The best SUV car. It has a good engine. It is good in off-road condition. Seating was absolutely fantastic. It maintains good ground clearance. Scorpio has many features like 4x4,6.5 inch touch screen, rear ac etc. The engine was 2000CC. Mahindra was updated the SUV regularly. Its length was 4440mm. It's comfortable for a family.", "I LOVE THIS CAR, I HAVE A MAHINDRA SCORPIO ADVENTURE, AND I LOVE IT'S, ACCELERATION, SUSPENSION, AERODYNAMICS, JUST I THINK IT IS A BEST SUV FOR MIDDLE-CLASS FAMILY.", "It is an excellent SUV car it is a budget car it has a powerful engine. It looks very good its design was very nice it is a featured car we can modify this car in very small amount this is very comfortable SUV car when we sit in this car we feel like that we sit in the truck but that feeling is the best only which I can't explain..... this is my fa...", "It is very good best features in this I like Scorpio a11 and it's more comfortable than other cars.", "Best experience of Scorpio, amazing features, And Drive experience, The best car, Bold and stylish with great choices of features and colours. ", "Best of all SUVs in the price segment, with excellent space comfort and new features. Handling is good, mileage can be better.", "This is the best power full and strong SUV car. The comfort, pickup, mileage and overall performance are best.", "I like this car, it has amazing features, performance, looks pickup, and running stability is too good. It's the king of all SUVs, made for Indians like offroading.", "This is a very nice car for village road and city also and looks very stylish and the price is very awesome and gives a bold impression in public. To be an Indian company Mahindra's car will be proud to sit in our country car.", "This is so cool car as it's heavy and beautiful, this is a complete family car. This car has very good safety features, mileage and comfort. ", "It's an amazing car, very spacious and good looking. Great features nice budget car, value for money. Overall very great car.", "Mahindra Scorpio is a great car in terms of safety, speed control and looking, one of the best in its segment.", "Mahindra Scorpio car seating comfort and this car safety features and looking so good this car performance very good.", "It is the best car in this price segment. Its comfort, features, and mileage are also good with more stunning looks.", "It is a superb SUV car with a poor design and gives an overall average satisfaction. It is good for long rides and comes with some cool features. It provides good space and power it feels so good.", "Looks great. Got A Pretty good Road Presence especially in black colour. Not only exteriors are good but also Interior is Confortable And Noteworthy. ", "Mahindra Scorpio's car has the best look and best comfort. Safety rating best. Mahindra's Quality and colour are the best. All features are good, very nice driving system and comfortable braking. ", "This car only famous peoples buy. It shows the royalty ...each and every person love scorpio....it is one most royal car.", "Superb Car fully loaded with features. Underrated car Superb car fully loaded with features.", "This car is best for offroad driving and also smooth in city driving and it is comfortable for a long trip. But their last row seat is not comfortable because this upon on rear tyre and when we seat we fell unconscious. The performance was best and the confidence to drive on the highway.", "I own Scorpio for last three years, and I feel proud while driving it, its driving quality is excellent and having so much power, its a perfect SUV in its segment. Scorpio gives good mileage as compared to other SUVs, and its maintenance cost is extremely low which is good for Indian customers. I suggest every SUV lover go for Scorpio once. Today S...", "Yes! Scorpio is an excellent SUV I love to ride it on and off-road it gives feels and energy to drive. 4 years are done for my Scorpio but it rides like its new. And I 'll recommend it is the best SUV under 20 lakhs to buy. Scorpio is as tough on-road and it more desires to ride it. Such a lovely car.", "The Scorpio car is very wonderful because this car is very beautiful inside and also outside.", "Mahindra Scorpio is my family's first car. It's not just a car, it's my family member now. Whenever I drive my Mahindra Scorpio, believe me, I am enjoying every time. It's my first car.", "The best and the most successful mid-range SUV in India is the Mahindra Scorpio. I had this car last year and still have the same on the date. I run this car too much roughly on the off-road for which this car is known for. It feels strong when you handle the car. What I had noticed this car is unmatchable in terms of durability in mid-range p...", "Mahindra Scorpio is a very good performed family vehicle and it's a performance very amazing on half road drive. Its mileage is very good and maintenance is low.", "It is rough and tough we can drive it in offroad also and its space is very big, I like it very much it is very smooth which helps in taking a drive in off-road. I like it and if would be having a sunroof it would be a luxury car and it so amazing its feature its engine and the thing that, I liked the most is it's rear it looks very amazing.", "Scorpio is a Full attached a family car and looks likes to feel amazing car no any car in front of Scorpio in this money range.", "Awesome car with awesome price found to be the real SUV with the perfect combination of engine and body.", "One of the best SUV has good amount of space, luxurious, good in any type of road, gives good power, transmission is smooth, braking is powerful, provides good ground clearance so that we can easily take it for off-roading, the seat is comfortable as well, air conditioning is powerful can cool the cabin in around 5-7 min, wheel size is good, runs s...", "This is the best car in terms of all features as well as performance.", "Hi everybody, well as indicated by a vehicle wellbeing review a portion of the monster vehicle( like Mahindra Scorpio) had scored zero. As being a Scorpio proprietor Model 2020 I was in an extraordinary stun just as was especially disappointed as we as a whole know when we purchase a vehicle we get it with the goal that we can head out to our goal ...", "Amazing looks and royal feeling while driving, one of the Mahindra's best four-wheeler. Performance-wise it is also best, pickup is good, seats are comfortable, looks like a luxury vehicle. Feeling of a heavy vehicle in the average budget.", "This car is very good I haven't driven this type of car before I really like it I am buying it in a few days", "Class in the segment and I like very much due to Scorpio is very powerful and gives seamless experience on off-road.", "I have used scorpion its very powerful and safe vehicle, and very excellent puck up, easily drive in a long way with comfortable seating arrangements and very attractive look and body is very nice, braking system and controlling system is excellent, and very attractive as compared to other vehicles.", "My best driving experience value for money, best features, service cost is not too costly, the Scorpio having beast look and killer look, DRL makes it more awesome, one of the best SUV of India, I am so happy after having my beast, such good engine power, my experience say that it is the perfect SUV for India, Mahindra is awesome, Scorpio body buil...", "Excellent engine life, Low maintenance compare to tata products and its rivals, Very low vibration in the engine.", "A car with good looks, powerful engine, strong body and rough and tough. It is a feature-rich car.", "The Scorpio is the most pleasing and comfortable SUV but only the s10 and s11 models. The engine starts like a monster that is very attractive. The lateral B shaped design of its taillight is pleasing. The middle seats and the front seats are very spacious and I understand of the last seats that they are not spacious but every SUV's last seat is a ...", "Scorpio mileage is 10-12 km per litre diesel. Scorpio drives is so smooth and comfortable. This car running is so fast. Scorpio all passengers sit are very comfortable and a big space in this car. This car engine is very silent and low-cost maintenance. The pic-up is Scorpio is very amazing. I am so happy to buy this car.", " Nice space inside comfortable. Mileage is also good. Powerful car. I brought black colour. I am impressed by all its features. It is a perfect family car.", "Great car with amazing design and features.", "Its engine power is too good, but it does not have comfort as much as I think.", "Overall the car is fantastic. It requires a bit of work in the spacing. Scorpio has all been a great vehicle. A little work on body roll would be nice. Mahindra Scorpio 3rd generation is coming soon so a lot of errors which are not obviously very important but play a role, in the long run, can be improved. Scorpio S11 does not have adjustable poppi...", "It is not just a vehicle rather it is the dream of every traveller. It has amazing features. I recommend it to everyone.", "Its real supercar, it is very hard and strong, exterior of old model 2012 version is good than this, the interior is very good. But the only issue is the ventilation problem.", "Mahindra Scorpio is the tough SUV in India, this is the best selling SUV. This is the seven-seater SUV. This is a comfortable SUV, also its engine is amazing.", "This SUV is just amazing at this price point and its resale value is very excellent, its look and its charm in a single word are outstanding.", "Mahindra has been a market leader once upon a time. With the increasing costs, I think that Mahindra should also update the features in Scorpio. Best in class SUV.", "The best SUV ever. Best configuration, best design. Comfortable seats.", "Scorpio is the best car for anyone who travels the most. This car is very stable and I very like its body roll. I like its sitting position, a commander position we get. This car is a budget car for those who are looking for a 7 seater car. Service is very less costly for the middle people.", "I have been using scorpio s10 4wd since 2017nov, and the first thing i've noticed in this beast that door's noise keeps you irritate,it won't going to stop not even in agency, and you will have to use to it, and second thing I've noticed that i got a milage of 7 km per litre in hills and 12 - 13 km per litre in long drive, seats are like you will h...", "It is a very nice car with good mileage and great design. Pickup is very quick and this is the best car in this budget.", "Scorpio car is a very dashing car in the world, black Scorpio is my favourite, my dream car. I would like to be its owner.", "Mahindra Scorpio is the best looking car in the segment and the top model is amazing.", "This is so beautiful car, I'm very happy. Because of this car so comfortable and big. The car sit capacity is very comfortable. This car riding is very smooth. When Scorpio car ride this road no filled bumper and speed brack. Cars design and front looking very nice. Cars. Price not high. So Mahindra Scorpio very nice car.", "Best SUV under 20 lakhs DRLheadlamps all ok. The Mahindra Scorpio is an SUV manufactured by Mahindra and it was the first SUV from the company built for the global market. The Scorpio was conceptualized and designed by the in-house integrated design and manufacturing team of M&amp;M. SCORPIO S11 4WD BEST PRICE BEST RANGE LIVE YOUNG.", "Its a life of car lovers. I love Mahindra Scorpio 4×4 comfortable SUV and it gives a feeling of Fortuner. Ground clearance is good. Its a rough and tough car and can be used in various purposes. It is also good for offroading. Its look is also good and it is loving care of most drivers. Its speed is also good and we can say that overall this c...", "Great Car, Interior is superb. Pickup is very fast. Very comfortable. Engine is very good. Less sound come from engine. Run like a horse. Great car for offroading, desert, as well as city drive. The Air conditioner is very powerful. Rear seats are very comfortable. Sitting is very comfortable. Mileage is great and fuel tank capacity is very good. H...", "Its amazing car and comfortable to your family it has better space and the sound system is also good for your journey it makes your travelling smooth.", "The best car ever. I love this car, it came with very beautiful and power full features... Like wow", "ITS THE BEST SUV I HAVE EVER EXPERIENCED IN MY LIFE.IT WAS JUST A TRUE SPORTS FEELING VEHICLE IN OFF ROAD.AFTER THE XUV 500 THE NEXT FLAGSHIP MODEL IS SCORPIO.I REALLY BELIEVE AND MANY PERSONS ALSO THING IT IS THE BEST CAR FOR THE INDIAN RAODS.THE SCORPIO IS A DREAM CAR FOR MANY AS WELL AS ME.ONCE IN A LIFE EVERYONE SHOULD GET TO DRIVE A CAR LIKE T...", "This suv are awesome my favourite SUV Mahindra Scorpio I love right in this car ", "Seating concept is awesome. Good family car at an affordable price, nice mileage, nice exterior. This car is the best in this segment.", "One of the best SUV has a good amount of space, luxurious, good in any type of road, gives good power, the transmission is smooth, braking is powerful, provides good ground clearance so that we can easily take it for off-roading, the seat is comfortable as well, air conditioning is powerful. I love it.", "1. Looking so attractive 2. Mileage too good  3. Taking to air when they going to roads 4. I'm very comfortable when I'm set it in this car. ", "Mahendra Scorpio is the best car for the smoking people or anything else because it give a standard look to the people and many of the love the black because most of the people loved with the black and white colour and it's will welcome as in Mahindra Scorpio till,  will tells as welcome to Scorpio. And the best thing in this car,  i...", "I like the car, because of its look. It is Best SUV for Indian roads, it's front grill make its look so classy.", "Super exciting car. Very nice style and very good looking. I take the test drive comfortable and looking very nice.", "Comfort is top class when you sit in the car, you feel the speed, engine, and other features also.", "Mahindra Scorpio is the best in this range and it is used to rough and tough, so I suggest to everyone to buy it.", "Beautiful vehicle on the Indian roads, I have Mahendra Scorpio S7. It is the best choice for a medium family.", "Best comfortable car for a small journey and highly comfortable for adventure tours.", "The king of the road is called Scorpio. Heart of Mahindra and India. Its upcoming model of 2020 with sunroof is superb.", "A really superb car for SUV segment a great filling drive for this car Indian roads very difficult but Scorpio very smoothly running everywhere. Amazing design that feels like a royal car and is a super special car.", "This car is good &amp; comfortable while driving, the view while driving is also great, the maintenance cost is also low.", "Well, I have 2014 model VLx Scorpio and I totally loved it low maintenance. The car is packed with enough power and torque and a rough body makes it perfect SUV for Indian buyers.", "This beast made me feel alive fell young We live free. It fells that you are riding a beast.", " The Scorpio EX is the only variant that makes only 75 Bhp of power using the same engine. The Scorpio starts at Rs. 7.59 lakh for the base EX variant and goes up to Rs. 12.22 lakh for the top-trim VLX AT 4WD. ￼￼Photo: The Mahindra Scorpio has a butch and masculine appeal   Looks: The Scorpio is a mean and muscular looking SUV, with ...", "Smooth and powerful car in India My choice Mahindra Scorpio. Looks are also very awesome.", "Scorpio is the best car in its price range, It is the beautiful and beast type car with a classy interior and exterior The Mahindra Scorpio is one of the most popular entry-level SUV in the country today. With a total of seven variants on sale at present, it also gives prospective buyers a lot of choices as far as variants and features are con...", "The car is nice and looks of the car are very good and the safety of the is nice", "Feels amazing to be on the driving seat... gives a muscular feel while driving....cabin is really spacious, gives a great feel to be a proud owner of this masculine SUV", "Mahindra Scorpio is the best car in India. My best color is black. This is a comfortable car.", "This has a powerful engine with a great look. It comes with a good price and many variants to make a wise choice. ", "It is a very good SUV and the design of this car is also very good. It comes with a powerful engine and price is also affordable.", "The power and the performance of the car are unmatched and comfort as well. I drove this car for a few days and it was a pure driving pleasure.", "The buying experience is very nice and I love this SUV car... It is a very comfortable SUV car. I have been thinking to get this car for a long time.", "The Scorpio is good for urban and rural places. It has many features and ultimate power. It had a class and comfort that makes it one of the best SUV in India The Scorpio had a good performance in all its variants. I had bought S9 and S3 The both give the same comfort even after they have different features. ", "Mahindra Scorpio is the best car for family travel, it is a comfortable car there are best features in this car. This car has a good look. This car is a good choice for all travelers. Mahindra is the best company. Scorpio has a good reputation. Scorpio has a good pickup and mileage. Scorpio has a good price. ", "Mahindra Scorpio best for Indian Road and Indian pupil, Best for the engine, best for servicing, best for comfort, best for the price, best for safety, best for mileage. Mahindra Scorpio is the king of Road, Its ride just like a hero. Overall it is best for everyone. Like family car. Mahindra Scorpio likes a King of Car.", "The most trusted, reliable and robust car. It makes you feel like a king on the road with clear visibility and road presence. Comfortable non-tiring drives. High ground clearance is a boom on our Indian roads for easy cruising.", "Writing this review from my own experience of Scorpio. The Mahindra Scorpio was always my dream car since childhood because of Its looks &amp; build quality. While driving Scorpio it provides a clear front view &amp; side view which helps me while driving. It feels like we are sitting In a tank. If we see another car f...", "Awesome ride, highly durable, old school feel that's it, Scorpio can be considered as the best SUV.", "Mahindra Scorpio man thinks about this SUV. The SUV was super looking good built quality and most think about Mahindra company Indian number one company. Mahindra Scorpio, 2 years ago, I have bought this car and I'm so happy with this price range, I have bought this car most powerful SUV Scorpio is looking like a monster personally b...", "Mind-blowing SUV, just like a mussel power. On-road like a ship floating in the sea. It is like no before great make by Mahindra.", "It is the best car and the looks of this car are superb. The engine power is very good and according to its segment, it gives me good mileage.", "Best in the segment. This is the best car for long tours and according to its segment, it gives me good mileage.", "This car is amazing in looks and it has very good at performance, but its suspense is very bouncy but overall this car is good for offroading and long drive.", "I love the feel of Scorpio and the Mahindra car is awesome and fabulous driven comfort ", "It is my and my family favorite car. It is smooth in the drive. Its Spatial think is it is four-wheel. It looks beautiful.", "The experience I got from this car can never be explained in words. This is the most head-turner SUV I have ever seen.", "Best for family travel on hill station... More power and more grip on the road. More comfortable seats... More safety... A car which is bull of mountains.", "Mahindra Scorpio is good looking from the front and as well as back. Its engine is very powerful.", "This is the best package in this budget and is powerful, it also has head-turning capabilities and it is also a prestigious product, I like its black colour most. In my views, it is the king of the Indian SUV market and also in driving, it is very easy to drive because of its height even a person of small height can easily drive it with confidence.", "This car is amazing, all the features are good, the look is very good, safety features are amazing.", "Best SUV forever with amazing features, best systems, best engine and best technology. Voice command feature is very good. Captain seating is best and ground clearances are best. Very good SUV in the world. The black colour is very good and very effective in colour.", "King of off-road with low maintenance. Budget SUV with very good comfort, very bold look in term of style.", "Muscular Car I have ever seen. It's rough and tough for the use of young generation. Too much comfort. Everywhere may be it a city or urban area, it is very good for driving with family members.", "Full comfortable and good engine condition, great safety features are provided and it is good for long journey drives.", "LED Headlamps, the aggressive grille, the bonnet scoop, the backlights. It appeals to me as an overall package oozing strength when looked from the outside. The driving is eased by the smooth gear shifts compared to other SUVs of the higher segments. It also is the most affordable 7 seater with the kind of features like reverse camera, navigation a...", "  Its a real SUV, its power and torque is great as compared to other cars.", "Scorpio is the best SUV in this segment. I use in daily drive and I am happy with this SUV. I have a top model and I get 14-17 economy. Also ride is good and power is extra good and for highway use this SUV is king. It has many systems and many functions. I use Scorpio from last 5 years and personally love Scorpio.", "This car engine power is strong, looks beautiful, good comfort and engine noise is less. It's rough and tough.", "I own a Mahindra S10, the car offers very good mileage, maximum up to 21kmpl. The maintenance cost is very low. The car parts are easily replaceable.", "Mahindra Scorpio is a very spacious and good in control vehicle. And has many features. Also, seats are very comfortable but one problem is the handling of steering is too hard to control. Waiting to have a variant in Mahindra Scorpio in automatic transmission. The brand needs to improve the dashboard.", " I buy this car and get worlds stylish SUV car. Mahindra Scorpio is a great car overall.", "Excellent car, fun to drive and average maintenance cost. Good space for my family and good for off roads.", "Best car SUV in India. It is the most affordable SUV in India. The driving experience is very nice.", "This car is ultimate for off-roading, its overall performance is amazing.", "I am Scorpio lover l love height of Scorpio when drive Scorpio in off roading it's give good respones", "It has SUV it has a power full engine all so in my family to fast SUV in the world India has more buyer for this car", "This car has very great look and best speed, also the engine is great.", "I recently took a test drive of Mahindra Scorpio and its amazing, very enjoying body role with good and fast acceleration and give us a good feel will overtaking on high speed.If someone has a budget for 18 lakh(approx) I will advise you to go for Mahindra Scorpio.Thus, Scorpio is the most selling SUV in its segment than also Mahindra is not upgrad...", "It is an excellent car. I have driven it for 2 years. I have a dark blue in colour. It is better than Innova. I love the car soo much, that I don't want to buy a new car.", "I like this car as it has good features, comfort, and cheap rates and good handling, powerful engine good services, very reasonable prices and does not have many maintenance charges. Paint quality is good, headlamps are good interior hands-free is a good feature, the best car for city and traveling.", "This car is so good that I can not believe and then the front looks like the mustang.", "Best off-road car. Driving experience is wonderful. This is best suitable car for Indian roads. In this car black color is amazing with alloy wheels. Powerful performance on highway and off-road.", "I had never seen any car like Scorpio because it is my favourite car. It is affordable it gives you the feeling like you are sitting in a very expensive car when it drives on the bad road you don't feel like it is a bad road it works very smoothly.", "Best design in the class. Interior like luxury cars.Comfortable enough. Mileage is great.", "This car is amazing, the fuel average of this car is so good. when I drive Scorpio on the highway it gives 20 KMPL average. Pros: Best for the farmer and hilly areas in the segment, the most powerful engine, driving of this car is so smooth and the camera of this car is amazing.", "The car is very nice with great mileage, comfort level and looks. Also, the car is very spacious. The turning point is awesome. The power of the engine is nice. This is a family car.", "This car is very strong and the look is very amazing. New Mahindra Scorpio is a new 7 gear with 1 reverse gear. Boot space and legroom space is very large and sitting is normally comfortable and most attractive, 7 inches android touching display, with music system and cruise controller in steering.", "One of the best car. The performance, the power, the torque, the exterior, the interior, all features are good.", "Scorpio is nice and comfortable. A great car for long trips.", "It is a very good and great car in high power engine, It is a great car on rocky and swampy ground and sandy land, its look is also very good. Interiors are different, which are like expensive cars.", "It is a very good car and looks are very beautiful. Design is also very awesome. I love this car.", " You should buy this car it is really amazing. Mileage is good in this range. The interior design is best. I loved the car the most. Excellent car for family and friends. Good in the adventure. Long trip car. Amazing service and great space in between the seats. Alloys are very durable. Good music system.", "Comfortable and royal ride with big space and nice running on the road and it comes with a very good music system.", "Amazing experience with Mahendra Scorpio, the comfort level of this car is amazing.", "Perfect SUV for both rural and urban. It is a great car in terms of performance and comfort.", "I love Scorpio not only for its look but also for the comfort and smooth driving.", "My family is using this car for many years and still, this car is performing much better than other cars. Its control is awesome and the looks are at the top.", "Good SUV, royal look and resale value is also excellent, I love my Scorpio very much. Its maintenance is also reasonable. So overall it is a good vehicle.", "I have been a Mahindra Scorpio lover for a decade now and have upgraded to the 2015 model after I sold the previous generation Scorpio. Beginning with the things I love about the car is the whole exterior. LED Headlamps, the aggressive grill, the bonnet scoop, the backlights. It appeals to me as an overall package oozing strength when looked from t...", " Good performance, excellent power, amazing mileage and comfort.Overall a great car.", "Best car ever, All its features are great.", "I think this is the best car for Indian roads.", " Easy and comfortable for long drives. The seats, AC and other features are great.", "Good looks from both interior and exterior. Excellent mileage in this segment, Low maintenance, It feels you are the king of the road while driving this Car.", " A most powerful vehicle with great comfort and style.", "Everything thing is good but the car price is not good otherwise the style and performance of the car are great.", "Scorpio is the best car. But price is too high. And one of the best off-roading car in the segment.", "Very good SUV, very powerful vehicle. I am using top model variant S11. we are using it for five years ago and is very powerful and sharper than any other vehicles, you compare it to KIA Seltos, Inova. It has awesome features.", "Top car with great features. It has a muscular body, and is very comfortable, also the music system, central locking system, AC is great. This seven-seater car is a good family car.", "Excellent SUV in look and also is good for long-distance travel because of its comfortable seats and suspension. This car is too amazing, it's very stylish and has a very good look. I love this car and this is very comfortable. So l suggest you buy this car.", "I fell in love with Scorpio when I first saw it. It has a very muscular look to it. It has very high wheelbase and because of this, we can it for offroad driving. But the interior quality of Scorpio is not very appealing and as far as safety is concerned it is not a very safe car. Now every car is having some of the basic safety features. I would l...", "This SUV segment car is good for off-roading and has best comfortable seats with good features, Good mileage and also its looks are amazing.", "Its muscular shape, powerful engine and flexible suspension and smooth driving make it an excellent SUV.", "This car is a best SUV car in this price. This car is a low maintenance SUV car. MAHINDRA SCORPIO S11 is the most powerful car.", "Northern favorite SUV With automated interior Feel like the hulk. Awsome drive experience you can get. As well Mahindra is known for its interior.", "Mahindra Scorpio is most likely for people because of SUV cars have a very powerful engine and its massive look. This car feels like an elephant and very good control for any other car. It is very smooth and fabulous in our driving. The car looks in the rear and the front is very charming and the sheets and interior are designed with a very sh...", "Indian's love SUV. The Mahindra Scorpio is one of the best SUVs in India. There are many cons, but the Indians don't mind it, if you want a rough and tough SUV you should go with Mahindra Scorpio.", "Scorpio this car has its own powers. I had been trying to buy this car from the launch. I bought this car in 2017. I am this car enjoying it very much. This is made for the roads that are not stable. This car has amazing pickup powers, it can reach up to 160kmph and 0-100kmph in lesser than 15 seconds. This car is my first preference when we h...", "Scorpio is the best segment car in SUV, the best value for money, the feature in car are nice. No problem in any season running in this car low maintains car. I am proud of Mahindra Scorpio car this segment . My best life choice in Scorpio. ", "An awesome, comfortable car and also fast in this segment. It's not that hard to drive, when you sit in this car you'll feel like you are sitting on the top floor. It never lets you feel thrilled in high speed because you can control this car anyway. But drive safe on your limited speed, If anyone wants to buy SUV then go for it...", "This is awesome SUV, suitable for every situation like offroading daily running long trips, etc. I had this SUV for more than 8 years till now no problem I face. This is the best SUV in its segment because no other cars had space like Scorpio.", "The Mahindra Scorpio is an excellent car in the segment packed with features. I am waiting for the Mahindra Scorpio 2020 model.", "Scorpio is a powerful vehicle. The car looks very good and I like it very much.", "Best SUV ever, I drive on off-road and Indian village its beast on wheels I love this and the Mahindra service is also great.", "They look is awesome and also have smooth suspension. Easy to control, also the car has great looks.", "This is the number one SUV in India. It is so simple to operate. Also, it is very comfortable,", "Amazing look, powerful engine, and amazing alloy wheel and stereo system, And after-sales service are nice.", "Mahindra Scorpio ever best car in India I like this car very much. Highly recommended.", "Enjoy a full family pack 6 seater car. I can't express my happiness, it is a very comfortable car.", "Best car in this price, top SUV car Scorpio.Highly recommended.", "Amazing car, compering this car with other cars it is one of the best cars.", "It is a superb car i have two Scorpios and i am going to buy one more in 6 months and its features are also nice so i prefer to buy this car in black colour because i like it very much classy.", "Better for Indian segments, It's very beautiful and so comfortable in the segments at this range.", "The car is nice with great suspension and mileage.", "I am very satisfied with this car. It is a muscular car and also a comfortable car.", "I liked the car very much as the new model S11 Is much smoother than S10 and has an improved display.", "This was my dream car and today I am happy to have it. I love Mahindra Scorpio it is an awesome car with a good look and interior design.", "I have this beast for about 3 years. Scorpio is a car for SUV lovers. Powerful engine, comfortable seats. I have installed a 7-inch touch screen infotainment system. Everything is going well. I am happy to be part of the Mahindra family. ", "Mahindra Scorpio is one of the best SUV in Mahindra.,although it has a smart monitor with a 15-inch display.it is the main function of Mahindra Scorpio, then it has 6 ac vents,2 cup holders, and 2 armrests for comfort and the engine is about 2500 cc..alloy is available in Mahindra Scorpio s11...", "The best in segment SUV with all features.A powerful beast. Have a bold look. There are some issue which is left in Scorpio like apple car play, android auto, and auto fold arms", "Indian's love SUV. The Mahindra Scorpio is one of the best SUVs in India. There are many cons, but the Indians don't mind it. If you want a rough and tough SUV you should go with Scorpio.", "I love this car. It is the most beautiful and fancy car it goes smoothly on-road or offroad it gave us a good journey to go anywhere in India, its fuel is also good. when you buy this car then you feel that you are in a luxury car.", "It's a very nice vehicle and this my fastest vehicle I want to do long-distance driving and, it is a comfortable vehicle.", "A very good SUV car and a very smooth driving car.", "One of the best SUV car amongst all SUV segments. Highly recommended for youngsters for rough and tough appearance. Bold and strong design with superstitious performance. The black color is my favorite one. Overall THE BOSS of all SUVs.", "The car has fewer features but when we tock about looks it is excellent better from the old Scorpio The is good The performance is so cool and better. Now look for negative points of the car is not having good features, not having the sunroof, more space, we think the new version will fulfill the things. The look of the new Scorpio will be mor...", "I have not expected that much fun with this car, this is a fun car to drive and very punchy performance is on offer, I use to offroad every Sunday and every time I feel very good but the fact that this car has 0/5 safety rating keeps me worried while Driving every time But even after all these things, I love this car.", "It is a nice SUV in this price range and design is too good and mileage is better than any other SUV. Overall it is the best and affordable SUV.  ", "Itis the best looking SUV car. The features of this car are superb. The design of this car is very beautiful. ", "The only one which is suitable, strong for the same families, more powerful and good going in urban areas.", "Nice car shape and interior look awsome As compare to other mahindra car it is the best car.......🔥", "Very. Ruff and tuff car. According to Indian road Muscular shape. Fit to youngster personality.", "Scorpio can be rated as a good car.it is a heavy car and very smooth.it produces very good power and can run very fast very good cabin space. luxurious interior. as a seven-seater SUV, it looks very good. very good ground clearance. a middle-Class man can also easily afford this car.this car comes with many variants.", "Excellent driving experience and great suspension embedded in this beast.", "Mahindra cars are good looking and they are affordable as well. It is an off-roading vehicle and also, a comfortable vehicle.", "Mind-blowing experience with Mahindra Scorpio great pickup great engine sound. You will feel very comfortable n smooth in this car. This is my dream car one day I will buy it. Great mileage with this much luxury, best price with this much of functions. You will never feel bored in this car and enjoy a worth penny you spend on it.", "Mahindra Scorpio is the beast by work. Its the only car that everyone dreams to have that because it is capable of ride anywhere. I have tested in rural areas when I was traveling with my friend but on things is missed that is lots of technology in comparison to another car like the internet inside big display sunroof but it is not compulsory We ca...", "This car makes me speechless. As everyone knows about this successful car. I am having a great experience so far. It gives a mileage of 18kmpl and it also churns great pickup, The comfort level is unbelievable and is quite affordable.", "Scorpio looks are stunning. They are extremely agile, especially on Indian roads. Acceleration is jaw-dropping fast. The car is designed for 4 pax.", "Great looks and best for all road conditions.", "We have owned a diesel Mahindra Scorpio for some 9 years now and it has been an interesting ride so far. I learned how to drive with the Hyundai Verna and the Scorpio. The two great cars amongst the lot. The Scorpio has exchanged so many hands and still drives as smooth as day one with minor changes. It's a little noisier now and the pickup isn't t...", "Mahindra Scorpio ￼￼￼￼￼comes in price range10.02 - 16.58 Lakhs Avg. Ex-showroom Price (Incl. GST). 16,998 Starting EMI Get EMI Offers ￼Mahindra Dealer Mahindra India Sponsored Contact dealer for ￼ Test Drives Offers &amp; Exchange EMI Options   Insurance Get the Best Deal Mahindra Scorpio Price List (By Variant) variant price Sco...", "Mahindra Scorpio the best choice in the car and this car is excellent for offroading. Looks of this car are Awesome.", "Mahindra's Scorpio it's a car which gives you a feeling of 'King of the Road' because the drive of this car is very smooth and it has a superb height and the quality is also very good and impressive and the power of this car is very nice and the torque and the BHP it produces is just wow and the car's comfort is also good most of the buyers take th...", "Mahindra scorpio is a one of the best car in india . There are many suv's but scorpio is the best suv . Scorpio is one of my fav car under 20 lakh", "Great car with the ultimate driving experience. Amazing mileage and maintenance are also nominal.", "Best car in its category. It's the third Scorpio I'm currently using and I am very much satisfied. The engine that Scorpio gives you is really powerful and you will never regret it when you'd press on the accelerator. It is Indian road-friendly as its whole suspension and shockers are powerful.", "Excellent comfortable classy. In one word its is the best car SUV classy love it. Powerfull pickup. Love the ride its suspension system is just awesome it gives us feel as we drive.", "Mahindra Scorpio is an amazing car made by Indian company Mahindra. It's a nice car for a family purpose with superb performance. Mileage is good even in rural areas as well. Build quality may be improved by Mahindra . It has a very powerful engine in both diesel and petrol. The engine is so powerful in this car. ", "A wonderful car so far and has enchanting looks.", "Best in the segment and known for its comfort and performance.", "Great experience with a great car.", "Scorpio is amazing to drive SUV car. Its pickup speed road presence everything is too good. When I drove this car from till date to today I became a huge fan of Scorpio.", "This car is very good and full of power which is liked by every Indian ki because it is a very popular car. The company has given me a good feature of safety in this vehicle, and what I find the best thing in this vehicle is its boot space which is very good, the company has given very good things in this vehicle. In my opinion, this car is the bes...", "The real SUV Beast. When it comes to SUV, Scorpio is an amazing machine. Driving it is a sheer pleasure.", "I purchased Mahindra Scorpio S11 in January 2018, as it was launched from then till now it doesn't give me any major issues, from time to time I gave servicing, Running smoothly and fine mileage in city 13-14 kmpl, on highway 14-15 Pros Tyre pressure and temperature monitoring. Off-road capability. ", "Best car till the date. More sporty look as expected and always feel royal.", "Mahindra Scorpio is a nice car like a beast, a great experience of the car. I would love to see further upgrades to Mahindra Scorpio. The sunroof should be installed in Mahindra Scorpio.", "Any car can't beat the powerhouse, Excellent comfort of Mahindra Scorpio. And has excellent looks its like beauty with brain.", "Amazing performance with ample legroom space and boot space. It's very powerful and has an attractive look. Best for off-roading.", "This car is mindblowing. I have many cars but it gives you a smooth drive and its mileage is awesome. Its pick up is also good and value for money.", "It is a superb car. This car is very comfortable, good seating space and a nice interior.", "My experience with Scorpio is very awesome. It made me feel like a king as the seats were very comfortable. Has a royal look.", "Well this SUV has got a good power under the hood, has a good service network and great resale value, but it feels kind of outdated now because the company hasn't updated it from the past 2 years. When they launched the s11 with minor changes, Scorpio is competing with the new cars which have more features in the same segment.", "The best SUV car in my opinion and looks wonderful in black. The features of the new Scorpio are amazing.", "The Scorpio is best in comparison with its rivals. It has the best interior and exterior. The best experience ever had in an SUV.", "Great car awesome pickup, its an all-rounder. I have a great experience with that car. I have started my journey from Jaipur to Spiti valley. I have not faced any issues with this car.", "Wow! It is a nice SUV in India. Its interior is very beautiful. The seats are very comfortable and the leg-space is good. So, we can even enjoy long rides. It has automatic lamps and climate wipers which made a good impression. Its transmission and performance are very smooth. It has a six-speed manual transmission and gear shift indicator. It...", "Awesome features in the new model. Scorpio is a tiger and the speed is faster than expectations. The braking system is good.", "Nice and comfortable. Mahindra makes always excellent cars. It's quite affordable.", "This car has excellent performance. I like Mahindra Scorpio because it is the most powerful &amp; expensive vehicle. Scorpio's experience is very good. It looks beautiful and mileage is best than other SUVs in this price range.", "Power and luxury combined together in a set. Wonderful car and I bought it in 2019 it was the king of all cars. Very powerful engine.", "Good and comfortable car. It's a family car, big space and comfortable, good for a long drive, braking are also very good, I suggest this car to all.", "Suspensions are hard, but a beast to drive, interior material is on the downside, technology is a bit laggy, steering feels heavy, the engine rattles a lot and the engine noise is even much disturbing but good to be taken off-road as there is no tension of break down and the interior door handle feels cheap. It even lacks a front door bottle holder...", "This the most powerful diesel engine and a big tire with more safety features. Four-wheel disc brake, etc.", "Nice and the best car in the world. Best average, best grip on the road, value for money, excellent performance", "I am using Mahindra Scorpio M Hawk since last 6yrs and I am totally happy with this product. Needed to change tyres once and no engine problem occurred till date. You can also go for power steering and this car also have child lock, you can drive this on farming fields too if needed because I do that when needed.", "I love that car because that car has a royal personality. I like the black colour for this car. This car has very comfortable driving experience and best for long travelling this can also be driven for off-roading. I like big wheels of that car they can arrive on any big stone and any pot-hole. I like the car because the price is low when...", "The engine is so powerful and the interiors are also very good. It is comfortable and safety features are excellent. It is the best SUV to purchase.", "Mahindra Scorpio is an extremely good looking SUV on-road and off-road as well. It gives better performance. I would personally recommend if anyone is looking for SUV then close your eyes and buy Scorpio.", "Mahindra Scorpio looks very good externally but is full of internal problems. In order to adjust the driver seat, we have to open the door. Bottle holders are useless and too small. Internal design in terms of usage of space is poor. Even though the car is big but the middle row is not too spacious my legs touch the front seat. There is a long...", "The car will guarantee you peace of mind over rough terrains. It is also a reliable SUV that can keep going on for thousands of kilometers without any major issues if the car is serviced regularly. Mahindra's basic vehicles are highly reliable. This is also why they are very popular in cities and villages. For example, Mahindra Boler...", "It is the best SUV for Indian roads. I have an S10 variant and its mileage is also good and the pick-up is superb. The cruise control also works fine, not as much comfortable as other cars but comfortable enough, it would be great if they increased inside space. The music system is good but needs little improvement if you compare it to ot...", "Mahindra Scorpio is an awesome car. It comes with good looks and speedy performance. No compromise with anything. Two words that explain the car are Solid and Bravo.", "I bought a new Mahindra Scorpio S9 and it is a really awesome vehicle. Very aggressive, stylish, sporty and muscular looks. The mileage is 17-20 KMPL. The first servicing charged only 2300 Rs. There is a body roll problem but you can avoid it from its driver's seating comfort. When I ride this vehicle every one looks at me. Its ...", "Mahindra Scorpio is Known as the king of the road because of the height of the car and seating adjustment. The engine has good power and delivers good mileage, and performance-wise is way behind but is not a big problem because of love towards the Scorpio. The pick up of the car is much better because of its mHawk diesel engine ...", "Mahindra Scorpio is an excellent car. I enjoy each and every ride. Spacious and very airy cabin. Massive road presence.", "Mahindra Scorpio is an amazing car with feature compatible with XUV in such cheap cost with a huge variety in it. I have no more words for this car only saying that I LOVE THIS CAR.", "My car Mahindra Scorpio is super excellent. Scorpio is a very good choice for cars and I recommend the buyers to buy Scorpio. If you haven't driven it then take a test drive. It is a very eligible car in 18 lakhs and its base model is of 11,45,000. This car is very satisfying and this car 7-8 persons can be fitted easily. I strongly recommend the b...", "Mahindra Scorpio has good performances, wonderful look, feel free to travel with Scorpio. A very important point is it gives very comfortable ride experience even on the very hard road it can be driven on the uncomfortable road and travel forest area nothing could be competing with this giant Scorpio, it's a lovely partner.", "Powerfull car with good mileage, more comfortable and good for a joint family.", "One of the best car. Max power max feature and give max respect. Best in comfort and big space.", "According to the price find a car that should be more comfortable like Innova Crysta also its maintenance cost is very high.", "Best SUV in the segment and has the best appearance on road lovely look like the king of the road. But some noise came from the gearbox. The DRL(Day Running Lights) of this car is the best in looking.", "This is a great vehicle. I love it. I always see dreams of bringing it home. I am sure I will be able soon to bring this home. This car has comfortable features and it has power. This is very good looking and stylish. Its wheels are so powerful that they go to any offroad without hesitate.", "Scorpio is the best car. I love this car.the speed between 0 to 80 kmph is so fluid interior of the car is amazing and best car to show off.", "Mahindra Scorpio is the first car I bought Scorpio s10 this is the best SUV in under 18 Lakh's best off-roading car in my point of view in this range and low maintenance also. You can buy this SUV best in the segment.", "Mahindra Scorpio is an excellent car,  super comfortable, excellent for long drives, strong body, excellent engine, great ac, good safety, best for office work, good wheels comfortable for long drive, good speed 200kmph. It has ABS it has one airbag good breaks, headlights, radio, speakers, seatbelt and good engine sound.", "Mahindra Scorpio is the best SUV in its segment. I recently bought a Scorpio S5. I am fully satisfied with my car. It's good for a long journey whether in the city or also for off-roading. Ground clearance is good. It's a powerful SUV in terms of safety features.", "I have been a Mahindra Scorpio lover for a decade now and have upgraded to the 2015 model after I sold the previous generation Scorpio. Beginning with the things I love about the car is the whole exterior. LED Headlamps, the aggressive grill, the bonnet scoop, the backlights. It appeals to me as an overall package oozing strength when looked from t...", "Mahindra Scorpio is the best car for a businessperson. One can easily drive it, and can be easily maintained. Likewise, it's just awesome. Mileage is good. One of Mahindra's most profitable, best, good looking, awesome products in the market.", "Mahindra Scorpio is a raw hybrid of slight sophistication and lots of toughness. Good for both city ride as well as mild offroad. The latest variants are up to date technologically as well.", "The Mahindra Scorpio is the king of all SUVs. The new muscular hunk design makes it a monster on the road. The vision from the driver's seat is absolutely stunning. The engine and the suspension are strong enough to take on some off roading adventure. There is no competitor to this car in this price segment.", "Best and the most selling car in this segment and this car come with so many features at a good price range. ", "Mahindra Scorpio is an excellent product of the Mahindra group. Its AVG is very good and looks like a strong car Don't affect the car when the drive-on dull road or dangerous path. Mileage and A.C are good performance. I was buying Mahindra Scorpio S5 of 2019 model.but in this product one thing is repeated again and again it's the back do...", "Mahindra Scorpio looks are very cool. Nice car, Scorpio drives like a tiger. The seats very comfortable. The performance is amazing.", "Scorpio is the most dealing car and its performance is very good. Scorpio looks fantastic in white and black color. Its speed is amazing in hilly areas.", "It is a good car in our country. We can drive it on any type of road. I like the interior design and the seating capacity is amazing. The space in the car makes it luxurious. The shape of car will make it more comfortable for handling. The performance of the engine is very amazing, and it has a tough body.", "Mahindra Scorpio is one of the best SUV cars. While driving it feels like a king. The sitting position is very nice and it looks like a bulky car when You drive the visibility is superb because of the sitting position. Luxurious car ever, 7 people can sit easily in the car even can sit comfortably. Now if we talk about the engine, this car is havin...", "I have Mahindra Scorpio S4+. The car has heavy engine, unbeatable pickup. It gives the best mileage. It is a complete package of SUV.", "This car is made for its toughness on the Indian roads and it has loads of features.", "Supercar and great futures and easy to drive on off-road.", "More features, more power, more speed is available in Mahindra Scorpio. I love it comfortable journey with the car.", "Excellent car with good comfort. I love Scorpio and it can go anywhere a mountain or a valley. It's so smart.", "Now the new model of Mahindra Scorpio is awesome.it is a perfect SUV at low cost and best features along with this car. I have a great experience while riding this car. The colour variant is so good compared to other cars. I am satisfied because of its features of the exterior and interior. Especially the interior looks extraordinary compared to ot...", "I m using this car from the past 8 years Best experience best response Just fit and finish quality of Mahindra is poor Even after using this car for so long it doesn't ask for any kind of maintenance but still the quality and response from the Mahindra is average. Still very happy with my car it is like my buddy. ", " The new Mahindra Scorpio odd numbers varients (3/5/7/9/11) has a beautiful 7 grill design which makes it looks more stylish and attractive as compare to previous even numbers varients (2/4/6/8/10). Its sounds goods when you say I have S11. Scorpio is a car which is nearly known by every Indian.", "Mahindra Scorpio is the excellent SUV that's REAL. Ruff and Tuff go silent on a rough road. There is no effect inside due outdoor bad roads. Specially designed faster and stronger routers never been late. It's top model got 4×4 power wheels they all can run at a time that's why they can't get in any harmful conditions that's Real Power.", "I used the Scorpio s10 model and it gives me excellent performance and good mileage.", "A very good SUV in this price segment which can be used for rough and tough driving. Feels and presence are very good on-road while driving. Light steering in comparison to earlier models. Mileage is very good too it at least gives 15kmpl at decent driving. Everything is good except music system speakers quality is very bad.", "Mahindra Scorpio is the most comfortable SUV. It has best space management. 50 km done and it still looks like a new car. You can blindly go for this car.", "Both interior and exterior are good. Mileage is fine too. It can be driven on a daily basis. Runs very smoothly.", "Mahindra Scorpio is a great and powerful SUV. It gives a very smooth ride.", "Mahindra Scorpio is the best car with nice stylish looks. The car is having so many features like alloy wheels, power windows, and good speed.", "I am using Mahindra Scorpio S3. It is a good 7 seater car. It gives good performance, power, mileage and low maintenance.", "Mahindra Scorpio has good exterior and engine. This car has good built quality but the interiors and dashboard are not good.    ", "Mahindra Scorpio is a very powerful car of Mahindra Company. It has nice body and nice looks.", "I would highly recommend buying Mahindra Scorpio, as I am also the owner of Scorpio s11 4wd price features its entertainment system is very very nice and good to operate, the back camera is good enough, airbags but nice it supports fun driving and has special sky cabins very nice for a family.", "Love my Mahindra Scorpio very much. Its suspension is much on the softer side but then also while cornering you don't feel any problem. The thing which I love the most about this car is that at higher speeds (120_140) it does not create any vibrations and it gives great confidence while riding it. Best car suited for long rides. Highly recommended ...", "Mahindra Scorpio is a very attractive car. The car is looking very good, it has 2 airbags in it.", "It is an awesome car with great looks and it has a lot of space.", "The exterior of this car is the best thing in the world. Apart from this, the engine quality and beautiful interior are the best. 😍😍😍😍😍😍😍😍", "Mahindra Scorpio is really a smooth car and it gives good mileage and performance. I am delighted with my car.", "It is one of the most affordable SUV that can seat seven comfortably and double up as a cargo van whenever you need it to be. The wall-like dashboard is functional and because it is so close to the firewall, it helps open up more cabin space. Apart from these, you have a chubby slit fore of gear lever and a rubbed...", "Mahindra Scorpio is an amazing car. I am very happy to buy this car. It is one of the best off-roading cars I have seen.", "Great experience, great SUV, great performance Suspension quality and engine power are good. Space is also very good in this car.", "I like Mahindra because it is ac very nice company. Scorpio and Xylo are one of my favorites. Very comfortable and has good leg space in the third-row cabin as well.", "The engine of the car is very powerful and comes with less space. Also, the suspension is quite stiff, features are less as compare to other cars. But overall I like this car. ", "Mahindra Scorpio is a very good car, I like to drive this car. It is too safe car and seatings are also very comfortable.", "This is the best car and it comes with a strong body and good safety.", "The buying process is smooth and easy with proper explanation of car. Better performance and good pickup with good service. The car is the best SUV in the segment and gives a luxurious feel to the owner. Comfortable seat but there is a problem with the manually adjustable seat. Cooling of the car is good enough, bold visibility, and&amp;...", "The car is so good.it is my dream car. This car is super comfortable. I really love the design of this car. It also has good average.it also have very powerful engine by which we can drive this car anywhere. It also has an automatic brake system which is very good. It comes in many different colors like black, white, etc and my favorite is black.", "Mahindra Scorpio is one of the cheapest and comfortable cars among all the variants.", "It gives you an excellent ride quality, the top 6 gear make zero noise inside cabin new S11 varient. It gives you a mileage of about 15-16 km per liter. It is a tough SUV with features like cruise control and voice commands adds more to luxury. Overall it is a best package of comfort with ride quality, power.", "Scorpio is the best SUV to date out of all SUVs in the market. Although it needs a major next-gen update. But its S7 and S9 variant is still value for money. Every SUV lover's first choice...", "Most selling car as a symbol of power, off-road capability, luxury, and fluid performance. This car bow adds a more look, tough engine, and a better interior.", "Mahindra Scorpio is very nice and an awesome SUV.", "Good value for money SUV this SUV is best in 15L range.", "This is a very nice car. It is a valuable car in this price range. The looks are awesome. The features are amazing. ", "This SUV is the most fantastic SUV and better Features Thank's to Mahindra And Mahindra rise.", "Superb SUV Car and excellent features at a good price range.", "Very nice and beautiful car with good engine power it is a great SUV for middle-class families.", "Wonderful car, road grip was amazing, stylish interior, very comfortable seating system, I like Mahindra Scorpio.", "Very nice and large full car I am impressed with Mahindra Scorpio and SUV500.", "I love this car. This car gives me good performance and great mileage.", "Mahindra Scorpio is good looking car with best price and gives a lot of satisfaction.", "Scorpio is a dream car ever. In the market, we have many more SUV'S like Duster, Safari, Terrano but Scorpio is a dream car forever.", "A very good car. The best SUV and also perform the role of a luxury car. Features are also very luxurious the cart look attractive in black color. It is a muscle car. It looks big like Himalaya hill. It is great for offloading. I have to Scorpio s11 that are really hulk cars if you modify it looks like a monster car. In Punjab where I live the peop...", "Mahindra Scorpio is one of the nice SUV cars, but one problem in new Scorpio that there is no AC option for last row (3rd), that's why suffocations problems are created, plz try to improve Air conditioning options for last row (3rd row).", "Scorpio is a very good and powerful SUV and it is a great car for long journies. Great car at this price range.", "A very good car. The best SUV and also perform the role of a luxury car. Features are also very luxurious the cart look attractive in black color. It is a muscle car. It looks big like Himalaya hill. It is great for offloading. I have to Scorpio s11 that are really hulk cars if you modify it looks like a monster car. In Punjab where I live the peop...", "Mahindra Scorpio is the perfect SUV in the business field and for a large family. If we take one Scorpio and if we can be resold after 7,8 year their resold value will be perfect, and we can get the perfect price for our new car. Its mileage is awesome according to its engine and its heavy body.  All over my review is that ...", "Scorpio is totally sports car just imagine like a king of all cars in short whenever Scorpio's entry on road among other cars that the seen as the father of all cars.", "This is the best car in this segment. The performance is amazing. The look is stunning. It is a spacious car.", "This is a good car. The looks are sporty. The engine is really powerful. Overall a nice car in this price segment. ", "Mahindra Scorpio is a nice car with good mileage and good suspension system.", "The king and the legend of all time. It is the most powerful car.", "Car is excellent. Has excellent led light, price is reasonable, the car is more spacious, has good boot space.", "In this range, the car is perfect and it has every feature which is required for Indian road conditions. In a normal lifestyle, the person needs the perfect car.", "This SUV is also a luxury car for a normal person, but this SUV can run on any road, it can use anywhere as in the villages for farming materials, offroading, etc.", "Mohindra Scorpio car is very heavy to see, the car at first start, time the driver,s..mind ultimately is cooling..fresh..mute mind drive time journey scholar, jumping &amp; passenger is sleeping under the car,..so, I think that car is choice in our India minimum 85 men &amp; women.", "Mahindra Scorpio is really a powerful car with great looks &amp; features and gives you good mileage.", "Best and powerful true SUV with automatic transmission is Scorpio by Mahindra. Powerful vehicle to be driven in city and highways without any usual knee pain and tiredness, usually, all the powerful SUV driving people to suffer to shift the gears and press clutch. Proper 8bpeoole can accommodate in the vehicle, not like another vehicle promise of 8...", "Good Mahindra Scorpio, comfortable and safety for long drive.", "My car is 12 years old and is still doing it's best. It is still running very good with minor repairs. Tine has come to give her major updates. Memories with that never fade away. Mahindra Scorpio is an amazing diesel engine with great power in its sector, Scorpio can also be called Indian muscle.", "As you know Scorpio knows for its muscular body and off-roading feel I buy Scorpio s10 in 2018 my experience was very good Pros. You don't feet any speed breaker and Mileage are also good Better then other SUV in this price range Feel luxury also Music system is good. Cons..-- The body rolls a little bit. Mahindra service just ok Road presence is e...", "Scorpio is one of the most popular cars in India. This is my favorite car and in my house, there are my 3 new Scorpio.", "Best SUV in India, best in class, I also have a Scorpio in black Colour.", "Mahindra Scorpio is much better than other SUV's but as per the price, it does not have features. Mahindra is only using its fame as the price is too high as compared to other vehicles This is the only con for it, but as per engine &amp; muscular look vehicle is best. So they have to improve their interior and fea...", "Very nice look, strong engine, strong body, and nice interior.", "Mahindra Scorpio is troubleless on road,superb pick up,relevant in time warning,riding comfort,well painted that never fades,easy maintenance, superb design, steering, and brake control is very easy, easy to control in zero speed with very heavy traffic,never skids even when brakes are applied suddenly,Air Condition system is very natural like affa...", "Nice car, this car features this car is fast and is for offroading. This is a 7-seater car, very smooth features, very easy and nice performing system.", "A class car for long drive comfortable for family best ground clearance car is strong for all-weather it is best for on-road &amp; offroad best for both way this car manage extra load style best for our India. Low maintenance pickup is the best mileage is 15km/l in diesel engine sound is smooth best bhp Scorpio is a successful vehicle.", "I'm getting the best market price for my car. I think it's best compared with another site .as a seller I feel good.", "This car completely fulfils my requirement .. the real Indian car, best performance, comfortable. The same comfort on road and off road .. I need to travel villages and city, the average monthly drive is of 5-8k km .. covered geographical area from Gaya to Kanchipuram, Kanchipuram to Rameshwaram, Rameshwaram to Pushkar Rajasthan to Delhi to Ayodhya...", "This is a fabulous SUV but the main problem in this car is there is no sunroof.", "All the best is mahindra Scorpio all in one I thanks and Mahendra Scorpio mileages is better ranging is better to control is the best.", "It is amazing.. the best thing in it is the voice of the Scorpio. It's the best variant is s7 because in it we have all the features that we want.", "Mahindra Scorpio is a very good car. A lot of features and this car is the best.", "Mahindra Scorpio is the first fully built-in India. There are many features in this car like smooth transmission, comfortable space, and a powerful engine. Also, the best 7 seaters car in this segment.", "Almost two decades ago, it was the Scorpio which helped Mahindra enter the new millennium with a new identity. After some initial hiccups, the Scorpio became the mainstay of Mahindra's scheme of things becoming one of the star products in their product matrix. And that is primarily because of its rugged nature and versatility. The Scorpio...", "Awesome car, wonderful performance, brilliant look, and most loving car. It has good comfort and best pickup in off-road and other roads.", "Best SUV till date, it has a very nice and performance on rough roads and always gives its best. Also updated according to the market.", "Mahindra Scorpio is one of the best SUV in the world. It's an emotion when you drive Scorpio.Best car for unsymmetric roads as well. You can use this off-road and on-road. The price of the car is also acceptable.", "Superb. Just superb I don't have words around my mind that describes the car. So if you want to feel it then buy it.", "This car is the most powerful engine because this car is not compared to this car and no one pick up this car.", "Simple easy available EMI Smooth and loveable All Scorpio variant are good looking and compart the First service in 5000 km and second service 10000 and 10000 for 3 to service No dought that Scorpio is good looking but the company has to think innovative look for new Scorpio.", "Scorpio s10 is the best car for everyone. It has a powerful suspension and effective braking.", "A great car with ultimate safety features, great looks and is very comfortable.", "The interior as compared with the previous models are very nice and it looks more luxurious now. Seats are comfortable but maybe like XUV500 they have to improved. Power pickup is amazing, the leg space in mid-row and boot space is very comfortable. The stereo system which comes with company fitted speakers is very cool no need for f...", "It's a huge monster. It has good power and mileage. One of the best car from Mahindra. It's always in high demand since the launch as we are getting many features in this car. We hope to have and unexpected Scorpio in 2020. Best SUV in a reasonable price.", "Mahindra Scorpio is the best car in his segment although this vehicle is not so luxurious. Its cost of ownership is very good and also have a low cost of maintenance. Although it has 140bhp, it is the very peppy engine. I have also purchased  S10 past year till now it runs almost 50000 km. I have only spent 20000/- on its maintenance. So, if y...", "Great performance with super looks. It can be called the Affordable Big Car. Powerful &amp; comfortable.", "The new Scorpio is based on an all-new platform comes with an optional on-the-fly 4X4 system. The engine has been tuned for both performance and efficiency. The mighty and muscular Scorpio is back in a new avatar - the first major generational leap in its 12-year run. The company had provided major upgrades and a new engine in 2006, a facelift in 2...", "Scorpio is the best choice for a 7 seater car. The Scorpio speed and control is the best for any type of road. The car has good comfort and performance.", "It's good for offroading and powerful enough. Amazing interiors and exteriors.", "The most powerful car is quite affordable.", "Very impressive and comfortable especially on a hilly area and reaches 0 to 100kmph in just 6-7 seconds.", "Great car with an awesome suspension as compared to the older version.", "This is the fastest and strongest car in the world and it is very popular in India.", "This is a really powerful car. The engine is very smooth. The looks are very impressive. It is a very comfortable car. The mileage is not that good. ", "Mahindra Scorpio is a good SUV vehicle and best in this segment. Its ride is excellent. Seating capacity is comfortable and ground clearance is better so I am happy to buy this vehicle. It looks are better.", "Its a good car in the budget. Good mileage. Mind blowing seating capacity. Good lights there are LED lights. Good in driving. Horse power engine. many variants for thos car make comfortable to buy. It is my second Scorpio my first Scorpio was also very good. this one is mind-blowing. Good suspension as needed. My suggestion is to buy this car rathe...", "Mahindra Scorpio is the best XUV  ever. This XUV  is very comfortable also the safety features are top notched. I bought this car 2 months ago. I am very satisfied", "Mahindra Scorpio is a good SUV vehicle and best in this segment. Its ride is excellent. its the off-road drive is good and setting capacity is comfortable and ground clearance is better so I am happy to buy this vehicle it looks is better and I am suggesting all person buy this vehicle.", "Mahindra Scorpio is excellent on Indian roads. Mileage is also very good as compared to other SUVs. Engine performance is very good . Pick up in all gears is very good. Back seats are comfortable on long routs trip. Also, driving is also excellent on the long routs.", "Mahindra Scorpio is the best SUV. It's muscular and the king of the earth, this is the best option provided by the Mahindra Brand.", "Hard and safe car. Good for a rough road. Comfortable car.", "This car feels like a king and the powerful engine and also awesome car.", "Mahindra Scorpio is the best car in the world and off-roader car in India.", "Mahindra Scorpio is a very amazing car with great features. The very comfortable car also AC is good in this car.", "An amazing car with best in class features available as compared to the other cars available in the similar segment at an affordable price range. ", "This car is just amazing. I like the spacious interiors and the dual tone interior.it also has a long touchscreen with reverse parking camera and sensors It also has a powerful m hawk engine which produces enough torque for SUV seats are also very durable and the cushion is very good although I recommend you this car.", "It is the favorite car because of its amazing looks and latest features.", "Mahindra Scorpio is a good car. Very good mileage in the car. I like the service from Mahindra.", "The car is right for its prize we bought it a few years ago and it is still in perfect condition. The infotainment system has the latest features.", "Scorpio is a very popular SUV in tier 2 cities. Because of low serving cost, low maintenance cost and extra space.", "The excellent feeling while driving, best in class, fun to drive beast with best in class features and good power.", "This is an excellent car. It is very spacious. The power is amazing. The handling is very smooth. ", "Scorpio is my favorite SUV car because of its best features and good space.", "If you have some money or you can buy a fully features loaded car then you purchase Scorpio.", "Almost two decades ago, it was the Scorpio which helped Mahindra enter the new millennium with a new identity. After some initial hiccups, the Scorpio became the mainstay of Mahindra's scheme of things becoming one of the star products in their product matrix. And that is primarily because of its rugged nature and versatility. The Scorpio is as com...", "This is a good option in the SUV segment because of its good engine power and affordable price.", "Mahindra Scorpio is so awesome and it's like a scorpion and it runs so fast.", "If you own Scorpio... U will never scorn it. I love my Scorpio and I am truly proud to be a part of the Scorpio family.", "My one friend has a Mahindra Scorpio and when he goes anywhere with his Scorpio I was trying to go with him because took a feeling of royal person I was trying to drive, but he never gives me to drive then i made my dream One day i will be driving my Mahi...", "I am using Mahindra Scorpio M hawk 2014, it's really a great SUV for Indian roads with a minimum service and repair costs, above all my Scorpio is giving an average of 14 to 15 kilometers/liter, I have tried it on all kinds of roads and my Scorpio always has proved its muscular power, Five stars for...", "This car is perfect for who want SUV car in this budget and this car is comfortable and its pickup is fabulous and its mileage is also awesome.", "This car is very powerful and effective. Also can be the best option for Indian village roads.", "Scorpio is a great vehicle, the sitting position is right and commanding. Good viewing angle, you cannot miss any type of incursions. You sit at the right height and the beast gives a race car rush when you hit the throttle all the way down. Ride quality is improved from the predecessors. Space is adequate and legroom is appropriate according to av...", "It has been the best SUV in Indian market and it still is with the minor updates. Well it's an solid SUV well put together with umpteen number of power train options with highest being varicor 400. And Mahindra's after sales is also good. And this is one of the good options in the market.", "Mahindra Scorpio is the best car. I am having the old model and my friend having S3, and both the cars are awesome.", "The best car for offroading and looks are also very good.  ", "This is like a beast and hero of SUV, the design is massive and terrific. A stunning performance, this is master of all SUV. I think this car designer is no 1 in the world.", "Scorpio best all-time in the Indian Market, Mahindra gives enough space in this car.", "The excellent car. I have been using it for a year and it has given a superb result and it is like my dream has come true.", "This is the best car in this segment. The features are really good. The looks are also good. ", "Best middle-class SUV. I have been using Scorpio for 8 years. Very smooth and comfortable &amp; easy to maintain. but from last few days, it's showing some technical problem", "I have been using Mahindra Scorpio, S10 since June 2017. Not only me, but all my seniors, colleagues and family members are also amazed by the comfort of this car. No technical issues which I have faced until now, tyres have to be changed at 20,000km. The car is used mostly in hilly terrain till now with comfortable feeling...", "This car is good in exterior and interior also good space inside and excellent for driving at field area and also very smooth and, the seat is good, nice suspensions and AC is very nice as compared to my other cars.", "That is a great car and very expensive. The car is safe and powerful car look is nice.", "This is a nice car. The safety features are amazing. It is a very powerful car. The looks are very impressive. ", "I have purchased a Mahindra Scorpio S2 model, good experience with this car good and it gives a mileage of near about 13 to 14 km /liter. Good pickup, attractive looks and Royal car at a cheap price. No extra maintenance charges and it will run smoothly on the bad road also.", "This is a very comfortable SUV car in this segment. It gives a good average. It is a very spacious SUV. ", "This car is awesome on off-road drives, adventurous and smooth, I love Mahindra Scorpio car.", "Nice car I m using s11 looks and engine performance is excellent. Rough and tough, road presence is great.", "Nice car with amazing features.", "Awesome looks with good features.", "Mahindra Scorpio is a very good car. It has been almost 7 years that I have this car. I don't have any such issues with the performance and the mileage. Overall a worthy purchase. ", "Excellent SUV, no words to say but only issues is bottle holders are small, other than that there are no flaws in the car. The performance is powerful.", "This is an awesome car in this segment. It is completely comfortable. It gives a smoother driving experience. ", "This is a mind-blowing car and pickup is superb and mileage is I found is around 18kmpl but in the city, this milage is 13 to 14kmpl and this car superb.", "This is a mindblowing car and pickup is superb and milage is 18 KMPL on highways but in the city, it is 13-14 KMPL  and this car superb as compared to the other cars in this segment.", "I have a great experience to drive a Scorpio top model. It has an excellent pickup, smooth power steering, strong braking system (ABS), and much more benefits. I drove it for long distance like in mountain and hilly areas. As you know that this is street king of automobiles. An excellent SUV in the SUV segment. So, I love this and I ...", "Yeah it's a wonderful feeling while driving this car and then it's more comfortable for all type of peoples The engine speed will be like an Arabian horse and this one of the best car in my life It has a good looking of all views and power steering will be given a perfect maintenance and it will have good turning moment", "Best pickup, best power system. Best car for family purpose.", "Comfort and outstanding performance. Scorpio has a powerful engine that provides high speed in less time.", "Mahindra Scorpio is the SUV but its handling is like a small car and its new improved interior are supper. ", "Scorpio is a very good and beautiful car, design lighting is very fast and powerful.", "I have used my car approx 3,40,000 km never had major issues, because of tire-Tronics the tires lasted 100000 km or above. Some times I have done 1100 km in a single day.", "Mahindra Scorpio a very good car for long drives but not so safe.", "Scorpio is best for village and the Scorpio is top for me and the Scorpio s11 is best and the Scorpio is top classic and the Scorpio is good top excellent for me looking like SUV top class and the Scorpio is best for all Mahindra car is top and the Scorpio and all cars of Mahindra is best for all so behave to buy the Mahindra SUV is best classic in...", "Very Robust and sturdy vehicle gives the impression of a muscle man, a complete Man", "It is an awesome car when we drive it it looks like we're driving a sports car.", "This car is the most amazing and powerful. This car is the king of Mahindra &amp; Mahindra.", "My best car.It is very comfortable while traveling on long tours. ", "Great looks with high ground clearance and power generation are great.", "The car is really is nice, I got it 5 years back and it's still like new and feels like it will continue to run nicely for over a decade now, value for money, especially for big families it's the solution to every trip.", "Mahindra Scorpio is a very heavy and proper off-roader car. It is the best car for Indian roads and also a very practical car. Some of the cons: 1.the last row seats. 2.the sitting position 3.engine noise(automatic one). Overall, it is a very good and perfect car for India.", "Must Deal with the all-new Scorpio. It is a great SUV. Its body, looks, engine, power rpm torque are simply awesome. The top model Scorpio S11 has a decent look. It Has everything that an SUV needs but one thing isn't their electric sunroof. The best thing is it's front grills when we use chrome in that they look awesome and on the rear glass insid...", "Just want to say simply superb and mindblowing..love to drive this ... it is having good space and height....good for a big family...this car makes family comes to closer and explore new places.", "Very comfortable in long drives and much good at performance.", "Mahindra Scorpio is the most popular car, the interiors are like a king type.", "Must Deal with the all-new Scorpio. It is a great SUV. Its body, looks,  engine,  power rpm torque are simply awesome. The top model Scorpio S11 has a decent look. It Has everything that an SUV needs but one thing isn't their electric sunroof. The best thing is it's front grills when we use chrome in that they look awesome and o...", "Mahindra Scorpio is a car for most office purpose and also for a long time traveling. Gives good mileage and inbuilt with excellent input structures. And have a very good look.", "Every feature is the best for Kashmir roads. It has all the things that are required out of an SUV.", "A car with a good pickup and is smooth to drive I have a shop and it is very helpful to me to carry my loads.", "A powerful car with a powerful engine. Best in class features.", "This is a unique SUV. Really its features and exterior view are awesome, in total it's an adult toy, I am highly recommending this SUV to all Indians, I just love this SUV.", "I am having a Scorpio S10 which I m very happy when I drive, it goes smoothly.", "Mahindra Scorpio is a rough and tough SUV made for Indian roads and highways. ", "This car's braking system is not at all good if you apply brakes, it skids. So my humble request is to avoid this car for family purpose because this may cause great injury.", "This car is good for places where there are no good road facilities as this car can be easily driven in all places even in agricultural bounded places", "Scorpio is the best SUV. I love this car from my childhood.", "A strong man from India. He knows what is the quality of driving on the indian road, so they will give real comfortability on road, off road, high range everywhere nobody can give comfort like new Scorpio.", "I bought this car last year and currently using this so I can tell my experience about this car through this review. I want to say this car is very wonderful no other car compares to this.it' IS very good in mileage. It looks nice and very comfortable. larger seat and an important thing when you walk with this car it feeling awe...", "Excellent car, excellent performance of this car, I love this car.", "Excellent car, easy to drive, especially off-road, Very good experience.", "Scorpio is one of the best cars I can suggest you under 15 lakhs. It has all the required features.", "This is the best car if you want a muscle car. It gives you a look like Fortuner at the best price.", "Super pickup best cars in the range. Mind-blowing best pickup super mileage, chilled AC, tires are also excellent.", "Mahindra should name it the beast. Great SUV with excellent performance. One of the best car for the hilly area.", "If you want an SUV feel then go for this beast, not much capable for off-roading but still it gives SUV feel though.", "Its always been a macho car. Its build quality, looking and control on the drive is excellent.", "Having driven of my Scorpio S3 through almost all terrains from Delhi to Himachal in extreme cold to scorching summer heat my silver stallion has clocked on an average 15km / litre on an average speed of 50 km/ hr with no sweat even on HP's steep uphills. My adrenaline flow always ran high maneuvering my S3 beast up and down the winding roads as wi...", "Best choice in low price SUV that is Scorpio S11 it has an own passion till now compared to other SUV to the Scorpio it's not more difference in power, space, or the fuel economy.", "Mahindra Scorpio is a very good car. I love this car. it's very comfortable to drive.", "It is, in fact, a very good SUV if you have a good budget. Mahindra Scorpio is an SUV car for buyers who prefer a rugged vehicle with a butch stance and not a sleek and curvy vehicle.", "Mahindra Scorpio is the very powerful SUV for off-road dis SUV engine is very powerful.", "Mahindra Scorpio is a good looking car with a spacious and comfortable interior.", "True legend since years, consistently upgrading features and models. King of off-roading.", "Mahindra Scorpio is an excellent car with higher power and unbelievable power.", "Best in this price range with great features like voice command and cruise control.", "Mahendra Scorpio is one of my best cars and stylish the look and engine power was so good it gave me a smoothness and better comfort for a long drive and all specifications I liked in this car. In this car white and black is my favorite color.", "Mahindra Scorpio is the best SUV in its segment. I also drive a Scorpio s10, best mileage, best performance, and best power getting in this car. Scorpio cannot be beaten by any other SUV in its segment.", "Mahindra Scorpio is luxurious in India where it gives a joyful ride to us.", "I love this Jeep segment of Mahindra and drive smooth with a high pickup with legroom high.", "Fantastic car ever and another thing is that its interior and exterior are very very looking good, so I suggest everyone buy this car and price is also affordable for every class of society.", "It is a good traveling car and perfect for 7 people and looks are also good.", "Mahindra Scorpio providing a great experience. It has been using this car and it's awesome, comfort and power come in one hand, superbly awesome car, my favourite and important part of my lifestyle.", "It has an improved control system. Its Bluetooth connectivity quality is improved. It has a good suspension system. Its mucic system is very nice. Its braking system is fabulous. It feels very royal while driving it. Its AC cooling system is very improved. Its average is very nice upto from 17 to 20. It is a very comfortable car for long routes. Ma...", "I am using Mahindra Scorpio for last 5 years. It's a wonderful car for my family. There is a huge space in the car. It's a powerful car as well. It's a suitable car for those who lives in a joint family Thanks.", "Mahindra Scorpio is a very fast and comfortable car.", "India loves Scorpio because it gives comfort to all it can manage itself at any condition for eg. In drifting, mud area, the rainy season I love Scorpio and India loves Scorpio.", "Muscular look. Rough and tough SUV. Mileage is good for city and highway.", "This SUV is king of all time. It can go 2lakh km without any problems. Its pickup is like Thor and Engine intelligence like iron man. Its service cost is similar to Swift.", "My experience with the Mahindra Scorpio is like the man on an elephant, it is a very powerful car with a good punchy engine.", "Mahindra Scorpio is the best car for rough and tough driver and interior design are also great.", "Awesome car. Has been using it for 8+ years. Have traveled the city and used very less. Good car with no issues. ", "I have driven my new Scorpio at 130 km/h, it is so stable and comfortable I can't explain. Value for money. My 2005 Di Bolero gave me the best resale.", "This is a very powerful car and many people like this car very much.", "Very excellent and awesome car, Very comfortable and awesome feeling while driving the car, Almost very better in all features and engine is too much powerful and gives excellent mileage at every speed, No comparison of this car in its segment, excellent performance in every type of rough and tough roads, Very Very beautiful looking car, ...", "A royal car this is one of the best car I really like it fantastic design and very comfortable in sitting ", "Nice vehicle and excellent service, very comfortable tripping, offroad tripping, I like it very much. Nice car, Driving with enjoying very nice.", "It's a complete SUV and with great looks and driving experience, it's a car for off-road, on-road, city, highway and hill it has a great economy of 15 to 17 km/l at eco-speed and it has a great feel that you are driving a big vehicle.", "Top power on the highway, powerful pickup, nice light.", "Best SUV one can drive. Rough, tough and really comfortable.", "I purchased Mahindra Scorpio S7-140 in September-18. This SUV is very good and impressive. It comprises of a powerful engine of 140bhp. This is a very smooth and powerful car.", "What an SUV best car in this price segment balance of this SUV is better than other and I liked the new version of this car.", "I have Mahindra Scorpio s10 2017. I love it. Feels amazing when I am driving. The muscular built and the power of the engine is awesome.", "Musculine, the all-time rough and tough vehicle for the whole family and even for the business persons.", "For long drive and family long drive its awesome. Mileage is also good.", "Everything is nice and well maintained in this car. The car is excellent.", "Feels like you are really driving an SUV. Good out view from the driver seat.", "This is a very fabulous car and very good performance of this car very good looking.", "Excellent choice, more features, more control, and more suspension. Excellent road grip.", "Awesome car with awesome pickup and also more comfortable and nice headspace and nice boot space and legroom and fog headlights for a clear view.", "This car is good for every family. Its interiors are so amazing.", "Scorpio is a very good car, feels comfortable and 8 seater car is a compact car. Very luxury feeling, car's built quality is very heavy.", "Nice car, solid car body, awesome car paint, all car control are good.", "It's very comfortable and has a lot of space and the controls are really good.", "The best in class. Looks adorable and the performance is fantastic.", "Mahindra Scorpio is a very nice and allrounder car. Very comfortable for Indian families.", "Handling is Good and Scorpio Lovers love that.", "Best in Class SUV, perfect for off-roading with smooth handling and driving experience.", "Mahindra Scorpio is one of the best cars.  I have Scorpio and I like this car.", "Fabulous driving experience, controlling is a good and good car for off-roading.", "Scorpio has a fabulous driving experience and good control for off-road experience. ", "Superb car with superb powers and nice features, I love this car. I wanted to get this car from when I saw this for the first time, it is an awesome car. ", "It's the best car I've ever seen. Fully comfortable, best speed, fully automatic. I love Scorpio.", "Very nice car. Best features compared to other cars. Good look on the road.", "Supercar, it is my favorite car. And I love this car as it is excellent in every manner.", "The best car ever I drive. More powerful than other cars, and the best SUV class.", "Best car Mahindra Scorpio and top features. The car is powerful enough to run on off-road also.", "Nice features and luxury looks are proving by this segment also the driving is very much comfortable.", "For off-roading, the Scorpio is very much good option also easy to drive in the village as well. ", "Mahindra Scorpio is a comfortable car but the car is not safe at all.", "The Scorpio is one of my favorite cars because it is very comfortable and looks premium and it feels luxurious. It is a very good SUV for VIP personalities. My first priority is Scorpio because it is a perfect offroading car and many people have owned it because it is a Mahindra product. ", "Best engine power, the best seating arrangement, and looks are also very muscular.", "The Mahindra Scorpio is one of the most popular SUVs sold in India, thanks to a reputation that has been solidified over more than a decade. It was Mahindra's first truly modern SUV and with multiple updates over the years, it kept up with the needs of the market, while catering to a wide range of customers. The new-generation Scorpio features some...", "Scorpio is one of my favorite cars because it is very comfortable and looks premium and it feels luxurious. It is a very good SUV for VIP personalities and its 4wd option is very useful for offroading and adventures. For offroading, my first priority is Scorpio because it is a perfect offroading car. And many people have owned it because ...", "Absolutely good car and I love driving this car very much.", "Mahindra Scorpio is the best SUV and runs comfortably on road. I suggest buying this car with no hesitation.", "Superb car by looks, interiors are just awesome. I appreciate its quality and design.", "Excellent car I have ever seen. This is one of the best cars in the world.", "This is the best car in this segment and in this budget, thanks to Mahindra.", "Mahindra Scorpio is the 1st SUV in India and almost from 18 years Scorpio is running on Indian roads current 3rd generation Scorpio I have 2 Mahindra Scorpio and I love this SUV.", "It is a very good car for both long trip and short trip, features are good, and mileage is also good.", "Best SUV you can buy, but not only SUV but also a good family car you can buy. It is the best car, you can go for it undoubtedly.", "This car is really wonderful and awesome looking. The features are so awesome.", "Very very nice and beautiful MAHINDRA SCORPIO S7 TOP MODEL Car, Very comfortable and excellent while driving with lots of safety and other features, really an amazing and awesome car, I can't describe it in word's, great car, thanks, MAHINDRA SCORPIO S7 TOP MODEL CAR, VERY ATTRACTIVE AND AWESOME.", "The S7 and S9 concept is the best and luxury SUV safe drive and powerful Scorpio with nice features.", "Scorpio is the best SUV, super luxery pickup and all powerfull scorpio.", "Love this car, perfect in its segment. Perfect SUV car for the long route or long journey. The average is not so perfect but in the S.U.V segment it is a perfect car.", "Scorpio is the best car in my life. No trouble on the road and a very safe car.", "It is an excellent car because it is a big car and made for a long journey.", "It is a very good SUV. When I sit in it I feel so comfortable and safe.", "No car can beat this car at this price range. Best car with great features.", "Superb SUV car. I loved this car. Smooth driving along with the easy maintenance. ", "Scorpio is the best car it is the best car for rough roads, the suspension is very very excellent.", "I love this car and especially I have bought the s11 4×4 version on December 18. It is the best in this class but the problem is the shortage of dealers in this city. The dealer is only available in Ludhiana city which is not so good.", "I love this car because of its looks and mileage.", "Interior is very nice and it has got the nice power output too.", "It is my favourite car. I travel in this car Udumalaipettai to Pudukottai in 4hours. I like this car very much.", "Superb driving experience with comfort.", "I have purchased yesterday i.e. 14/3/19 and this car performance is excellent. It provides proper visibility to front full bonnet is visible from the front seat.", "Mahindra Scorpio is the best car for stunts and suitable for all type of people to operate and easy to handle . Easy to drive and smooth power steering. ", "This is a powerful SUV car in this range. This is the most loved car in India.", "Scorpio is the best car in the world it's my first choice of car. Looks are very bold and front grills and so cool.", "Mahindra Scorpio is my dream car. I've always been fond of Mahinda cars but especially black Scorpio, it is the best SUV of Mahendra.", "Nice colour and good pickup and sitting capacity is very nice and keeps safety up to the mark.", "Overall it's a great experience of travelling in SUV. Good for short distances also.", "Mahindra Scorpio is a superb vehicle moreover it is comfortable to drive. ", "Stable Body, Ground Clearance, Pick Up, Value for Money.", "Mahindra's superb vehicle, nice pickup and awesome style. Very comfort in site project.", "Mahindra Scorpio has an excellent performance I love it thank you Mahindra.", "Mahindra Scorpio is best in this price segment. I really enjoy this baby while driving. ", "I love this car and its features for comfort. Easy to drive on uneven roads and speed of the car. Luxury car feeling with the low budget car. I love this car colour, stylish and attractive.", "Superb muscle beast ever from Mahindra. Really it was a great experience to be in Scorpio by its 4x4, it has insane performance.", "Mahindra Scorpio is the best car, full comfort driving and comfortable seats. The car is very powerful.", "Mahindra has very powerful Scorpio and its sound is very pretty. Its dashboard is looking wonderful.", "Mahindra Scorpio is my favorite car. It is a very strong and comfortable car.", "Mahindra Scorpio is a nice car, but at high speeds, there is a trembling in the car. The car is powerful and sporty as well.", "Beat car ever it's gear is so smooth like an automatic transmission. ", "The gearbox is so smooth and gives the pleasure of auto transmission.", "This car is my favourite. I love this car. When it comes on the road, my heart beat sometimes stop. My eyes never move away from this car. I can leave eating food, but I like to prefer to purchase this car. ", "Mahindra Scorpio is my favorite car at an affordable price and it is an off-road SUV with more power. ", "A True and Perfect SUV For Indian Market. With almost no maintenance cost. Mahindra Scorpio VLX for 8 years and 140000 km.", "Looks of Mahindra Scorpio are nice, its engine is awesome and comes with excellent safety features. ", "Mahindra Scorpio is really value for money product, made by Mahindra. The road presence of Mahindra Scorpio is just amazing, I feel like I am king of the road. I have Mahindra Scorpio s11.", "I currently have Mahindra Scorpio for my daily use and I must tell you that it runs smoothly without any problem. ", "Mahindra Scorpio has a very strong and good suspension. It an amazing car with supper pleasant seats.", "Mahindra Scorpio s10 is my first car, I really like it and it is superb in any condition or on any road. Mahindra Scorpio is a superb SUV under 18 lakh, it is awesome and you really love this car. I am a big fan of Scorpio and my dream is to buy another Scorpio. ", "Mahindra Scorpio s10 is my first car, I really like it and it is superb in any condition or on any road. Mahindra Scorpio is a superb SUV under 18 lakh, it is awesome and you really love this car. I am a big fan of Scorpio and my dream is to buy another Scorpio. ", "Mahindra Scorpio is a tuff 7-seater car in the SUV segment. The car is powerful and all the features are amazing.", "Good car at a cheap rate and good for long routes and too much comfort inside.", "This thing has always been the king of INDIAN SUV market. I assure you this car will never cheat you on long road trips. I myself do own all the five generations of the Scorpio. Whenever we are talking about an SUV, we generally think of a poor mileage but here's a surprise: this heavy engine does offer good mileage. The thing I like the most about...", "Mahindra Scorpio is a nice SUV, good experience and the car is more comfortable.", "Best car ever is Scorpio. It's my favorite SUV car ever. Looks very good also.", "Very good and comfortable car, it is really a great car.", "Mahindra Scorpio is a nice and the best car, I will purchase this soon.", "It's a great experience of buying a vehicle in life. My Mahindra Scorpio is in very good condition. I want to thanks Mahindra company for providing a good vehicle. It is a very comfortable and luxurious vehicle in comparison with all other vehicles.", "This is the best car at this price range, low maintenance, and best mileage.", "Mahindra Scorpio is a powerfull monster with extra power for off-roading.", "Mahindra Scorpio is the best in its class with low maintenance and adequate mileage. It has sufficient space without compromising with style. ", "Mahindra Scorpio is one of the most affordable SUVs in which seven can sit comfortably and double up as a cargo van whenever you need it to be. Step inside and it feels premium thanks to the white interior. The wall-like dashboard is functional and because it is so close to the firewall, it helps open up more cabin space. Mahindra continues to...", "I want a Mahindra Scorpio because it is very satisfactory. ", "This is the all-time best from Mahindra although the XUV is doing definitely good but this car is irreplaceable. Its driving position is just phenomenal.  It gives you a commanding view of the surrounding. You feel like the king of the road. It can easily seat 7 people and the engine is a punchy one. Good low end Good mid range but in the top ...", "Hey friends, Here I am sharing my review on Mahindra Scorpio. So this car is very awesome for the off-road purpose. The suspension of the car is very excellent. This car provides a very proper and good leg room on each of its seats This vehicle gives average around 15 km/l. Which is very good for like these big vehicles. There is an awesome music s...", "It's a unique one and very stylish. The stylish body gives the luxury look to the car.", "It is a very smooth car while we drive on highways. I feel like I am travelling in an aeroplane.", "Mahindra Scorpio is a very stunning car. It is very comfortable on the Indian roads. Gorgeous looking for this car are stunning.", "This car is so stylish and I am very happy as the car is comfortable according to heights and seat comfort.", "It's an awesome and comfortable car that's why it is good for long trips.", "I think it is the best car. Mahindra Scorpio is a really very good car and its Price is also not very much. There is no companion of Scorpio in its series. I have used Scorpio and I am very satisfied with this car.", "Mahindra Scorpio has the bold look, it is a perfect car for a big family. Its speed is fast and also suitable for long term.  ", "All-time my favorite SUV. Low maintenance rough and tough car. Value for money and excellent resale value.", "Mahindra Scorpio is one of the best and comfortable car under 15 lakh. It comes with disc brakes and airbags with comfort size.  ", " It almost feels like you are the king on the road while driving. The visibility in the top notch is as usual. The engine is undoubtedly awesome. The only thing this car lacks is seat comfort. Otherwise, its the best SUV.", "Mahindra Scorpio feels comfortable while driving, in the hilly area, feels better. ", "Mahindra Scorpio is a very powerful and boxy car. The eagle-inspired design makes it look beautiful. I love this car very much.", "The comfort and the performance in this price range are awesome. Comfort wise the car is awesome, and on the other hand, the performance and the mileage are also good. The design is very interesting and good looking. The new interior is also very attractive.", "First SUV to attract Indian buyers to buy SUV, excellent specs best in class🤞🏻😉", "Mahindra Scorpio is my favorite car and I want to own it. It looks is magnificent, it's like a sports car. Its average is marvelous its engine's horsepower is so high. I like the rock car. This is my car from my childhood.", "Mahindra Scorpio is a wonderful car.  I have tested it and gives better mileage and it is good for personal use.", "The best new and bold look is looking nice in the new Mahindra Scorpio. Its new and bold look attracts everyone.", "Mahindra Scorpio is an awesome SUV by Mahindra, I like it very much, this car looks nice. I will recommend everyone to purchase this car, it is a fantastic SUV.", "Mahindra Scorpio is a king size car. It is a very excellent car for all long purpose drive with comfort. It is known as a VIP car.", "Mahindra Scorpio is the best product by Mahindra. It gives the look of a Tiger when it's on road.", "Mahindra Scorpio has a good built quality. It has a good engine sound and aggressive look.", "Mahindra Scorpio is a powerful car, the speed and acceleration of the car are excellent. The comfort is also the key to its success, the mileage makes the vehicle fuel efficient.", "Mahendra Scorpio is the best SUV car from 2014 till today for the big family.", "M-Hawk has always been a good engine to drive and especially in this new one with 20 hp more power and one extra gear, it cruises so effortlessly. No other car can match its road presence. Happy to live with a Scorpio, Mahindra should concentrate keenly on safety.", "Mahindra Scorpio an amazing SUV with cool features. It is the king of SUV at this price range. According to its looks, it is a smart look car, I love you Scorpio. ", "Mahindra Scorpio is the best car and the best drive experience it can give.", "Mahindra Scorpio is an awesome car nothing is better than the next gen Mahindra Scorpio. Seriously superb driving experience.", "Mahindra Scorpio is a powerful car, the speed and acceleration of the car are commendable. The comfort is also very good, the mileage makes the vehicle fuel efficient.", "Mahindra Scorpio Car is made to be driven by self. It feels like a tanker on the road.", "Mahindra Scorpio is an awesome car. Mahindra has done a good job on this car even it has a low maintenance cost.", "Mahindra Scorpio is an excellent car with a nice grip on the road. many people can comfortably sit in this car.", "Mahindra Scorpio is the best SUV in this price range. I think it has a very good street presence and a wild aggressive look. It feels kinda nice to drive it and give a smooth drive.", "Mahindra Scorpio is more comfortable and has an excellent power output from the engine to the wheels. A real muscle car in India.", "Mahindra Scorpio is the best car as compared to all available cars in India. It is one of my favorite cars and when you sit in the car it will give a feel like an elephant.  ", "Mahindra Scorpio is really good. I loved it, it's a family car having good features. I really loved it.", "Mahindra Scorpio is a very good car. Maximum people can sit. It has Automatic gears. I love this car.", "I love Mahindra Scorpio car. it is a very good looking car and luxurious.", "Mahindra Scorpio is the best car for city and village. Very comfortable in long-running.", "It's the cheapest 7-seater in its segment, beautify crafted and has a lot of torque in itself. Its all metal so, you are safe to sit in there. The black colour is amazing, gives you the classy look every time you see it.", "Awesome car value for money in low budget with top features and performance. ", "In this segment of SUVs, the Scorpio gives fantastic experience, its mileage as well comfortablity is also very good enough. In my words, it's very much good recommendation for all people who want to buy an SUV.", "Mahindra Scorpio is closed to my heart I bought this segment in 2002 now I'm having S10 Scorpio and looking forward for S11. Also having XUV500 and XUV300. Soon I'll be buying Thar also.", "Great comfort, very good model. Mahindra Scorpio is the best car ever.", "I love this car because of its muscular body it is very powerful, it has very excellent work on its body when I sit in this car I feel a very comfortable and proud feeling.", "I like Mahindra Scorpio. This is my favourite car and I like Mahindra cars because it is my dream car and I like black colour Scorpio. I like Mahindra Scorpio because this is a very powerful car and I will purchase it in 2023 because I belong to a medium class family.", "I've seen and self-driven this car and found all the most better feel and advantage of this car are nice.", "This is a very nice car for family purpose and we go for long trips with this car and it is very comfortable for us. Seating capacity is very nice for a small family. And good in looks and a strong engine for the long tours.", "Very good car to drive. It's just a pleasure to drive this car.", "Amazing car, top pickup and top long drive comfort and wonderful road grip.", "Scorpio is the best and good vehicle. I like it very much, in the old model of Scorpio, steering was not nice, now new model steering is very good and nice. New model Scorpio looks like a mini Hummer. I love this car. ", "Mahindra company is the best company in all car brands. Scorpio S11 is the best car. Scorpio black color my fav color. Scorpio is the best.", "The Scorpio is the one of the most affordable much powerful beautiful muscular design car featureless SUV car in India Some SUV, shave power but they have no muscular design and they not have many features Bur Scorpio have all features And new Scorpio s11 have more powerful engine And we can feel the power after driving One of the most important th...", "Amazing car and fantastic features. It gives good fuel economy as compared to other SUV. Scorpio has been my favorite all the time. Scorpio has more power compared to other SUV Scorpio is the best family car. Scorpio can be used in off-road in every possible way. Mahindra Scorpio was best, is best, and will be best in the future in the SUV segment ...", "Scorpio is an awesome car, its power, and performance for driving are too good. I believe that no other cars are good as compared to Scorpio as well as its engine is more powerful. We can drive it easily at 150 KMPH.", "The best car I ever had in my life. I have used many cars but I loved only Mahindra Scorpio because of its best performance. I have used it for farmhouse also. Overall, it's good.", "The Mahindra Scorpio is a very expensive and awesome car. It is my favorite car.", "Mahindra Scorpio. This car looked so beautiful why because the Mahindra Scorpio is big in looks and very rich in features.", "2008 Mahindra Scorpio M-Hawk VLX is a previous generation SUV, which became the most loved SUV to come from Mahindra. It comes in a premium up-powered segment, being one of the most successful products from Mahindra. The car runs on a powerful 2600cc M-Hawk Turbo Diesel engine which gives out a maximum power of 115 bhp @ 4000 rpm and generates out ...", "Hey friends, Here I am sharing my review on Mahindra Scorpio. So this car is very awesome for the off-road purpose. The suspension of the car is very excellent. This car provides a proper and good leg room on each of its seats This vehicle gives an average of around 15 km/l. Which is very good for the likes of these big vehicles. There is an awesom...", "Mahindra Scorpio is a very good car, its pickup is a very good and mileage is very excellent Good performance by the off-road car.", "Mahindra Scorpio is a nice car for off-roading and a very comfortable car in the segment.", "The awesome comfort in both the village and city. King of any types of road. Gorgeous style soft controlling in all driving conditions. Heavy duty wheel, great fun and enjoyable driving.", "This is my favorite vehicle. Scorpio is a family car, and, I can buy this next year.", "Mahindra Scorpio is a good car but it's too much costly then it rivals so would not call it a good car.", "Mahindra Scorpio gives good average and comfort. It is good on highways but the body isn't perfect by looks.", "Mahindra Scorpio is the best car for all roads in an economy speed and survives in every condition. It is a safe car for passengers even after failing in crash test moreover its 4*4 is awesome for offroading.", "Mahindra Scorpio is a VIP car. You can take anywhere you want, and its a 7 seater car which is my favourite. ", "Mahindra Scorpio is a true legend with a muscular body and aggressive looks.", "Mahindra Scorpio is very stylish, it looks like a lion is running on the road.", "Mahindra Scorpio review: The Mahindra Scorpio is one of the most popular SUVs sold in India, thanks to a reputation that has been solidified over more than a decade. It was Mahindra's first truly modern SUV and with multiple updates over the years, it kept up with the needs of the market, while collecting to a wide range of customers.", "Mahindra Scorpio is a good car, value for money. Scorpio is the best, 4x4 car in a budget of 20 lakhs.", "Mahindra Scorpio is best in the segment in looking point of view, the average and the value of money.", "Mahindra Scorpio is the all-time favourite car. In future, I expect the same level of maintenance and mileage from the beast.", "Mahindra Scorpio has an amazing and aggressive front-end styling. It has good street presence moreover mHawk turbo diesel is a jewel of an engine. It has a power of 140 BHP and the front end looks are more aggressive now. It is more comfortable and easy to steer. Interior looks are very best and it has an affordable price.", "In Mahindra Scorpio the mileage and driveability are good. Body roll on broken city streets is high. At higher speeds on the highway above 110-120, you might feel the car to be wobbly. Odometer looks that of a hatchback, lots of space to keep your auxiliary stuff.", "Mahindra Scorpio is a beast because of its powerful and hawk engine which provides 120bhp or 140bhp. It has good steering control and brake.", "Mahindra Scorpio is extremely super, seating capacity and power of the engine is unbeatable, totally, my favourite Mahindra Scorpio.", "Mahindra Scorpio is an awesome car in any session, in any condition at any place you can feel free for enjoying your trip.", "Mahindra Scorpio is a good car and the power delivery is decent. But, it doesn't have comfort as such other SUVs give.", "Mahindra Scorpio looks awesome and when we drive it, it gives us the joy of riding it. When I drive my Mahindra Scorpio, I feel very proud. Scorpio is always my first choice, after driving this no one can describe its disadvantages because it has none.", "Mahindra Scorpio is a very good car and pretty nice to drive and feels very nice to be in the car and also the safety is good. The best thing is, its pickup and after sale services are great.", "Mahindra Scorpio is very nice and it looks very nice and the 7-inch LED display is so cool. The 6+1 sitting capacity of the car is incredible.", "Mahindra Scorpio is an amazing car even, it is very rough and tough. My favourite car ever, very luxurious.  ", "Mahindra Scorpio is the best car in the world, I like this car and I am so happy with this model.", "It is the best SUV ever. I was hugely impressed by the new Scorpio's front end when it came out in 2014, particularly with the fangs on its grille. The fangs are gone now and have been replaced by a simpler looking 7-slat grille that leans more towards a 'family' look. The headlights, front bumper and skid plate get mild design changes as well...", "This SUV has a very attractive sporty look with tons of features in it, it also has a very powerful engine which results in smooth handling and driving of vehicle! This is the most loved SUV.", "Ek number gaadi hai. gaadi ka look owesome hai. Interior bhi kadak hai.", "Scorpio is the boss vehicle, I am very happy because of the boss with me.", "My Scorpio is the best car, the top model is best and full of comfort.", "It is a mind-blowing SUV with a dashing look and powerful drive.", "It is a very stylish car and has the best performance compared to other cars, I LOVE THIS CAR VERY MUCH.", "I bought this vehicle for my father, now its been 2 years from the day we bought. I am happy to say 'Its the best vehicles out here in the North East' because the road is not good and there are so many landslides, but this beast can go everywhere. Proud to be Scorpio Owner.", "It is the best SUV, great features, better driving on of road with voice assist.", "It is a great car by Mahindra with nice performance, it's a fabulous car.", "It is a very nice offroad car. It has good mileage and accelerates very smoothly.", "It is a muscle car and its ground clearance is awesome. I think it is the best car in this price range and its mileage is pretty good as compared to other SUVs.", "This car is awesome and I just got impressed by its looks from outside and it's functions and seats in the interior. It has a very smooth drive", "Mahindra Scorpio is a very nice car for village areas. I like it very much. It gives a very comfortable journey.", "Mahindra Scorpio has the best look and superb power. Aggressive looking front grill.", "Mahindra Scorpio is the best budget family car, it speeds extremely fast it is the best car that I have ever seen.", "Mahindra Scorpio is a good 7 seater car with good interior moreover speed of Mahindra Scorpio is good.", "Mahindra Scorpio S10 car is a head turner but the person seated in the back and the last row feels the bump very much. Cruise control and infotainment are perfect moreover steering mounted controls are taken from the Mahindra XUV 500 and it feels light to handle. Scorpio is an amazing suv to drive", "Mahindra Scorpio has a good looks and best price with luxury sheets and great mileage.", "Mahindra Scorpio is the car which is very nice and the body looks are just great.", "Good experience with Mahindra Scorpio. It is suitable for the hilly place. Just awesome. Good mileage.very comfortable", "The Mahindra Scorpio is a very good SUV car. It is a family car.", "Eska koi mukabla nahi hai, ye ek dum raja hai, meri best car hai.", "It is a beautiful car and its ground clearance is awesome. I think it is the best car in this price range and its mileage is pretty good.", "The Mahindra Scorpio is a solid beast car with high range performance. It's running condition on every road is perfect, if it is highway or stone and sand roads. But one disappointment after some years of running is that the sound changes that's all.", "Mahindra Scorpio is the Mercedes of India, you will love it, I used to drive Ford Endeavour but now Scorpio is love. This series has the best suspension. The last edition was good but the suspension was not good. This edition got everything like a blast. Never expected this but you must ride this one. Even, my dad loved it and trying to exchange it...", "No.1 SUV. The Scorpio is the best. Its performance is really incredible. Very low service charge per year. Perfect for a best personality.", "Mahindra Scorpio is all time best SUV around 15 lakhs. But still, need to improve the stability.", "Mahindra Scorpio is one of the most successful inventions of Mahindra. It is a superb car, I have already owned this car.", "The evergreen big SUV ever Mahindra Scorpio, always I give a 5star rating to Scorpio. best performance, styling, stunning, muscular etc. I love Scorpio and Mahindra cars ever.", "My personal experience for Scorpio that there is no competitive SUV in India for Mahindra Scorpio.", "Mahindra Scorpio has done awesome work. It's the magnificent the look of the car is just awesome and the interior is also amazing. Great work Mahindra!", "Mahindra Scorpio is having excellent looks, comfortable seating, nice braking system, good in driving, good performance and awesome look and mileage, Best car in the budget.", "Scorpio has been one of my favorite cars since the beginning and I really love it.  I just remember my dad bought his first Scorpio. I and my family have traveled half India in my dad's Scorpio and it never once broke down. So he again bought this new generation Scorpio and it's a tough monster and it has a road presence like no...", "My car is too good and dashing People look at my car because it's like a Lion in the jungle. ", "Mahindra Scorpio is a good car for anywhere driving, like a highway or dessert. It is an excellent car with a powerful engine and muscular looks.", "Mahindra Scorpio is a nice car and the interiors are very neat and spacious. The car has a great power output from the engine. It is the most bought SUV in India.", "It serves good as long as it comes about the driving experience but may be disappointing with the mileage issue I am using it for the past 4 years...", "Mahindra Scorpio is a most powerful 4 wheeler Car. Looking -Perfect Feature-Best Mileage -High at this Range Speed-Powerful...", "Mahindra Scorpio is a Good SUV for village road and has a good road presence best SUV in locality.", "It's my favorite Scorpio S11 royal feeling superpower excellent condition.", "My Scorpio is always best. I like it's sound so much It is very important &amp; lucky for me...", "Excellent performance running like liquid with better mileage. In one word it's fabulous.", "The little monster car with good looks and good technology.", "Very punchy and takes off easily and brilliant headroom and commanding driving position.", "Mahindra Scorpio is one of the best SUVs of India till now. I have Scorpio AMD the experience I have with my car is full of fun and thrill. A long route vehicle. A tough and off-road vehicle, or any other. Surely the best and I love It.", "Mahindra Scorpio is one of the best models of Mahindra, I love Mahindra Scorpio.", "My Mahindra Scorpio is a very good SUV. It is my second SUV, my first SUV was Tata Safari. My new is much better than Tata Safari, the driving experience and body shape is very attractive and it is very good looking SUV my Mahindra Scorpio variant is S11, 7 seaters it's handling is much better. So, my experience with Mahindra Scorpio very good.", "Mahindra Scorpio is my all-time best car, I started learning to drive from Mahindra Scorpio and still, I am driving this car even after having a Fortuner and a jeep.", "Mahindra Scorpio is my all time favorite car Right from the very first debut model up to today's model. No car can be compared again this legendary SUV. If you need any big SUV than just go for it.", "I like Mahindra Scorpio power. In first gear, the car picks up 40 km/h. Scorpio engine is too refined and good.", "Mahindra Scorpio is really awesome where the colours of the car like black and white which looks stunning. It's the best SUV till now, and the quality of the car is best.", "The new Mahindra Scorpio is based on an all-new platform, comes with an optional on-the-fly 4X4 system. The engine has been tuned for both performance and efficiency. The mighty and muscular Scorpio is back in a new avatar - the first major generational leap in its 12-year run. The company had provided major upgrades and a new engine in 2006, a fac...", "The best thing in the car is spacious which is comfortable for the driver, as well as passengers powerful M-hawk engine, it is a mind-blowing car, will not only give you performance but as well as its stunning design makes you feel young makes your personality at the next level. Stunning dashboard which is far from drivers lap. Loved this...", "Mahindra Scorpio is the superpower car in this price range and it looks better than other cars available in this segment moreover it is good for the rural area.", "Mahindra Scorpio has an aggressive front look. This is one of the best 7-seater SUVs.", "I was sad because of my high age since my childhood since my childhood I had seen Mahindra Major since my childhood, even the mileage was fine but the price of diesel was expensive due to the expensive plan, and then the search of Mahindra's Scorpio Third Generation was revealed by the company's company 16. I thought of taking Scorpio and then my e...", "Satisfied about the looks but not the power I can see very less number of Scorpios on the road after launching of new Scorpio.", "I used to call it as a beast, as it looks like a very big guy ,I modified with another set alloy wheels and made it to look like commando equipped all his supplies,specially when you sit in his driving seat you may feel that \"I'm controlling a big guy with massive power\". Price:- When I bought this I spent around 14.5lacks(13.99 + other charges), I...", "PHENOMENAL VEHICLE PERFORMANCE IS VERY PUNCHY FEELS LITTLE CLAUSTROFOBIC INSIDE THE CABIN.", "Mahindra Scorpio is the perfect SUV for Indian roads. This car has great mileage and it is comfort for driving with Storm Pickup.", "Mahindra Scorpio is good which is super strong XUV and gives value for money.", "Mahindra Scorpio is the most loved SUV because it is tough and powerful.", "Mahindra Scorpio has good space and comfort and is very good for off-roading also.", "Mahindra Scorpio has given the best product where the looks of the car are perfect.", "It's the best SUV in India and it is the most affordable SUV.", "Mahindra Scorpio is an amazing car, it has awesome performance, low price tag and low maintenance. The vehicle is superb and just awesome.", "Mahindra Scorpio is a very Good SUV, the only problem is the body rolling is high, can't go heavy on corners, other all things are fine.", "Mahindra Scorpio is a very comfortable car, it is good for any type of road. Moreover, the looks of Mahindra Scorpio are also very good.", "India's most stylish and the most perfect car, Mahindra Scorpio, and one of the most favourite cars. Scorpio's looks are excellent and the performance is incredible.", "Mahindra Scorpio is so awesome, amazing, beautiful, great, powerful and the looks are like a VIP car. The car is amazing.", "Mahindra Scorpio is a good car and the power delivery is decent. But, it doesn't have comfort as such other SUVs give.", "Scorpio is a very nice car for everyone who likes the car. It is good from outside and inside. It has good features and it is not expensive like Fortuner.", "It is a very powerful car and has decent features. With strong and tough built.", "This is my dream car. I am a Taxi driver, but I like to only drive a Mahindra Scorpio. It is a very powerful car and one day I will definitely purchase one.    ", "This SUV is very good in the range I have Scorpio S10 so I am happy with my SUV but this has some problem like scorpio's suspension is hard so when we drive on the rough road so on this road Scorpio have a bad performance. That solves. I love my car.", "Mahindra Scorpio S3 nice car and Mahindra Scorpio all models are very nice in pick up.", "New Scorpio, S3, I am purchasing in 2019, January, best SUV car for middle-class family and good mileage, good majestic look.", "Muscular SUV. I would love to ride Mahindra Scorpio. Great performance and durability. Design needs to be updated.", "It's the best SUV selling in India. I like very much. Mahindra is the best company.", "Excellent Wonderful car \"(tiger) hai sir\" nice looking comfortable sitting comfortable driving.", "It has the best-LED lights and performance with a fair mileage of 15 in its segment and range and it is the perfect definition of value for money.", "Mahindra Scorpio is very fantastic in looks. This is comfortable so nice and so very hot looking.", "Mahindra Scorpio is so beautiful, when you drive it you feel like you are in a cradle...The car has amazing power and braking system...", "I am driving the Scorpio S10 model for 3 years now. I have driven this car for more then 2 lacks kilometer all around . This car is really good, the engine is good, and very good off-roading capability too. And this car is also very good to drive and more over comfortable to drive and for the passengers . The suspension is good but its should have ...", "The car is better, in terms of feeling, speed, performance, braking, and looks...The car is having an affordable budget...", "Hi, I have a top model Scorpio which is excellent balancing SUV. Real SUV in mountain and forest. Good power steering and turning radius. I remember that l was going to Lucknow on Lucknow exp. Way smoothly and suddenly a man crossed the road than I used a break, and my Scorpio stopped before the man. So Scorpio break is too good.", "Mahindra Scorpio gives the best leadership for all people who need the best mileage.", "It is awesome what an interior nice sitting position I love it its so much good and excellent.", "A safe car ever in the word It was so smooth Really fantastic car... the car is a bulky car with impressive features.....", "Excellent in its segment and best for Indian roads, slight mileage should be more than the present, the outlook is excellent, perfect SUV", "Superb car The all-new Scorpio. Its interior, exterior, everything is well originated. amazing product ...... The car is a bulk car with good passenger room in it.............", "This car is very helpful for a drive and it is comfortable for use...muscle car and bulky body...runs like an elephant on the roads...Safe car...", "It is not so comfortable in compersion of old Scorpio. The new Scorpio tyer is bigger than old Scorpio. So it bounced too much. If a single person travels with the driver then the passenger got so tired in fuel kilometres journey. I have old Scorpio m2di, it is so economical and comfortable than my new s7.", "I fall in love with this beast .. .. Scorpio is the best. Love your car ... it will never put u down ... That's what I learned from my experience ... Only one request .. keep Scorpio as a beast... Please don't make him smaller in New editions ...", "Very bouncy rear seats not having a decent style very noisy inside cabin...", "I own a Scorpo SLX 2004 model with 2.6L engine, still in perfect condition. Look and Style - Perfect for a gentleman's vehicle. Among other vehicles on the road Scorpio stands separate like a tusker. Comfort Seating - good lleg spaces, only problem with ac in the middle did not serve the purpose more over it gives some bad sideeffects of ac directl...", "Look and Style: The vehicle looks absolutely fabulous and with the new styling looks classy on the road. Comfort: It is really comfortable while driving it and once people are seated, However gets a little difficult for people to get in. if the driver is not very tall then he needs to pull the seat way up front, thus making his knees bang the dashb...", "I bought Mahindra Scorpio S-11 two months back, fantastic car, rough &amp; tough engine as compare to another SUV. The mileage is also good and giving between 15-18kmpl &amp; ground clearance is amazing. Awesome I am giving 5* ratings.", "I have recently bought a Mahindra Scorpio S3 2WD, Number UP61A J2689 and within 3 months of its purchase, there is Clutch breakdown problem in the car.This is the 3rd Scorpio in my family (previously had Scorpio ? LX, Scorpio ? M2DI) and I am highly disappointed and angry by this problem in my new car with only 5000 km running.", "Purchased the car exactly two years back and I am sharing my story. Though I am not an expert in autos, I am very well in a position to convey my thoughts about my Scorpio. I have driven several cars before such as Jeep, Safari, and similar ones but experience with Scorpio was altogether a different one. Talking about the design first, the SUV is a...", "Fifteen years is a long time for a car especially in India to continue the legacy. Where crossovers are knocking each other for space, Mahindra's most popular SUV, Scorpio is still ruling the streets. Purchased the new Scorpio three months back and performance wise, I must say it's a big thumbs up. The newly introduced mHawk 140hp diesel engine giv...", "SCORPIO IS REALLY COMFORTABLE SUV N ITS REALLY COMFORTABLE TO DRIVE IT TOO.. LAST TYM I HAD TATA SAFARI BUT NOW I FEEL IT'S TIME TO IMPROVE YOURSELF AND TRY TO GO WITH D MODERN WIND..SO HERE IT IS.. THIS IS HYBRID REALLY.. STRONG, FAST AND OBVIOUSLY COMFORTABLE..", "My brother buy in indain one of the suv SCORPIO aug8-2013 best ever travel in my life best fuel efficient in suv's in mahindra cars 18kmpl travel from HYBD to GUNTUR i will from weekly twice from GUNTUR to HYBD then i like and love and like scorpio but latest upgrate version is not cool not liking old is gold this is the story of my SPECIAL ED...", "Mahindra Scorpio has seen plenty of facelift versions and this is the latest one. I have driven Scorpio at speed of average of 150kmph during the long trip covering span of 300km. It is really awesome experience in driving s Mahindra Scorpio. The latest version is given thorough uplift in terms of exterior styling and interior fit and finish also i...", "Mahindra Scorpio is the top of top mahindra SUV model its comes in genuine price band on road price og s4 plus is 12.5 lacs is have good mileage and superior driving control with abs and evd also comes with more than 15 km/lt mileage which keep it hulk more for ahead than all suv in all segment the instrument cluster are very well destined and ac i...", "I like mahindra scorpio as it is very big and there are many airbags also. I greet mahindra scorpio as my best partner as it always helps me to go to school , to college, it also helps my dad to go to his office. When my father first bought this car I thought it would be a dreaming car, I could roam every parts of the world with my car. After finis...", "I own a white scorpio, it is a royal car. It is more reliable and comfortable car, good looking. To be frank, even with the white color it looks amazing it is literally difficult to clean and maintain its luster, The Car has Good exterior features , the profile line which moves from low to high from the front to back gives the car a big and sporty ...", "New mahindra scorpio has very attractive aerodynamics and great sporty look. Its high ground clearance makes go anywhere on off-roads , very suitable places like in villages where roads are not proper , Scorpio's new Cushion Suspension Technology and Anti-Roll Technology make you feel very comfortable as compared to its previous version. Some probl...", "Well! everyone knows that Mahindra has a good past in Scorpio that made this company one of the most successful Automobile company not only in India but in world too. We can see this Indian brand in Formula e and others competitions platform making India proud. Ok coming to the specs and features of my Scopio as point of view is quite interesting i...", "The best SUV I've ever seen. Best suited for rural areas as compare to sedan machines because of its good ground clearance. I would always prefer to have scorpio.  ", "I own Scorpio S10 micro hybrid variant and here is my review after using it for almost 9 months. Look and Design: A full Muscular and rugged look, looks angrier, tuff and real SUV. hood and headlamps are designed so beautifully that i love it and its Led eyebrows makes it more appealing, wish these could be given as DRLs. beats every competitor in ...", "There is a beast in every country so the first beast of off-roading came to India and manufacture by Indian company Mahindra. Design The Mahindra Scorpio comes with the tough looks every time specially the older Scorpio it comes with a huge interior space where you can store your cool gadgets and many things it gives you the storage space in every ...", "The scorpio is very stylish look and with safety comfort . I am eager to buy a new scorpio because i like the body with sports type with all needs of the customers towards the new generation of the cenutry... i like soo muchhhh so I take a responsbility with a suitable leadership of the sports car I love scorpio ...", "The mighty and muscular Scorpio is back in a new avatar - the first major generational leap in it's 12 year run. The company had provided major upgrades and a new engine in 2006, a facelift in 2008.The car still looks like the Scorpio we know though. It has a similar silhouette and proportions. The big reason for that is a carryover of the 4 doors,...", "I love this Off roder beast real SUV...........I have two Mahindra Scorpio and I brought the second one in may 2016 . This sports utility vehicle has amazing power, you can drive it on any kind of road in my point of view this is the best SUV for off roading. The new Scorpio has very classy interior with tons of innovative features.Being an off roa...", "Mahindra Scorpio has seen plenty of facelift versions and this is the latest one. I have driven Scorpio at speed of average of 150kmph during the long trip covering span of 300km. It is really awesome experience in driving Mahindra Scorpio. The latest version is given thorough uplift in terms of exterior styling and interior fit and finish also imp...", "Mahindra Scorpio first stylish &amp; tough SUV From company Reliable brand with low maintenance Very Good interior with Good Engine Love travelled to long journey very comfortable But poor in average Parts are very costly not easily available in local market  ", "I feel engine performance is good. fuel economy looks to be average. automatic gear will be handy. suspension setup looks new and handy too. steering feels good which provides ease and comfortable ride. door locks were weak it may break. box type rear looks very poor. outer look of scorpio is not looking good especially 2014 model. morever the stru...", "Good car to buy at this price. New intelligent hybrid technology to save fuel. Good pickup. New design no comparision with other mini suv .", "One of the best cars in India, as comparing the comfort and look it, is like as the beast is on the road scorpio...the best SUV of all time and runs like a bull both on a road and off-road...No issues everything is perfect.....", "In my opinion, Scorpio is the best. It is too good for who are belong to the village and also a city. Power and mileage combination is good.", "Mahindra Scorpio I always live this  s3, s7 and s10 because they provide very advance features.", "It is an awesome car but the last seats at the back r not comfortable but overall it is awesome.", "It is the best SUV car for Indian roads with many features. All the things required in an SUV you will find inside this. Its build quality is solid. I am a fan of Mahindra, therefore, I deicided to buy this car and now I have it. ", "It is a better car than another jeep model in this price with low maintenance than any other car.", "I am a lover of Mahindra Scorpio from 2012 and recently, I own Scorpio S11 the car has its own taste and gives the average of 17.5 km/l and gives a high speed and pick up.", "Best in class SUV. King leader in SUV segment, off-road, highway, city best performance I m just love it Scorpio. My family members since 2012. Mahindra n Mahindra Scorpio love it.", "One of an amazing vehicle, fully satisfied with my Scorpio M2DI. Best mileage, low maintenance and many more, I don't have words to express. I love my Scorpio.", "One of an Amazing vehicle, fully satisfied with my Scorpio M2DI. Low maintenance, best in mileage and many more. I love my Scorpio.", "Scorpio the Indian power machine. I really love this car but still, need some positive change like middle and third row better leg space.", "It is the best means fabulous product for our Indian Good fuel economy for this size of vehicle Ride quality is bit bouncy space 10 on 10 comfort 10 on 10 car turning radius 10 on 10 fits and finish 7 on 10 body role 6 on 10 Ground clearance 10 on 10 telescopic steering adjustment should be also added. Pickup and power could also be improved like X...", "I bought this car 5 months ago. Let me tell you, people, this is an ideal SUV for everyone. Got many features and good mileage, unlike the other SUVs. It's not like the old Scorpio. And talking mileage, I get 20.1 kmpl without AC On highway roads at 71km/hr. It's a good thing about this car. You may take it for a test drive and you will know what t...", "I bought a new Mahindra Scorpio S7 140 in September. First I was going with XUV500 but then Scorpio was finalized. The Scorpio is the best SUV in all aspects like space, power, economy and full fledged suv. This is very powerful and very easy to handle. I love Scorpio.", "The best car till date for off-road driving, instead of any Indian substandard road this SUV drive u crazy. no matter what is the climate u can drive for so long with comfort. must recommend SUV for all", "I think it's the best car u can have for the city, for highway rides or for having fun off thr road. Sometimes it feels like Scorpio is a bad choice but when u get attached to this car u will happily spend money on Scorpio. I have literally drove this car 1200 kms continuously and it didn't complain for a single thing. Below 120kmph this car is awe...", "Its just simply Awesome! No any another SUV can compete the The Mahindraa Scorpio THE MOST IMPORTANT IS ITS POWER ENGINE that i loved it", "I love my Mahindra Scorpio because it has really nice safety and technology features. In Scorpio S10, all the features are given and its the best car with bold look.", "I have about 2 car but I like Scorpio because I bought 10 years ago and it gives good mileage, in this car 8 people can sit  but additional 2 people's can be added. I always tell people to buy Scorpio the best car of India and family car very good car.", "When we talk about SUV's in India, Mahindra is a well known brand and none other than the old hulk \"Scorpio\" is the old and gold deal. Considering the performance as well as features in this segment and in this price range is the best. Fuel economy: 15-16 km/l combined Fuel tank capacity: 60 L Dimensions: 4,456 mm L x 1,820 mm W x 1,930-1,995 mm H ...", "The new Scorpio with mHwk engine is a SUV that would stop an eye with its massive looks. That car is equipped with big tyres and there is a lot more to descrive about the car. Its really awesome.", "I have been using Mahindra Scorpio for last 10 years. My first Scorpio was SLX now I have S11 which is really smooth compared to previous models. Since I have used so many cars but still no car can attract me more than Scorpio in every way. Smooth stylish robust everything.", "Buying experience was nice. Very good car with large legroom and powerful engine. AC is chilled and seats are very comfortable. One must buy it as it is good for a long drive in any type of roads. ", "Pickup trucks are not everyone's cup of tea. These vehicles serve altogether a different purpose in day to day driving. Just 2 years back I was searching for a pick-up truck because I have to carry a lot of stuff to my office and from there my driver would deliver goods to various other destinations in city and outskirts. While searching, I also ca...", "We bought the new generation Scorpio on the 24th of March, 2018 as we previously owned a 2004 model of the same. The 2018 model is a great package with its imposing looks and styling. It has a very powerful engine and great road presence. If u are looking for a true suv then it is the best option in the 15-20 lakh price bracket. The only downsides ..."]}