{"0": [], "1": ["Very bad experience I have with my new Mahindra Thar Hardtop. 1. I have a problem when I apply the break there is a sound comes. 2. Also there is the air that comes inside when I completely close the door. Am really disappointed about this vehicle. I am also planning to file a case in consumer court. And the same screenshot is going to be put ...", "Any safety things are not available. actually, the design is ok but need to upgrade the design for safety purpose.", "I bought the New Mahindra Thar 2 months ago. Yesterday I was travelling to Delhi from Paonta Sahib(HP). When I reached Panipat New Mahindra Thar automatically stops and I was shocked to see this, then I called toll free no. the service was so bad, I waited there for 3 hours then company toe machine came and today I called in the company, ...", "First of all, you copy a car and don't even make it close to basic practicality (spaces, ergonomics, features, and so on). It was a very good opportunity for Mahindra to make an exceptionally good off-road car with a good touch of City SUV car as well!"], "2": ["I didn't find more rugged features in that, it only seems appealing but the feature and interior are not up to the standards.", "It's a waste of money with poor interior design, which is not practical at all. It doesn't have sufficient seating capacity. The sound quality is poor too. ", "Too much poor Interior, Totally substandard rubber lining, Water leakage from hard top roof, windscreen, door gaps. Water retention on the roof. Totally failure of Mahondra's on Interior and comfort for this price range.", "Looks weird the styling has been stolen from the child. The old that was better because it was truly made for off-road the new Thar has different rivals like Seltos, Creta and the old Thar has no rivals", "This is not a car but Mahindra has provided its own modified version of Thar adding some comfort features but it is still far behind, the matter of fact that other Compact SUVs are improving even at a faster pace and adding values for the masses. Thar is not designed for comfort and it's not functional to serve a family purpose, the initial charm w...", "Thar is a good car, but engine wise power is low, no pick up and mileage is low, around 15 to 16 km/lit. And door quality is low, and the seats are hard and not comfortable,", "Very bad in comfort. It feels like you are riding a tractor in the field. It is better to buy a tractor and earn some money.", "Should have an Armrest on the back seat and instead of speakers those should be an AC vent on the roof &amp; of course, the front grill should be body-colored.", "Design-wise good but, why Mahindra made a true copy of Jeep wrangler. Like some Chinese manufacturers will always create a copy of European cars, but nowhere near to the quality of the former?? Anything like that??"], "3": ["It's a good car for people looking only off-road. Else not recommended and also its a good looking vehicle, it looks a bit similar to Wrangler, it's the best car under 20 lakh for off-roading. A lot of modifications are possible for this car, after modification it looks amazing. ", "It's an overall good car, provided you go offroading often, If you only go for offroading 20-30% times then this car is not for you.", "Thar petrol manual mileage is very low. Only 8.3kmpl of petrol. This is not displayed anywhere. It will give only that mileage. Shocked.", "Too overpriced according to features and the segment. Its price should be reduced by 1.5 lac at least. Otherwise, it's good", "This car is good for offroading and for showing off but practically if you re living in the city, it is not worth it.  Not a family car but youngesters gonna love this one. Not for middle class due to milege nd maintenance cost.", "On the go, the Thar feels very nimble, and lane-changing maneuvers are quick and easy. The steering though feels a bit heavy. As far as the ride quality is concerned, the new Thar is miles ahead of the older car. It absorbs well but the thing is that at high speeds it tends to get a bit floaty", "My Mahindra Thar is very good in off roading but it is not comfortable for at least 4 people to sit inside it is only best for 2 people. ", "Thar is ok but you need one more car for your family, actually for a middle-class family. Boot space ok but in the dashboard, you can't get enough space. In the power segment, it's said to be king in all of your SUV segments for offroad. You never feel under power, torque, engine power ..its made for all Indian conditions.", "It is the best vehicle for bad roads, the driving capability of the vehicle is also good, everything else is fine, it depends on the driver. The reality of this SUV is that no one can beat this vehicle in its segments. The real fun of driving this vehicle is enjoying in the hills and bad roads.", "I think this is one of the best offroad cars in this price range. This car has very little boot space, best car. ", "Looks and built quality is much enhanced. But lacks space and comfort. Mileage is not that good in this price segment. It is like a show-off type of car. ", "It's nice for off-road, and I like its bold look. The build quality of this car is brilliant, and its performance is also good.", "It is a very good looking, and good engine performance car. I drive this, and I feel very comfortable seats, and 4/4 is wonderful. I have driven on a hill station and off-road, good performance all time.", "The exterior look is ultimately good in the top model with very good performance off-road. The Interior is a little old-fashioned, we have to fold the seat in order to sit on the back seats.", "It is not good at all but you can go offroading it very well. The mileage is not good, and the performance is also bad. It's not better than the Toyota land cruiser.", "It is a good experience for off-roading and city driving. It is better than the previous model. The suspension is good &amp; most like the new look.", "Did I drive around my friend's Mahindra Thar, to be honest, it does give an off-roading experience, and it boasts a level of confidence. But I think the body language and style are a bit heavy and bulky. Though in the 14lacs price range, it is worth a deal and value for money.", "I bought Mahindra Thar in an olive green matte finish color, and I bought it in the price range of 16lacs approx. I have LX4 STR convertible diesel AT model, and it was the best decision. The ride quality is amazing with next-level comfort but of course, can easily feel the speed breaker because the suspension is not that strong.", "However, the by-products of an otherwise advanced Thar include thriftiness, fit and finish in some places, a few ergonomic annoyances, and some passenger discomfort. Contrarily, the new Thar has received more attention than any other vehicle I have driven so far.", "Well, there are too many good things about Mahindra's Thar. It gives an amazing road presence and excellent fuel efficiency. The looks are astonishingly admirable and simply charm anyone. Though there is a need to improve the engine as in city mileage is a bit poor than other rivals in the same segment.", "Very few elements from the previous model have been used in the design, chassis, engines, gearboxes, interior, or dashboard. Mahindra really picked the Thar as the launch vehicle for its newest engines, a 152 horsepower, 2.0-liter direct-injection turbo-petrol, and a 132 horsepower, 2.2-liter diesel. These two brand-new, cutting-edge, all-aluminum ...", "Based on our initial drive evaluation, we concluded that Thar is unquestionably more better and more contemporary than its predecessor. The Thar has been a hit from day one, quickly touching the hearts of consumers because Mahindra has improved it and made it a far more tempting proposition this time around. \n", "Thar offers the best performance in the mid-range segment considering the off-road capabilities, comfort, confidence, and road presence. Its dominance on different terrains takes it way ahead of its competitors, it has decent milenge, and maintenance cost goes easy on your pocket too. The best part about Thar is that it's easily a go-to car, be it ...", "Many individuals were interested in purchasing the ancient Thar, but they never did because it was unsuitable for everyday use, unsuitable for families, and extremely tacky inside but for individuals and to show off it was amazing a must-buy for stags.", "Thar has a road presence but also drives on multiple road bumpers in both cases the Thar skids. The steering is also hard as compared to other SUVs. The mileage for Thar automatic petrol is approx 7.8kmpl, and I don't understand why it guzzles so much fuel just for being a higher CC engine. Overall it's a weekend vehicle.", "There is no doubt that Mahindra did an excellent job with Thar models and with time we are seeing modern changes as well. And Thar of today's time is giving goals to all the rivals in terms of having better hardware, power terrain options, and being simply rugged and classy. The price range is affordable starting with 16lacs.", "From the price point of view, power delivery is good. That itself is not a regular vehicle, and if are fond of this vehicle off-roader, so you don't have to worry about mileage. Sitting inside feels so high, and love it I don't think about any drawbacks if it's just for fun to drive.", "You have a lot of alternatives when purchasing the recently released Mahindra Thar because it is available in 6 petrol and 7 diesel models. The excellent design of the new Mahindra Thar's small sport utility vehicle is another outstanding aspect. Furthermore, the newly released car may be said to be considerably plusher and more appealing to everyo...", "The Mahindra Thar is a fantastic vehicle with an improved suspension that can be used both on and off-road and is quite comfy. Due to its robust construction, this SUV has very high maintenance costs. It is a distinctive vehicle from the other automobiles and has great ride quality and performance.", "Available in two options, I bought the LX version and which has 18inch alloy wheels along with many interior modern updates such as an electronic driveline disconnect on the front axle, a different braking system, and blue sense connectivity among the best of what I like. Though I would want Mahindra to provide safety according to the off-roading.", "Mahindra Thar is the Best off-road SUV for the money. Though it is somewhat lacking in comfort, generally it is a super-stylish, super-powerful vehicle with a commanding road presence. Its average is low, but a 4x4 can climb steep slopes.", "Mahindra Thar is the greatest off-road vehicle. Though it is somewhat lacking in comfort, generally it is a super-stylish, super-powerful vehicle with a commanding road presence. Its average is low, but a 4x4 can climb steep slopes. It has fantastic ride quality and it's amazing with performance.", "The Mahindra Thar is stylish, has a powerful engine, and is a fun vehicle to drive. But this is not the vehicle you choose from a practicality standpoint. It lacks a boot and is more of a status symbol than something you would use on a daily basis. It's a fantastic automobile with an excellent interior, excellent drive, and great, exciting driving.", "Mahindra Thar is a magnificent SUV off-roading car and no SUV can give the feel like Thar. Still, obviously, along with this, it comes with some demerits such as ingress/egress, not being the easiest, and making it difficult and time-consuming for everyone around. Sometimes during heavy terrain ride feels bumpy and requires attention on suspension ...", "It is a nice SUV 4×4 in budget and it is comfortable but only 4 people have comfort and no complaints of Mahindra Thar because locking is gorgeous and it has a bold road presence, and my family loved the Thar nice SUV.", "Nice car but the problem is that this car is suitable for only two people travelling and is the best choice for off-road purposes. The styling and the muscular look of the car are great. The diesel engine is value for money and has decent mileage. The can be chosen as a secondary car and for day to day city use as well. It gives a commanding s...", "My experience is ok but maintenance cost, mileage, And comfort are quite not so good but the looks are mind-blowing. ", "Mahindra Thar is a great car in terms of its power and performance, the speed and looks of the vehicle are highlights, overall the vehicle is amazing.", "Mileage is average not that good in comparison to the pricing of this segment car. But if we consider a 2200cc engine it's awesome and the performance is just the best. But it's not a practical or comfortable car. But overall offroading built quality is just the best. It provides good features as well in the jeep segment and in this pricing at some...", "It is not a comfort car its made for offroad driving, and it's a driver's car. The driver can enjoy the ride more than the passenger, don't look into mileage,it have a decent fuel economy, looks are awesome. The sitting in back seat is ok, not comfortable, it's a car for who is a rash drivers. ", "This is the best SUV in this segment. Its mileage is also good and the performance is superb!", "This vehicle is cool with a strong engine and good for a hedgy ride. But utility wise this is not the vehicle to go with. It does not have any boot space plus this vehicle is more of for a show and status than normal day-to-day usage.", "No doubt everything is top-notch. Eye-catching leap ahead in technology. Although it has some niggles /bugs/problems infotainment hangs sometimes, spare parts are not available easily. Replaced my leak suspension, and ac flap motors false warning in mid sometimes, DPF(Diesel particulate filters) regen problems MID blinks sometimes. The pa...", "I think most of the people who are used to better international brand cars and SUVs don't find Thar fascinating, due to lack of creature, comfort, relatively. Cramped space and cargo. Electronic options, ride quality. 15 Lacs not worth for this type of car. You could get a better SUV than Mahindra. Design-wise it might have...", "It's a nice car, but overall it's too expensive to ride everywhere by this. I like adventure, and I love SUVs of this type, but I am not fully satisfied with this interior according to price. And space nearby the rear seats is not enough to comfort. And the price of this SUV does not match these features...", "Riding comfort is good. One of the best SUVs in India, but still got to provide better rear seats. Could've used better AC. Engine performance is excellent.", "Not worth for top-end or above 13 lacs. This is simply fooling customers.", "Thar, it's good. A lot of changes have to be done. 1) Finishing not up to the mark still to be done. 2) Glove box we can't keep anything what's the use even can't keep the service book. 3) Back finishing can be done neatly. 4) The horn pad is such hard we can't press it with my thumb. 5) Brakes has to improve if we getting 4×4 we have to ...", "Back seats are really horrible, surprised with the companies R and D. While adding to so many features, why they left back seats totally unattended.", "Although the new Thar looks one of the best and capable in this price range. I want Mahindra to launch a new variant of Thar without 4x4 and with XUV300's smaller engine. This will help Mahindra to reduce the overall cost and will eventually generate more buyers for the SUV. The SUV has a lot of potentials still left which this new variant can open...", "I drive Thar 2013 for 7 yrs and 2.25 lakh km. I must say hat a great car and I'll go for the new Thar 2020. I don't think if anyone other than me had driven. Thar so much and now I'm going to get a new one that's mean that it's a great thing.", "It could be a perfect car for me. If it has only 2 wheel drive system, 1500cc engine with good mileage. I'm not saying it's not a perfect car right now. It is good for typical off-roaders. for me, it's fun with daily useability.", "The looks of the car are great and comfortable but its maintenance cost is high and its price is too high. Please down the price of the car at least 1.5 lakh.", "Overall it is a great car with full upgraded compared to the older generation but my concern is the price which is too high, which is not making this car a value for money. ", "Performance &amp; look wise its good but negative points are Single Door entry, No Boot space, Seat folding, No Sun Roof, No option for rails on top, and the price is very high.", "Today I took the test drive of the automatic version it was awesome handling was good, the interior was good seats are not that much comfortable. The price of the car is too high the price should be low. The overall driving experience of Thar is awesome", "It's overpriced. At least they should have provided an armrest, rear ac vent, dead pedal, and utilized side space in rear seats for LX version plus roof rails as an accessory.", "Overhyped and Overpriced. Pros: 1. Design - An eye-catching boxy look, kind of mini wrangler. 2. 18inch allow wheels with better ground clearance. I am expecting to change the lane by driving over the road dividers in case the U-turn is more than 1km. 3. As the city streets are no different than off-road streets these days with millions of potholes...", "The price of this one is too high while checking on others, I think for this price we can go for other options.", "The rate is too high. You have to spend more than 10 lakh for this car which is not very good at a comfort level. Good if it is below 10 lack ie 4*4 LX variant Deisel at least.", "I would buy the Thar 2020 if had an armrest and a ghost pedal in the automatic version. I'm yet to experience the seating comfort, the old that's front seats were extremely uncomfortable. I wonder why the driver's comfort is the last priority in our auto industry", "The new Thar has improved however still not to my satisfaction. Reasons 1. The fixed window for the backseat. 2. No 4 door variant and lack of boot space. Therefore not so convenient for a family adventure or for rural folks.", "Mileage is okay according to Thar but features are not good. Mahindra do something, otherwise I will change my plan to buy Thar.", "If the price of this mini SUV for 12 lacks. It's a shame because, for that price range, we have a lot of other good SUVs like Creta, XUV, etc. It's just that it is a mini version of Wrangler design, which can barely adjust 4 seats, and if it ends up costing 12 lacks. God bless them. Good cars from Mahindra itself, like Scorpio and XU...", "Thar seems good from the looks point of view. Consider 100 times before paying more than 11 lacks for this car. As offroading is rare, once in a blue moon. So, people would go for a more luxurious more practical version available in the market. Like Nexon, Kia Sonet, Venue, and many more. One of the greatest demerits which I found is ingr...", "Car ke ret jada hai rear setting mein problem hai rear space come hai car mein. What second part gear automatic a sakta tha."], "4": ["It is a great car, very dashing nice-looking must go with it without any doubt, it is a dream car for many people, and it can't be justified by words.", "I have driven the Mahindra Thar manual BS6 and it was an amazing experience in my opening, performance A1 Styling, A1 Power, A1 comfort A2 because there is no space for foot and it's the same issue with the automatic version. Mileage is also satisfactory but not for middle-class people.", "Best car I have ever used, I am buying a second Thar in 1 year. And the engine is not underpowered even in 4x4 I feel I am on road during my offroading, the best car.", "Mahindra Thar is a perfect example of a monster. Great feeling after driving this car in the market.  Superb Car. ", "I like this car so much, the design is awesome, and the comfort is amazing. This car returns good mileage and the pick-up is just awesome. Also, this car is available with 4WD which is very nice. ", "The Mahindra Thar is one of the favorites of the maximum number of people of India. It looks classic and comfortable. It is the safest car at the best price.", "Best car in the budget. It might not be a family-friendly car. If you have an older family member (50+), but if you are young and have a family of 2 to 3 people. This is the best car you can buy. It's only the real SUV that deserves an SUV tag on that budget. It's really a great product, you feel the car and then decide. I sugge...", "Simply superb. Car's comfort, style, mileage, everything is just awesome. The car is just beyond expectations. Go for it. ", "This car offers me about 14kmpl mileage when I rave about this engine. In my family, there are 4 members so, it is average in space, but one of its negative points is boot space.", "It is one of my favorite cars. Everything is very nice in Mahindra Thar. No other car can beat it in this range especially in the case of off-roading. ", "Mahindra Thar is the best option in this price range. The reaction on this car is best. No other car can beat this price range.", "It's the best vehicle in this segment, it's dream of many people, and it looks like a legend car and some special car feeling like a horse.", "Best car, and it's my favorite car. I like this car with the best feature, and safety, best look, and a wonderful design car Thar.", "Mahindra thank you for this best off-road vehicle at this price. Performance is super. I'm completed 1 successful year with Thar", "Best Suv but with high safety (NCAP 4star). Awesome road presence, loaded with features. If you think of buying. Thar then you don't need to check competitors because nothing can compete with Thar.", "This car is amazing best in comfort best in drive and amazing for off-road driving its engine is best powerful. Its comfort gives us good pleasure I think that is the best car ever for off-roading I love this car this is amazing I can't explain this in words it is a feeling of mine for that and I love the Thar and I love the Mahindra company.", "Easy to control and look wise that is amazing .overall print a good image in people. people wanted to interact with me because of that I am a very happy and eligible user of this car.", "It is good in all aspects except maintenance cost and mileage. It is a great off-roading car also.", "Most devilish off-roading SUV by Mahindra. I bought Thar for the sole purpose of flaunting it everywhere. And it actually attracts the attention of everyone. I have Thar in a black matte finish, bought it last year around Diwali and I'm fully content with its engine, driving, and comfort it gives.", "It is good in design, mileage, and an affordable price. It's a stylish car with excellent performance and the best satisfaction. With these proportions, handling a Thar in city traffic or finding a parking spot too for that matter is no hassle at all. On the contrary, it makes it quite fun to drive a city car with a 2498 CC engine, 105 bh...", "Mahindra has now updated its Thar SUV this month, after which it has become even more special. In the Mahindra Thar 2022 version, both the bumpers are now black. While upgrading the new Thar, the company has now removed a USB port. I think the mileage of this car would have improved even more after the update.", "Mahindra Thar is royal and the luxury car gives a lavish feel like you are the king it is fully comfortable and safe to drive It is easily driven to the hills and high places \n1. Acceleration is awesome \n2. It has a good interior \n3. Good sound \n4. Good seating comfort \n5. It has good stability Buy a Mahindra Thar and be the king of the place you l...", "This is a great car for off-roading, it comes with amazing features and has enough ground clearance which makes it easy to drive. The looks and design are also great and this is a value for money.", "One of the best cars in India. It is good in design, mileage and an affordable price. It's a stylish car with excellent performance and the best satisfaction.", "A perfect car for someone who loves off-road. Road presence is exciting, safety is good and maintenance cost is high. ", "It is my dream car with lots of features and performance. Power is awesome and the most and ultimate thing is that while off-roading it feels easy to cross the way which is tough for other cars.", "Mahindra Thar is the best SUV in the Indian market. It is competing with the jeep compass which is many times more costly than this car. The mileage of the car is lesser than other cars, It's about 12 km. It does offer a decent driving experience and has enough grunt to perform effortlessly in all situations. I love this car.", "This car is a good car and my overall experience was amazing but when we go to the comfort side this car is not that much good. The interior is basic not like other cars of this range but if you want a stylish car it could be a very good choice. It gives good mileage. Overall, this is a value for money. \n", "Good off-roading vehicle. Fit for all types of roads. The back setting needs a little improvement. But overall it is a good vehicle.", "Amazing for off-roading, huge tyres to enhance driving comfort. Great performance, and lack of boot space.", "This is a good car in 20 lac. Its performance, design, and power are also nice.", "If you are looking for adventure purposes go take it do not think twice, but if you want to take and use it in the city think of it. It is comfortable but you will not get the smoothness and go for the diesel version it may be going a bit costlier than petrol, but it is worth it. ", "Very good features and also good in style. Safety is mind-blowing and very comfortable for a long drive.", "Nice car it is so good for off-road and decent in the city also when you sit in this car it feels like you are a lot above the ground.", "This is the best choice for drives, for looks, for showoff, for good mileage, for less maintenance cost, and everything. ", "Thar is one of the best cars. Good mileage with the best features and a good sound system. Value for money.", "Good car and worth buying The model looks awesome The feeling of driving the car is also good They are open for feedback and the response is good.", "THAR is not just a car it's an expression about having the most muscular car on the road. You can take this car to offroad tracks, highways, and your friendly streets just all that casually. This car is most favorable in areas near the mountains. Thar has the most masculine look and this generation is even better with all the basic and premium feat...", "This is an amazing and fully stylish car, but the mileage is very low. The overall driving experience is also good, and the performance is unbelievable.", "This SUV is wonderful and very powerful with a muscular look. This SUV is looking good and is a super performance.", "Performance is best, mileage is good, the front look is very attractive, big tires, less vibrations while driving, stability is very good, music system is very good, safety is good, the height of the car is very good, length of the car is best, lights of the car is awesome, 4×4 system is better than other cars, the overall car is good", "Good car, if I see other cars that is a different car. If you like adventure this is the best car and not only for adventure, it is fit for any condition. After all, it was a full package and the perfect car. I love this car very much and I was suggesting everyone buy this car . \n \n", "The new look of Thar is just awesome, equivalent to European market styling, the performance of the vehicle is outstanding, and the perfect car for off-roading. ", "Good experience and fully satisfied. Mileage in this segment is ok. Looks like a legend and is incomparable.", "It's like a royal dashing four-wheeler. Totally satisfied it's service's safety and performance overall excellent performance I loved it very much and I also advised all car lovers if your choice is royal so you go with Mahindra Thar.", "Overall experience is good and it would be great to ride. It is very comfortable to drive.", "I am in love with this top-class off-road SUV. Mahindra Thar comes with a spacious cabin where you get plenty of legroom to sit comfortably and drive. The seats are made of upholstered leather providing utmost comfort to the driver as well as the passenger. This car never makes you feel uncomfortable.", "Mahindra Thar is good for safety and comfort. I am driving for 3 years and my experience driving was good. It's good for off-roading.", "Very nice driving experience and the best for off-roading, it is comfortable for long drives, has amazing features. Superb experience.", "Best Of the best!! This remembers me of the old jeep that we had owned for the past 10 years. This looks far better than the old jeeps. Literally liked the performance comfort facilities. Thank you, team Mahindra for this Amazing", "It's been almost 6 months since I'm using Thar (copper variant). The best off-road experience offered ever. The overall look is so classy and premium. The mileage is good too. This is not a car this is an emotion for me. It is never disappointed. If you love adventures and long rides, it's perfect, go for it.", "This car is amazing 4×4 at this price point. The Mahindra Thar is the best offroading car.", "I had experienced driving it excellent, better to drive off-road, its awesome, perfect, and peaceful drive. Love it. ", "The new Thar has surely improved from the earlier one and it is totally worth the upgrade. It is not a practical car or an SUV you can do long-distance journeys if you have a family. If you are looking for adventure trails then yes, it is an amazing one.", "My experience with Thar is the best and the performance is great. This car is very nice with ultimate looks and style. ", "Very good. Worth money and style. Good off-road car. engine performance is very good. The four-wheel-drive is providing good comfort off-road.", "The experience was too good, I'm soo happy with this car, The mileage was also good maintenance is low. I'm so happy with this one.", "This is the best to drive, its service cost is low, this is the best car to drive and very smoothly runs in urban and rural areas. Go for it.", "It is a nice car, its black colour is attractive. Recently we purchased this car average, speed, safety etc is very good and this is the best car under 15lakhs.", "The name Thar is a complete retro evergreen legacy, and the new variant makes it more affordable increasing its reach to the city sector. And especially the one who just wants to own a Thar and now their dreams could come true actually in budget with all same features, a 1.5-liter engine but with the same massive torque and with a lot lighter steer...", "I like Thar because it looks very impressive and the performance is really awesome. Its light and colour are too good, it gives great mileage and is good for offroading. It offers awesome features in this price range.", "This is one of my favorite cars since it is the king of off-roading, has excellent build quality, and has a monstrous appearance. Overall, driving is enjoyable thanks to the vehicle's excellent off-roading, performance, and stability characteristics. In terms of suspension, comfort, and safety, it is an excellent automobile.", "It's a king for off-roading, its build quality is too good, and it has a great look, this is one of my favorite cars. The overall driving experience is good with the best performance and off-roading qualities, and stability. It is an amazing car in terms of suspension, comfort, and safety.", "The most convincing thing to buy Thar is its performance, off-roading qualities, and stability. It is an amazing car in terms of suspension, comfort, and safety. This car offers the best performance in the mid-range segment considering the off-roading capabilities and road presence. it has decent mileage and maintenance cost goes easy on your ...", "This year I bought Thar, and there are a few things with which I'm quite impressed such as the infotainment system, and in 4X4 mode, it helps a lot. The suspension is quite nice and satisfactory. The overall driving posture is commanding and stable. I honestly love Thar.", "This is a nice SUV with good comfort and looks. This is a product with great power.", "This car is looking very nice. The off-roading performance is good for my family members.", "Excellence performance in mountain areas and urban areas. It's a nice look with good features and the best color options.", "It is a superb car in looks, but maintenance is high. It is an awesome car with good mileage and a comfortable car.", "Mahindra Thar is one of the best cars for off-roading and is good for road trips. It's such a comfortable car with awesome colors.", "I bought my Thar in around February month at the starting price range of 14lacs in black matte finish color. As I'm in the army I drive around a lot due to my postings and leaves. I find it the best SUV for long journeys and the best for off-roading. In a few months it will almost a year of this purchase but I can say that I made the right decision...", "Super wonder full car beautiful car comfortable car all feature is the good nice look I love it Mahindra Thar all is good wonder full body and road ripping nice feature Mahindra thank you for launching the car.", "This is a superb car for offroading, performance is top-notch with the top class features. The safety features and build quality is also amazing. It looks awesome and is good for city drives.", "It's a comfortable car with good safety. It's not too costly, but all features are available in it.", "Mahindra Thar had a good experience with me. It has a stylish look that beats Fortuner, Harrier, and Gurkha. When it running on the road everyone looks my car at once this gave me a proud feeling. I like its power 4*4 as it is good for off-roading. It is a 4 seater car but 5 people can seat very comfortably. I like its interior design which gives a...", "It's really a good car if u are an SUV fan, really not joking before buying this car I also felt like it would be like any other SUV, but when u drive it, this gives u really confident feeling. Its performance is really good and safety is also top notch. In this price range, this is the best car.", "Feature and performance are cool, but mileage is average. That has a powerful engine, and I like a strong engine for adventures.", "Mahindra Thar is a very strong off-road SUV. It takes you effortlessly on all kinds of roads and makes your journey enjoyable. If you are an adventure lover then Thar is the best car for you. Its build quality is very strong, but it can disappoint you a bit in terms of mileage. Overall I like the car a lot.", "Mahindra Thar has a strong engine and is suitable for a tense drive. However, in terms of usefulness, this is not the car to choose. It has no cargo capacity, and this vehicle is more for show and prestige than actual day-to-day operation. \n \n", "Overall nice car with good power and looks. Only 4 people can sit and no space for luggage.", "My experience with the dealership was very good. I love Thar for its ruggedness. But the interior and comfort could be better. I have done off-roading with it. The only con of this car is that the rear seats are not comfortable.", "My best choice. The best car in the off-roader diesel variant is so good mileage. This car is so good in safety.", "The price range starts from 13lacs and can easily go up to 16.50lacs ex-showroom in Mumbai city. Thar is a feeling that not many will ever understand, and that is why very few people have Thar. Mahindra Rugged lineage and own driving attitude of Thar. , It has easy cut access, but one thing which is missing is the rear doors which makes it a little...", "It is an amazing offroad performance. Gear shift turns on the way for the same feeling good movement and good move.", "This machine is powerful and looks nice. This car is comfortable with a nice pickup.", "The best car in 4x4 is the best car ever seen This type best car in this price segment you can take. The Mahindra Thar is supremely capable. Period. As an off-roader, the Thar actually has what it takes to take on any kind of turf, be it sand, snow, mud, or even shallow waters. The new BS6 2020 Thar comes with several capable off-roading featu...", "Mahindra Thar is the best car, the drive quality is great, and this car offers great comfort. Also, Mahindra Thar is good for safety as well. This car is the best for off-roading. ", "It's very safe and beautiful and it is very comfortable among other cars it has a very stylish look and very nice color.", "A great performance car with superb off-road capabilities. Excellent road presence but not suitable for family.", "Great mileage though the suspension is great, rear seats are a bit uncomfortable for 2 people. This car is good for off-roading.  ", "The overall experience of Thar is good. Good to have in off-road and on-road as well. Stylish, muscular, and high performance undoubtedly. I used to travel a lot by car so for long rides, it is very much recommended in mid-segment vehicles, especially for those who love big cars. Safety and comfort are also up to the mark in its range. The interior...", "\"Thar \" is a fully loaded, comfortable, awesome look, compatible design and awesome colours.", "Mahindra Thar is one of the most selling cars in India. For people who love offroading, Mahindra Thar is the best choice. This SUV is great and works smoothly on any type of terrain. From offroading to any other terrain Thar proves itself the best. Thar is affordable, compatible, and powerful, all in one. The best Made in India SUV.", "Very good and it was my dream car, love this new model looks and tyres are awesome and performance is always on top of Mahindra 4x4 is there in this price range, features of the vehicle are great. \n \n", "Mahindra Thar is one of the most good looking cars, the comfort of the vehicle is great and it looks very attractive and luxurious.", "The performance is very best, and looking is awesome. The best build quality and riding quality are also normal.", "Such a stunning look and performance, and the road presence is so solid. It is the whole package for attention seekers, I personally feel the mileage part can be covered with all these features. The internal space is very compact.", "It's an amazing car to drive. People turn around to look at this car. The driving position gives full command on road. Feel safe on-road and at high speeds on highways. Loved by most who get a ride in Thar. Very happy to own this although the mileage is below 10.", "It is a very heightened vehicle with not so much comfort but it's good. I have done offroading using this vehicle, it was so cool. ", "It is one of the best vehicles in its segment as the driving experience while off-roading is amazing and the power of this vehicle is unmatched. The performance is also good as it provides good mileage. ", "New Mahindra Thar is really a head-turner on roads and even off roads it has the most rugged look in its segment all great from the exterior and it is easy to upgrade it with after market accessories which are widely available when it comes to interior its not that great as compared to the other cars in this price segment.", "This is a superb car and awesome look, it's just not a car it's Mahindra Thar. One never saw features but always enjoy the luxury and brandish feeling which you get while driving it.", "Mahindra Thar is the best economic car. When I drive its sound gave all eyes on my car. It is very powerful and amazing for me.", "Mahindra Thar gives a very powerful performance and it comes with good safety features for its users, but it lacks a bit of comfort and the AC is not up to the mark still it's good for off-roading. \n", "Amazing vehicle, I've been driving this vehicle for the last 9 months and it felt great. The power and performance of Mahindra Thar for this price point are pretty great and it provides great mileage as well.", "From looks to power, it has got everything. the 2020 version of Thar has got the premium exterior look that one can imagine. The torque and power are now on a whole new level which makes it easy to go on for all India drives.", "Very nice car, good average, stylish and sporty specs and features. Nice comfort, good build quality, 6 airbags are there on the steering, on the dashboard, in rear seatbelts, and in grab handles. It is the overall best safety in this range, with a very nice ground clearance of 460 mm.", "This is a very nice and good offroading car. The nice interior and comfortable for your family. The build quality is too good with the smart screen. The good seats. led lights, and I suggest you buy this car.", "The Thar is a good car for off-roading. It performed very nicely and ground clearance is very comfortable. Driving modes are also interesting.", "Except for maintenance costs, the car is superb. Its style, comfort, and features are just like a luxurious car.", "This is an amazing 4x4 car in this budget with extreme features and its awesome look. Thar is enough comfortable for all people. The muscular body is just awesome and the interior is so cool.", "It's a good car, specially made for off-road purposes. Getting into the rear seats might be difficult for aged persons. Although it's a rough and tough car in the segment, there's no need to think about it. Go for it. \n", "This is an amazing and fully stylish car, but the mileage is very low. The overall driving experience is also good, and the performance is unbelievable.", "It is a fabulous car. Overall its looks are good and adorable. But the main problem is the low space in the boot and the 2nd-row seats are not so well. Mahindra Thar is a good car for going to mountain areas.", "From having only a diesel burner to not having air conditioning, the Thar has now evolved into a true-blue SUV. Offered with both a 2.0-litre turbocharged petrol unit and a 2.2-litre diesel unit now, Thar even offers automatic transmission; something that was never heard of before.", "It's good but it is great if you will consider it as a 2 seater, back seats aren't that bad but it isn't easy to go there. Mahindra should have given a 5-door version in Thar, And in soft-top Thar, there is a crinkling sound above the speed of 70km/h which is very irritating. Mahindra should improve brakes also. Other than these...", "This is the best car with comfort, power, and build quality for very tough conditions. It is the best for off-roading in mountain areas.", "I am satisfied with it. Its look is so good and comfortable to drive. Overall the car's performance is too good for the road.", "It is a very good looking car, and engine performance is also good. I drive this car and feel very comfortable sitting and 4/4 is wonderful. I have driven on a hill station and off-road. They give good performance all the time at 15.2kmpl. It's a nice car and it's my favourite car. They will give good satisfaction to buyers. The...", "This is a fabulous vehicle within this price range. I have the LX petrol hardtop variant, it is amazing to drive and handling is smooth. I suggest everyone go for this vehicle and the off-roading experience is also really awesome. I love this car. ", "Best car to drive and have a little luxury experience. Low maintenance cost with an accurate car gear system, and anti-breaking system in the car.", "It is the best model and best selling car. Its look, performance, and style are really good. The Thar is like an impressive car, and I gave it 4.8 due to its mileage. Its mileage is some low so it is one point.", "This is a good car with comfort and safety. Its smooth drive and the sound system were also very nice.", "This car is very comfortable and very nice. I like the safety features and the maintenance is low with decent mileage.", "It is a very nice car with a valuable cost. Its nice performance, road grip, and engine noice are nice.", "The Mahindra Thar is a rough and tough mini SUV. This look amazing and safety is most in this SUV.", "The power and performance of this vehicle are simply amazing with decent mileage. The looks and feel of the vehicle are a highlight.", "Smooth driving, experience is good, comfortable seats, very smooth gear. The car is awesome in look and really very much comfortable in driving, really amazing experience if you think of buying Thar then you don't need to check competitors because nothing can compete with cars. Very good and nice.", "The power and performance of this vehicle are tremendous, it is great for off-roading and good comfort. The looks and feel of the car are fantastic with a smooth driving experience but it lacks a bit in maintenance as it is pretty high. ", "Nice car, an eye-catching car, head turner, high-speed ride quality is bumpy, and low-speed ride quality is superb, the suspension works without sound, performance is medium when you accelerate hard it revs, but overall It is good.", "Nice car, look comfort and best features. No car like Thar. ", "Nice car, an eye-catching car, head turner, high-speed ride quality is bumpy, and low-speed ride quality is superb, the suspension works without sound, performance is medium when you accelerate hard it revs, but overall performance is good", "The car is awesome in look and really very much comfortable in driving. Really amazing experience after buying this car", "The car although not comfortable gives you a feeling that you're sitting in a jeep that is capable. It's no wrangler but It certainly doesn't feel out of power for a second. Issues with leg space if you're a tall person and not comfortable for long drives but it is awesome to drive and go off-roading. If you love driving and own another car you can...", "This is not a car. This is HaHa Car! Awesome. Only rear entry is a problem but I think a 5 door variant won't be that exciting.", "Its pickup remains the same as that is at starting. Its power is good. It has a 2500cc engine which performs very best for a long time. No maintenance is required.", "Very nice car. It gives the best comfort on the highway as well as off-roading. Nice and classic looks Must be recommended", "According to my point of view, Mahindra Thar is one of the most famous car in India. Mahindra Thar is my first choice to buy.", "MAHINDRA THAR IS MY FIRST CHOICE. IT IS THE NO.1 SUV CAR.", "Thar is off roading vehicle so it is not that comfort but looks and sounds great and power which is unbelievable.", "We asked. You voted (in your thousands). And here it is - Empire's definitive (and not a little surprising) tally of the most memorable.", "Thar is not only a car. It is a journey of adventure. Now, it comes with on week and on weekend days. I am extremely excited to drive this.", "Beast is back with vengeance. Looks like the brother of the Jeep. But good try by Mahindra. Rough and tough.", "A beast with stunning looks, performance, and comfort. Good job Mahindra for giving us goosebumps by revealing an Indian monster on this independence day.", "Thar has always been my favorite, wherein after the announcement of 2020 Thar I was excited too but it has left me down if at all I go for it in 2020, I would be missing a more upgraded version within 6 months which I've learned. It indeed is being stated in 2021. Thar shall go for a facelift, with white rear bumper the rest window hinges, whi...", "Mahindra Thar is very good and I love to drive the Thar in bumpy roads and in all the stations. I'm waiting for the new model Mahindra Thar.  ", "This is the best car in terms of off-roading and the power of the engine is also great.", "So nice and great car looking good with powerful engine and balance is good.", "Mahindra Thar is a nice rigid high-performance car its better than gipsy. Good mileage and less maintenance cost.", "Feeling good and proud to drive THAR So powerful vehicle Cheap maintenance costs Their no road in the map that can stop THAR. THAR doesn't allow anyone to stand on the road . I have driven more than 20 SUVs but I didn't get the feeling that giving by my THAR. and it is the desi SUV. It changed into a part of a family. I brought my THAR with help of...", "It's is a 4×4 car it's a VIP car comfortable And a good mileage the price of the car is very very good", "I think Thar is the best off-roading in the year 2020 and it will be the touch screen features. Thar is the best car in Punjab. I like the automatic transmission and 6 manual transmissions. The engine is smaller than the old THAR. It will be better to drive in a city like Ludhiana and Chandigarh. ", "Super performance, well fitted hard roof, superb look, high-performance diesel engine, good looking, good music system, and comfortable seats with the height-adjustable driver seat.", "Thar is my favorite. The looks are awesome, power is so good, mileage is not so good. I am getting 12kmpl in the city and around 15-16kmpl on the highway but the overall car is good. Aftersale service is good but is costly", "This car also has an emotional attachment to family, this kind of jeep was the first car for my family and today we can get this back. 5 stars to this machine, overall this beast can do anything a human wants to do. You can take it everywhere and it will never disappoint you. Although a bit overpriced.", "Overall performance of the car is great, mileage is good, comfortable, glossy colors, and the suspension is very good for all kinds of roads.", "Waiting for the first test drive of the best car of the Mahindra. Very good shape heavy body but poor safety features.", "Booked one Petrol Automatic, although delivery is only in March 2021. Hard to wait that long. The car looks just awesome. I have a sedan so this being a second car ( VAG Jetta being the first) I cannot wait to get my hands on it.", "5 stars to this machine, overall this beast can do anything a human wants to do. You can take it everywhere and it will never disappoint you.", "Great car at a great price. The rear seat and window was only the drawback, other than that every single thing is appreciatable.", "Looks impressive, but the success of this SUV will purely depend on its pricing. A lakh or 1.25lakh more (Ax Optional Variant)than the old CRDe should give a success story for 2020 Thar, anything more may have poor acceptance in the minds of India car buyers.", "It is a very good car, my experience is also very good. Very comfortable for sitting and riding on any kind of terrain.", "I should get big doors so than a 2-row passager can get in easily or a small support door like a Toyota Fj cruiser.", "My brother owned a Mahindra Thar a few years ago and I used to love driving it, Just waiting for the launch so that I can buy a new 2020 Mahindra Thar.", "This is a powerful beast with an elegant look. Now Mahindra offers Thar with the best deal and all functions. I am waiting for you Thar.", "Thar is an Indian legend. It is a noticeable car on the road. This car is very capable of offroading as it has a very good 4×4 low gear system.", "Best Thar ever the 2020 model. the old family members were refusing to buy and now the family is interested to have an Thar adventure.", "It's a really nice car and the convertible variant of Thar 2020 is awesome.", "I am very much excited about Mahindra Thar. I really want to own it but let's see. I love Thar's look and power.", "I am planning to buy this, amazing Thar with good colors. Overall, real SUV which can create a different segment.", "New Mahindra Thar is a good car but not a family car yet if you plan for your first family car please consort with expert and test drive before book it. If you are a hard fan of Thar and you like adventure too and your financial conditions good then you go with new Mahindra Thar. Nice looking best off-roading and best in class comfort for driver an...", "Low gears are not sticking on the road, rear can't accommodate more than 2 people. nobody drive in the rough tracks. We cant expect this much from an Indian rubicon.", "Iss bar ki Thar ne bahut kamal ki hai. ab toh intejaar na ho rha bilkul bhi isko lene ke liye."], "5": ["When I test drove it, I felt the power of Thar, it can't be explained in words. It has a great engine and you get approx. 12kmpl mileage that is good for such sports cars hungry for fuel. I am sure that you will never be disappointed and dissatisfied with power, comfort, performance and looks. It has the best airbags. ", "It is an excellent product with good suspension, average mileage, and good AC, but definitely need some more comfort like an armrest, electric steering, a metal top.", "This is the best car for off-roading, it has a 4*4 drive type, it is comfortable for long driving and it is a budget-friendly car. ", "Best in the budget. It might not be a very family-friendly car if you have an older family member (50+). But if you are young and have a family of 2 to 3, this is the best car you can buy. It's only the real SUV that deserves an SUV tag on that budget. Really a great product, feel the car and then decide, not by just reading any review.", "Nice features, great pickup and good ground clearance. It's an amazing car for off-roading and good speed. No other car can beat Thar.", "Great car. The best car with the best design. I love Mahindra Thar. It's a really amazing car with great performance.", "Nice car. It looks better than old Thar like Jeep Wrangler. wider, power also good. I love this awesome car. ", "Best in the budget. It might not be a very family-friendly car if you have an older family member (50+). But if you are young and have a family of 2 to 3, this is the best car you can buy. It's only the real SUV that deserves an SUV tag on that budget. Really a great product. Feel the car and then decide, not by just reading any review.", "Best off-roading car, which I have driven on the mountain. Which gives you many features and great performance.", "The overall driving experience is good with the best performance and off-roading. It's a comfortable and the best adventure car.", "My experience, with the Mahindra car, is very comfortable and smooth. ease in handling and a lot of features, with great mileage. On behalf of safety, it deals with good safety measures if any mishappening. Looks wise is also great, all over the Mahindra Thar is a good car at all costs. It has a lot of space good for the tour.", "Really nice experience. Comfortable seating, and safety in rough driving. Overall a perfect car for rough driving and driving on mountains. Four-by-four driving quality is the most amazing thing about this car. A perfect thing for long drives and adventure lovers. Quite a perfect experience driving this car. I love this car. Want to buy this car as...", "One of the best cars in India. It is good in design, mileage, and an affordable price. It's a stylish car with excellent performance and the best satisfaction.", "I really liked this car as it's very powerful with a good look. Its features are really nice and I love driving this car. Long drives make me feel good.", "Mahindra Thar is the best SUV in the Indian market. It is competing with the Jeep Compass which is many times more costly than this car. The mileage of the car is not good. ", "This is the best car for a long drive with good performance. Its road grip is excellent and best for off-roading.", "The Thar is a good car for off-roading its performance is very nice and ground clearance is very comfortable. Driving modes are awesome and the best in the SUV segment and top off-roading quality.", "It's so amazing and beautiful model, it is so comfortable and a royal feeling I get when I drive it is nice, the is moving smoot and can drive easily when stop near signals all are looking at this car. How they got this thought I don't know this is my favorite car among all the cars and all like this car.", "The best off-road vehicle I ever experienced in my life Thar is a Powerful and excellent vehicle that can easily travel on any type of road India's only brand Mahindra I prefer this vehicle for long drives in a hilly area in the rainy season it is the only weapon to me to travel out I love it a lot.", "This car's road appearance is very nice. Nice car for family also. For boys and girls, it's a good option to buy. Driving is fun with the new engine. The looks of the bumpers can be a bit more macho. Now ride quality has been better since the last that but the convertible top has to be a bit Re-engineered.", "Mahindra Thar is the best and strongest car. There is no answer to safety. Mahindra's Thar is useful in 4X4 and an amazing offroading looks.", "Mahindra Thar is very comfortable and smooth. It is very good performance. Thar looks are very good. This car is a good car for off-roading. Driving modes are awesome and best in SUV management. ", "Mahindra Thar is the most beautiful car and someone's dream car and best performance in the millage and best looking car.", "Very nice car with the best features. It's a very comfortable and good performance car.", "THAR IS ONE OF THE MOST AFFORDABLE OFF-ROADING SUVS. PEOPLE LIKE IT THE MOST AFFORDABLE THAR. ITS PERFORMANCE IS QUITE TERRIFIC. MAHINDRA THAR IS A STYLED SUV THAT I LIKE. THAR IS ONE OF THE BEST CAR THAT I HAVE EVER SEEN. ", "THAR IS ONE OF THE MOST AFFORDABLE OFF-ROADING SUVS. PEOPLE LIKE IT THE MOST AFFORDABLE THAR. ITS PERFORMANCE IS QUITE TERRIFIC. MAHINDRA THAR IS A STYLED SUV THAT I LIKED THE MOST. ITS EXTERIOR IS JUST AWESOME. ", "Mahindra Thar is not only the best-selling off-road SUV of the company as well as in its segment. It is liked for its powerful styling and engine. This car is also very much liked by the youth. Now apart from off-roading, it can also be seen on city roads. You get better high-speed stability in this car.", "It is looking good and its performance good. Its 4×4 wheel is also very good. This is an offroading car.", "The most spacious car. My experience with Wagon R has been fantastic from buying to till date. I can say that it's been a complete family car for me as of now. I had Maruti Alto before this, but when I bought Wagon R, almost all the issues, which I used to face with Maruti Alto have been solved. The biggest problem I used to face as a 6 feet tall g...", "Mahindra Thar is very best car in the world, it is a very powerful car, I love its 4x4 model, this is the very best car on the highway and for off-roading.", "I like this car. I suggest buying this for better comfort and dashing style, it gives good balance while driving, Go for it. ", "An amazing car for all types of people VIP or non-vip, this is the only car that can beat every car. Now it's a VIP car with no engine sound. Best in the segment I like the soft-top model personally.", "I like it very much. Its looks and ride are very smooth .seating space is very comfortable. The lighting and the interior are much lovable.", "This is a very good looking car and engine performance is great, I drive this and I feel very comfortable with the seats and other things are wonderful, I have driven on a hill station and off-road, good performance in all time.", "This car's new look is dashing and the black colour totally suits it, the classic Thar is I guess the best car to buy in the 15-20 lakh range, I totally recommend this. This is the best car in this price range and its performance is awesome. ", "Thar is the best product by Mahindra. Thar is one of my favourite off-roading cars and a budget product by Mahindra.", "The car's new look is dashing and the black colour totally suits it, the classic Thar is I guess the best car to buy in the 15-20 lakh range, I totally recommend this. ", "This is a very beautiful car, the seats are very good and comfortable. Also, Mahindra Thar has a good suspension. ", "The new generation Mahindra Thar has surely improved, It is very comfortable for long drives and off-roading and stunning looks like a lion. If you are looking for adventure trails then go for the new Mahindra Thar its an amazing vehicle for off-roading, it gives you very good performance for adventures.", "Nice experience. Wonderful car. Very comfortable. Mileage is very good. I suggested this to everyone. Go for it. ", "Mind-blowing performance and beautiful looks, great experience. I love this car, it is my all-time favorite. ", "It's an amazing car my all-time favorite Driving comfort is truly amazing Dashboard look seating comfort are so  very good thank you Mahindra", "It is the best off-road car in the world, I really like this car and it is more comfortable than any other car. there are many more good things in this car, I can't explain. I only tell one thing about this car is the best off-roading car in the world.", "The Mahindra Thar is a vehicle built for real off-roading. Its ability to negotiate rough terrain is genuine and in its latest iteration, it's also useable as an everyday vehicle. The Thar is available with diesel and petrol engine options and there are three roof options as well.", "The Mahindra Thar is a vehicle built for real off-roading. Its ability to negotiate rough terrain is genuine and in its latest iteration, it's also useable as an everyday vehicle. The Thar is available with diesel and petrol engine options and there are three roof options as well.", "Superb and extraordinary vehicle better than other 4x4 vehicles and has classic colors. I have a Mahindra Thar in my life and my parents also like this Thar. This vehicle's performance and comfort are heart-touching. I love this vehicle. Value for money. ", "Mahindra Thar has a rough and tough exterior and the capacity to hold heavy loads. It comes with an open rooftop, which does not suit hot and humid environments. I find this model the best option for adventurous long traveling. However, it does lack behind in terms of security features.", "My experience, with the Mahindra car, is very comfortable and smooth ease in handling, and has a lot of features, with great mileage. On behalf of safety, it deals with good safety measures if any mishappening. Mind-blowing and amazing thar best 4 setter car love it.", "Thar is one of my favorite cars. The overall driving experience is good with the best performance and off-roading. It's a comfortable and the best adventure car.", "Thar design is very interesting and looks so cool. It is comfortable for off-roading and hilly areas.", "I have never ever seen this type of car, my experience with this was totally awesome, feeling comfortable, all variants are looking so much beautiful, I'll suggest for my friends and family to purchase this. This is a value for money.", "Very good car for off-roading and good for the family. I have driven it very good experience in Thar nice maintainance and good ground clearance. Good car and very popular. It is a powerful car. The best car ever I have.", "The best off-roader in the budget, however, lacks somewhere in comfort, but it is an overall super powerful and super classy car with a mighty road presence, quiet low average but on 4x4 can climb up steep hills. Very good, comfortable look, attractive, mileage is also good. Everyone who purchases this car will satisfy by Mahindra. ", "The superb car and its mileage are awesome. There is no other car around its performance, it looks stunning and when you drive it you feel amazing.", "It is a very excellent car with good performance and amazing look. This is the off-roading car.", "Mahindra Thar looks and feels amazing. The power and performance are also good in this price range. Overall it is a great car.", "Awesome car with smooth driving experience, comfortable seats, and very smooth gear. The car is excellent in looks and really very much comfortable in driving, a really fantastic experience.", "Mahindra Thar is a good looking car and it is very comfortable for long drives. The power and performance are also amazing.", "Wow, it looks awesome. I love to drive this thar in auto mode. Super comfort and rich look. Better price.", "Mahindra Thar is a very extraordinary car. It is super comfortable with and good looks in style, very attractive look, also I love the mileage. ", "The Thar is the best car for offroading and highway driving.", "Thar is the best performance and mileage car with wonder full design, tyar grip.", "It is a nice car with comfort and features. It looks awesome and maintenance cost is low.", "The Thar is a very nice car when we see it from the front side it seems to look like Jeep Wrangler. It is the rival of Creta, Harrier, Hector, and Astor. It basically comes with two types of the body which is a convertible and hard top model, it gives you a nice mileage in this price range, when you drive this you can sit very comfortably. Thar is ...", "Mahindra car's engine is one of the most powerful engines and most valuable cars in the world. I love Thar because of its good-looking body and durability. The power and performance are just amazing.", "It was a good experience. Its sitting comfort is very nice with very smooth driving. The Thar suspension is very comfortable.", "The best SUV I have ever seen. Its style and looks are awesome and feel sporty. The best feature is its suspension.", "Mahindra Thar is the best 4 wheel drive and good performance in the world. We love this car, and all customer experience is good with Mahindra Thar.", "A modern take on an iconic design, the All-New Thar, with its wide stance and iconic lines. The all-new interiors have everything to make every trip comfortable &amp; fun! Sporty front seats, reclinable rear seats, roof-mounted speakers &amp; more!", "Awesome when you go travelling off-road and the best powerful engine overall the best car.", "Awesome SUV. Powerful and yet comfortable. Mileage for me is nearly 13.1kmpl. However, I will prefer a 5 door Thar for better boot space and entry for rear-seat passengers", "The good nice design I loved this car. I like sitting comfort. Perfect design cute car 🚗 🚨 🚗🚗🚨🚨🚨🚨🚨🚨", " The car was too good. The design was good for a Jeep. Powerful engine. ", "Made in India and make pride road star SUV in a low budget range. I love this vehicle proud of you Mahindra.", "The hardtop variant name and it's the price in the petrol model and moreover it's average in petrol model in cities not in hills if someone drives it only in the city.", "I am waiting for a long time, this is my dream SUV. I like to buy immediately, I can't wait I want to go for a long drive.", "Best car ever with low maintanance cost and good in mileage. Best in this budget with good in looking. Best in comfort.", "As it is a more efficient and powerful car. As it is an offroading vehicle. I use it as for adventure my works, picking and dropping, for tours and the best of all for Agricultural purposes. It is the most affordable and adorable car.", "I think it's best for youth 100 %, good for off-road and city driving is very comfortable I don't no dis is a family vehicle or not.", "This is the best car in this segment. The features are amazing. ", "Thar looking nice, and riding super, long drive super, chasing comfort feeling joy ride,", "Mahindra Thar 2020  is one the finest vehicle which  is suitable for off road as well as city roads.", "I just loved this car and the performance of the car is great along with the looks, whenever I am coming back to India for sure I am gonna buy this car. I just wanna Thanks Mahindra for making such a great car.  ", "A superb vehicle, perfect for Indian terrain, I really like the feature of a new car and the price is reasonable.", "Nice, very good. Nice riding experience with high power and good gear train and nice suspension. Very good look just like wrangler rubicon the back of Thar is very nice and four where the drive is astonishing marvelous wonderful astonishing and nice delicate and powerful gameplay that is nice for a very nice and very addictive app for all the new t...", "Excellent car at minimum cost. Airbags, Music player, seat comfort, build quality, colors, led lamps central locking excellent, and many more features.", "Good vehicle ever offroad vehicle's well I am a big lover in Thar 2020 that my dream. And I am buying Thar soon. I love you Mahindra.", "The looks are very good, and after its launch, I will also buy this beast and its engine is so powerful.", "New Thar is a very good looking car but the performance on the highways is not good however, the off-road capabilities of the car are very good.", "Amazing feature and powerful pick up 4x4 jeep which particular feature you will get only in Wrangler Jeep car.", "Nothing to complain about it. But I want the LX variant in 6 seater version... So, please let me know if this is possible or not...", "Looking good and now we used daily use. Thar 2020 Mahindra is best for offroading vehicles also.", "The king is back; waiting for the 2nd October when bookings will start.", "Finally, it's my dream because really. I'm waiting for this car for a long time. I'm also Bolero and old Thar owner but some moment empty but now I'm completely full filled my dream for all new Mahindra Thar thanks Mahindra and Mahindra special thanks.", "The beast is back. I have already got the beast in my garage.", "I think a premium off-road SUV by Mahindra looks very luxurious. I think it might break all record in India", "Best beast in the market. Has everything that can make your body shiver. Love driving this piece of art.", "Mahindra Thar is a perfect car for adventure and off-roading at an affordable price. It offers great comfort and pride in riding quality.", "The car has a very premium looks and design.", "I am not a fan of Thar but looking at these stunning looks of 2020. Thar, I had become a die-hard fan wishing I would ride this beast soon will buy if possible for me.", "It is an amazing car such a beautiful product by Mahindra beyond the mind and Mahindra doing wonderful work."]}