{"0": [], "1": [], "2": [], "3": ["Talking about the Mahindra XUV 400 EV is a very powerful SUV. In this car, you have been given a large cabin and boot space, great handling, great safety rating, and features, a beautiful design, and a better front grille. Its price is expected to be around 15 lakhs.", "Mahindra XUV400 offers a great range. This car can run about 400-450 km on a single charge. This car will compete with Tata's Nexon EV and Nexon EV Max present in the segment. Both these cars are currently sold well in the market. This car leaves everyone behind in terms of looks and style."], "4": ["Mahindra XUV 400 is ready to hit the market, Its price starts at Rs.17 lakhs. It gets over 60 connected features including an electric sunroof, digital instrumental cluster, aerodynamically designed 17-inch alloy wheels, dual-zone climate control system, auto headlamps with rain sensing wipers, Type-C charging outlet, and many more.", "Overall very good experience. I have driven Nexon EV also but this one is much better than NEXON EV. Very good range, fast charging, and beautiful design especially the copper touch makes it much more beautiful and stronger than any other EVs.", "It's an amazing EV by Mahindra company it looks perfect SUV and EV concept all the features of the car is mind-blowing and inside and outside of the car is looks very good and safety of the car is very very good all over car is very very amazing it will roar in the market within limited time.", "Overall it was a fine experience and the acceleration power of the vehicle was way too good as compared to other electric vehicles.", "This car looks very stylish to see from the front. Along with this, the latest logo of Mahindra is also being seen in this vehicle. The new Mahindra XUV400 electric SUV is bigger in size than the XUV300. The length of this new SUV is 4.2 meters. This car is being launched in the market at an affordable price point.", "Why don't Mahindra change its interior have booked XUV 300 but now wish to compromise with safety and go for other rivals just for features and styling because we still ride bikes on road and zero stars rated cars are safer than riding a bike on the road.", "Decent looking car with extraordinary features which includes an auto-breaking system is something that attracts buyers. There are a lot of new features which I think are now common in all the new cars and then there is no doubt that I give a very good mileage for an EV car. But I think they could have given a more attractive design, but apart from...", "Its looks nice with good mileage, but the price is a little bit high. Its legroom is less, and the lights came as XUV 300 which is good.", "The carmaker has confirmed that the bookings for the model will begin in the first week of January 2023, followed by its launch by the end of the month. The test drives will begin in December 2022 across 16 cities, namely, Mumbai, Hyderabad, Delhi NCR, Bengaluru, Kolkata, Chennai, Pune, Ahmedabad, Goa, Jaipur, Surat, Nagpur, Trivandrum, Nashik, Cha...", "I am waiting for this car's electric variant for a very long time. So when ever Mahindra launches this car I will check it first."], "5": ["I am so in love with XUV400. Be it the interior or exterior or even the color combination everything is awestruck to me. Enthusiastically designed, classy X motives on the grille are superb. Well styled and less maintenance required car offered by Mahindra.", "Nice car for the Indian market. In terms of safety, price and design, and value for money too. It will work as a revolution in the EV segment. ", "Excellent fabulous exciting, electric energetic, accelerated, engine, storm in speed, performance in each segment, a best electric vehicle in the car segment. Great look and sharper design in the comparative segment, very good, and excellent feature 6 airbags. The design space is lovely. ", "XUV 400 EV has been revealed &amp; looks stylish that is Mahindra USP. It offers many features like a touchscreen infotainment system, dual climate control, push-button start-stop, electric sunroof &amp; much more. Prices are expected to be similar to Nexon EV Prime.", "Really tasteful design. Usually electric cars go overboard with their design elements and make it look so clunky and not so admirable, but Mahindra e XUV300 design is absolutely gorgeous especially its white color which looks so premium with blue accents that make it look so futuristic. Interiors also have the same black, white and blue t...", "Very good car to go within the electric area. As always they are giving the most desirable option to there end customers.", "Good car and comfortable. The has good interior and exterior ", "A good electric car made and manufactured by an Indian company Proud to have a car and company like this in future at our country The last features offered by car are mind-blowing and it can win the heart of all people Proud to be an Indian"]}