{"0": [], "1": ["This is not valuable car waste of money. You do not buy this car. Because technically car production is delayed.", "Not good looking the exterior is too much and the ADAS(Advanced driver-assistance systems) is also unnecessary especially in the Indian roads, turbo petrol god knows how much average it will give", "Too much-overrated SUV, In India the biggest problem is the lack of knowledge in youth, anything launches with no details of Mileage, Global safety rating, Performance. The youth starts endorsing just based on the size. If size only matters people would have been driving trucks in the City. If people start using their own brain they will realize th...", "What's not good is whoever made the variants is a real dumb person who has zero knowledge of market demand and goes market strategy. ADAS(Advanced driver-assistance systems) features are only for 7 seater top-end model variants. This is a real show stopper for 5 seater SUV buyers to drop the plan. Mileage is 12-13kmpl is a real ...", "I have XUV500 top mode and believe me. It's competing for failure cars when we talk about the quality of sensors related to features. Features are just shown case."], "2": ["Design is not easy. Using high voltage light doesn't make a car good. Please improve your design. The side profile is the same as the old boring XUV 500. Mileage is also not good.", "Seats are too hard. Feels like sitting in a local bus. Thigh support is less. A car worth 25lakh is supposed to have the most comfortable seats. Just adding big lucrative features, but missing out on basic features.", "Really disappointed by the looks, It doesn't have the road presence like safari or harrier, it's a very average-looking car.", "Vehicle as such is very good for the cost. I have used it for 1lac plus Kms. But maintenance to worst, servicing is bad. ", "The odd box/oldie look is not at all matching with the loaded features and safety measures. Having all in a better-looking car I won't hesitate to purchase this kind of a vehicle. Mahindra should work in looks else will lose customers to other less safe but stylish looking cars. This is not my dissatisfaction but a view. Many must be feeling the sa..."], "3": ["A good car to buy at an affordable price, the car is having mind-blowing features and its handling is superb. Recommend to everyone. \n", "Mahindra is XUV700 is best in comfort, no noise in the cabin, powerful and refined engine, so smooth drive experience.", "The top-end petrol variant is in my hand for three months. The entire focus is on features and styling. More important things are missed or ignored. Never faced this in my other cars, although much cheaper. Fuel efficiency (petrol/7 seater) is 4-6 km in city (NCR condition) and max 8-9 on highway. Most Apps provided has some or other usability issu...", "The all-new Mahindra XUV700 is the best XUV ever made by Mahindra. It is giving cutthroat competition to every rival in the same segment. The best and defining feature is the new logo and the amazing space it is offering which is a blessing model for Mahindra as well.", "XUV700 is what brings Mahindra back into the game, and boy, is there a lot to speak about. Let's start with the available drivetrains. The first one is a 2.0-liter gasoline turbocharged engine with 380 Nm and 197 BHP. Both a 6-speed manual and 6-speed automatic transmission are available. In the MX (basic) variant, a 2.2-liter turbocharged diesel e...", "The XUV500 accomplished many things well, which is why the vehicle was an unqualified success. Consider the XUV700 as a significantly better XUV500 with the same basic design but updated for future needs. On the basis of first impressions and the incredible entry price, Mahindra appears to have a winner on its hands. The XUV700 is available with a ...", "I took a test drive of the XUV 700, and with full confidence, I can say Mahindra did a beautiful job with the updates and features of the SUV. The new logo looks more attractive to buyers. I believe there should have been more color options to select from. And one little problem is at a slow speed it feels a little uncomfortable to drive around.", "When Mahindra announced the new logo and decided to do justice with XUV 700 at that moment only I decided to save to buy it. And today, I bought XUV 700 with a new logo and an automatic version AX 5 Petrol AT 5 STR at the price range of 18lacs in midnight black color choice. So far the experience has been wonderful.", "I did not pay any heed to XUV 700 as I never was interested in it but, by the time it launched and after one month XUV700 was making an uproar in the market. The new logo of Mahindra and shiny color options with excellent features to top and that too ineffective price range got all of my attention, and I became obsessed with XUV700.", "With larger, more comfortable seats, superior upholstery, and a number of useful amenities, it receives a very well-designed and luxurious cabin. It has Alexa integration with Adrenox, a completely linked automobile technology that allows voice control of a variety of in-car technologies. Other luxury features included a 12-speaker 3D surround soun...", "The new XUV700 from Mahindra is available with both petrol and diesel engines. Both engines deliver excellent performance and a comfortable riding experience. Even while it may not have the most stunning appearance when compared to other automobiles, the price makes it an appealing option. It clearly has the ability to completely eclipse its rivals...", "Mahindra's style and looks are unmatchable with any car, and the new logo adds more charm to the SUV. XUV 700 is a beautiful yet powerful beast. I bought it in the electric blue color of the MX petrol version at a price range of 17lacs on-road price. Everything about is soo amazing, and I simply love it.", "Mahindra has outdone itself and has made a very good-looking SUV 700 I was really amazed to see have beautiful the car is inside out a great job.", "The Mahindra XUV 700 is affordable, easy to maintain, and offers a smooth driving experience. It is also incredibly spacious and comfortable, has a great LED headlamp, and has good display and touch capabilities.", "I had driven this vehicle. overall satisfied by the SUV in safety and by lòoks more over ventilated seats should have been provided at this price range. The boot door is of high-grade plastic expected to be metal like other SUVs but the design is great. ", "Good iconic experience with loaded features. The sound quality is awesome. Good stability and fun to drive. Will be much happy if an improvement on mileage is done. Overall must buy.", "It's good looking and comfortable Its driving is very comfortable But it's not good for fuel-efficiency.", "It is a 7-seater and spacious car with good looks. Fast speed overall good performance car. Low maintenance car. Its mileage, pickup, and comfort level are also good.", "Mahindra XUV700 is perfect if you are looking for performance and its value for money. It's available from 15L to 30L. Wide range of options to choose from.", "first of all good design, more power, better riding comfort than the previous one and value for money and safety.", "This is the best car for comfort. The price is also good and looks nice, but its dashboard should be improved more.", "Awesome safety and performance, but mileage are low, and refinement level is good, handling is also good, looks very nice and best in this segment.", "Overall performance is good. It's very comfortable and spacious in comparison with other SUVs in the same price range.", "Horrible. Over 120 mph the car beeps like it's gone mad. It will definitely cause an accident due to the fact that the beeps make the driver distracted. My older manual cars had no such issues. Legal speed is one thing. There are some highways supremely disappointed. Every small car will be passing you by if you follow this.", "Lower variants should not be denied of must-have features, like reverse camera, auto headlamps, auto climate dual-zone, auto fold mirror, start-stop button.", "The comfort of the 3rd seat and many of the features are missing in deed. Mileage might be able to get more. Thanks for ADAS(Advanced driver-assistance systems)", "Worst performance as compared to Hyundai Alcazar, and maintenance cost is high compared to Safari and Alcazar.", "Nice car, but poor car mileage only, the safety feature is good, design is better. Everything better", "Not as massive looks like XUV500. Made for family people. It will be better if 6 seaters like Innova. But it will rule Indian road. More power engine. If interiors in dark shade Maybe look more comfortable. More white colors materials were used. The top-end model will be more options features and comfort.", "It's too early to comment. Performance can only be judged after people drive it for some time. Mahindra has not disclosed all the features esp mileage as of now. We should wait &amp; watch.", "The overall design of the SUV is below average. The front look is ok even with huge LEDs which slightly robs its adventurous long drive SUV feel but the rear is horrible. It just looks like a basic hatchback and doesn't go well with the overall design of the body. Mahindra should improve it soon. Cost and features are obviously a plus but with so m...", "I am using the car for now 5 years. XUV is a good car but build quality plastic and doors aren't good, started giving weird noises and the engine makes noises after 3 years (68,000) km, one good thing I liked about this car is engine performance it's just amazing.", "Nice car with fairly good comfort. Legroom in 2nd and 3rd row greatly compromised. the ivory white interior is awesome. What not suitable for Indian driving conditions and will become soon dirty with dirt. A better option would have been black and grey. Dashboard missing soft touch. Though booked one. But changing my mind", "About 5 seaters It's a good car as long as you don't care about mileage, but if you're someone who cares for the overall economy I would suggest go for Creta Diesel or maybe Tata Harrier XM if you want some added power.", "Tested yesterday itself. I see major challenges of space, especially the 2nd and 3rd row. 500 is better placed. The front panel is superb, attracted a lot. Small Speakers placed at the roof, but discomfort. All one needs to decide is the use of too much auto assistance.", "The car overall is good but the engine options for 5 seaters are just not justified as there are many cars in this range that claims more than 20+ mileage, but this car won't be giving us more than 12-13kmpl over highways, and 8-9kmpl local. I would say the 7 seaters might work, but not the 5 seater variant. Even Harrier gives a mileage o...", "I am using electricity from M&amp;M and I am happy with that - the e20 plus - one thing is anyone who comes into that car states it is spacious. From that, I can say XU700 will surely have enough space for us to travel - comfort is every person, but I am thrilled from what I have seen in videos. Safety, I have no doubt, they will make safe cars. Th...", "The price range is too high in this category. An also a better segment of other brands available in this range. in the market. Only 2 airbags are not enough for full safety.", "Nice car. Good mileage, the look is impressive, better than any other car in this segment, highly recommended, great power", "Excellent car for the city, and the village also. ADAS(Advanced driver-assistance system) features looks good. Crash sensor, sun roof, music system, looks good.", "The overall result I would rate it an 8 out of 10 since, although having a tonne of features, it lacks essential elements like access to the back row. Additionally, when given throttle, the ride feels harsh and uncomfortable and lacks the comfort it should have. In addition, the engine has incredible engine refinement at a reasonable price.", "Recently, I came across this beast, and the new Mahindra logo in itself is breathtaking and charming. I thought some new brand entered the Indian market, but it was none other than Mahindra with its class. XUV 700 is the most compatible car for the family, with awesome legroom in all the rows and fully loaded with features with astonishing engine p...", "Earlier this year, Mahindra revised the variant-wise features of the XUV700. Now the AX3 model does not have a rear wiper and defogger. The company has also removed the selective unlock function for the doors and boot-lid of the AX3. The price of this car starts from Rs.13.18 Lakh."], "4": ["Such an amazing car with great performance and no other car to compare with XUV700 in this price segment.", "I would say this is one of the best cars currently available in the market and comes with the best-in-class engine and best-in-class technology. And that too in your budget and that two in your budget the only thing to be concern about is the mileage that it offers because of a very big petrol engine it offers only 7 to 8kmpl in city driving. But i...", "It's a very comfortable and safest car with a good interior like Audi and Mercedes. This SUV is such a good performance car.", "It is a fantastic car with good mileage, features, looks, performance, and build quality are the best.", "The XUV 700 is a powerful, fantastic and complete family SUV car with Comfort. Go for it. ", "Overall very good car experience, great mileage, comfort, and good handling. Space is adequate but not in the third row. Mahindra would have thought of making second-row seat adjustments so that adequate space would have been provided for the third row also. Otherwise, the car is very good and worth buying for the price", "Overall the car looks premium and safety is top-notch. The car is very comfortable but the only concern is that the mileage is a bit low. Otherwise, this is an amazing car. ", "The car takes more maintenance and mileage is also very low like 10kmpl. Its performance is awesome, its safety is also good, and its features are awesome in this car.", "It is a nice car for a family tour. Its next-level feature ie. Adas, emergency braking, cruise control, and high performance and comfort. It's one of the safest cars.", "Amazing power delivery, its driving comfort is good, spacious and rear seat comfort is also good, you can go for long trips without feeling tired. The suspension works wonders, you don't feel jerks over small potholes. Amazing mileage from diesel despite 2.2L engine and almost 2-ton kerb weight. The headlight throw is amazing, especi...", "The perfect car of the year comes with the best style and comfort. Its safety features are the massive smartest in this segment of vehicles.", "XUV 700 is first in class luxury SUV brought to you by Mahindra. The 13-inch instrument cluster and attached infotainment panel are just the best in class and add a classy look to the SUV. The XUV 700 is a beast of a car with that panoramic sunroof, and leather upholstery on the seats and doesn't compromise on the luxury of the passengers. The adap...", "It is a very comfortable and feature-loaded car in this segment. This is the best option for all purposes. It looks absolutely fine and also the safety of this car is mind-blowing. Overall a good package.", "This is an excellent car with a feature-loaded SUV. I think Mahindra should do some work and release another variant with 4x4 for offroad capabilities. Surely this car will beat 70 lakh ranges SUV with features.", "Best car in the segment if you are deciding to take a perfect, and comfortable family car. Then this car is the best in mileage, next level of features, performance, and one best thing that I like about this car is the key. The key is literally very simple but you get every feature in the key like the open sunroof and switch on/...", "One of the best products from the house of Indian brand Mahindra which is loaded with features and world-class safety rating (NCAP:-5 *). This product gives good satisfaction to the customer. According to the present Indian auto market, this product is available at an affordable price compared to other brand products like Fortuner, MG, and Tata Saf...", "It is fully loaded with features and has a stylish look which makes it the best car in the market. The digital display in the front is my favourite. It gives a great competition to MG Hector, Kia Selitos, Tata Safari and Harrier. ", "Mahindra's update to its most loved model of XUV 700 with new features, logo, and facelift exterior as well interior did a job well commendable. XUV700 is a deal offer for anyone considering buying it. Yes, it is a bit expensive but worth driving and buying for me.", "As of now value for money SUV. Amazing and smooth drive. It is the best built quality, Amazing features but the waiting period should be decreased as nobody likes to wait for long 7-8 months to get their car.", "This car is a very stylish and modern car. This car gives me great performance with features and safety. It has good space and a comfortable car. This car ADAS is very good, and its speakers are also good with good mileage on highways.", "It's been 4 months with my XUV 700 MX Petrol and this has been a joyride for me. Apart from stunning looks and design, I loved the performance of the petrol engine, QUITE AND POWERFUL- that's it. Even the base variant is feature-loaded and you will get every basic thing you get along with Mahindra 5 Star safety. Con: Few things that I don't like in...", "I bought AX7 petrol auto, it is absolutely commendable car at this price point. Driving and handling are very comfortable. It comes with loads of features that even a 70lakh car doesn't have. It is easy to maneuver around the city. The infotainment system is sleek. You put your foot on the peddle and it is among the quickest car...", "Mahindra XUV 700 is a well-built SUV car with excellent performance. The high ground clearance gives you off-roading capability. It provides classy interiors with good safety features. It grabs a lot of attention because of its handsome styling and solid build quality.", "I recently came across the new model of XUV700 and was impressed. Because when I first saw it, I thought it is BMW because it looks so clary and admirable just by the looks. The safety features are good and reliable. It has good pick up, and the price range is 13lacs starting and that is reasonably good.", "Mahindra XUV700 is one of the most amazing Mahindra cars and in my opinion the best. The most important features for a driver are a great engine, streamlined dynamics, excellent brakes, strong suspension, and top-notch safety. The presentation is exquisite, and the sights seem as if we are on an airplane.", "Massive road presence, very powerful engine, excellent steering wheel, very wide sunroof, when you drive the car you can feel the rush. Overall it's a good one and excellent for road trips.", "Mahindra is unmistakably increasing the value coefficient with the new XUV700 based on the prices. The SUV excels at delivering on all fronts, whether it is in terms of features, size, comfort, safety, or even performance.", "Its heavy look is awesome, and the performance is amazing. The interior is mind-blowing, and the logos are also amazing.", "I think the look of the car takes it all and the new logo. The sunroof is the key point which attracted me also performance wise the car is beautiful. ", "This is a superb and looking car, with all safety features, suitable for Indian roads, best mileage car in this segment. ", "It is an amazing car, No one is providing this many features at this affordable price, great awesome car.", "Marvelous! Amazing Car. Just gives a feel of Mercedes, a really good car by Mahindra. Best in comfort and looks also. ", "I just bought the car recently, and just can't get over with it. The features and the styling is on the top of the line best in the segment, and its comfort level is pretty good. Its performance is also good.", "Cool car with cool looks and with great features. Side door handle bars are awesome, liked the remote feature very much. DRLs and sunroof are also good. The length and height of the car are also excellent. Overall it is an SUV with all great features.", "The car's look is very beautiful. The features are amazing. The topmost XUV car in India. The car door and auto system are amazing.", "Best SUV I have ever seen. Mileage is a bit low but the power and luxury feel inside car hits different. Worth buying.", "This is the best car at a cheap price. It is too comfortable and its features are awesome.  Like I slept in the car while driving and the auto-driving mode automatically controlled the car.", "XUV700 have many different new features as compared to other cars and the price is low compared to Fortuner. It also comes in petrol version this is good thing. ", "This car is outstanding. The performance and comfort were cool. This very powerful and stylish car. A lot of features.", "It's one of the most comfortable SUVs, designing super, smart features, security features and looks awesome overall SUV. 700 is perfect.", "IT IS A VERY GOOD CAR. I SUGGEST TO EVERYONE TO BUY THIS CAR BECAUSE THIS CAR IS VERY COMFORTABLE AND A FAMILY CAR THIS IS BETTER THAN THE INNOVA AND ITS LOOKS ARE ALSO VERY GOOD.", "Mahindra XUV700 comes with a very amazing look and the vehicle is good in terms of comfort but it lacks in mileage a bit.", "The excellent design and build are so good. Great examples of outstanding engineering. The working of ADAS is outstanding and has no words. Overall, good car. ", "This is a great car and it gives smooth drive quality, the comfort level is excellent. Speakers are not of Sony. The car has great power with safety, this is a complete family car.", "First of all, I would like to say this is a value for money car, it has damn all the features which a modern car should have and a normal customer wants.", "Amazing car, well-built quality, superb performance, incredible safety, most luxurious SUV, highly recommended, good for off-roading. Can't give enough compliments. ", "Such a very amazing car with awesome features &amp; safety. XUV 7OO car is looking also stylish &amp; sharp car, it's a very comfortable car for the long drive.", "Good car with great looks and very comfortable seating with spacious seats. It's full of features with lots of entertainment.", "Amazing car by Mahindra. Not any car compete in the price range. Features and build quality is best. If Mahindra provided ventilated seat then this car would have been the best. ", "Great car with great features and build quality, one of the best Indian cars to hit the roads. It's a well-rounded package with an extensive list of features, safety equipment, performance and comfort.", "It's been a month since I m used the AX5 MT petrol variant. It's easy to manoeuvre in the city and on highways it's just amazing. But mileage is on the disappointing side. Mahindra never revealed mileage and what I am getting in the city is around 9 and on highways nothing more than 10 or 10.5kmpl.", "The car is good for its price and you get many features in this car as well, especially for those who love the sunroof, its sunroof is massive. I guess the biggest sunroof in this price, engine capacity is 2197cc and it has 153bhp. It has a very good pickup feels very fast for an SUV in this price range and XUV 700 is faster than Innova Crysta. Goo...", "In so many ways, the XUV700 is best-in-class, and when you consider the bargain costs, it's evident that Mahindra isn't just here to play; it's here to kill. The competition should better find a way to hide.", "It is a wonderful SUV. It is a big muscular car loaded with several features. This car is a combination of power and technology. I'm in love with this car.", "I have purchased my new car which is a Mahindra XUV 700 the car looks powerful. I loved it and it has a lot of good features at this price really a good car.", "Beautiful car as expected. Quality and good performance and latest technology car in India at the best price.", "It is a very stylish and good features car with the best safety. This is the best SUV for middle class family with best mileage.", "One of the best value for money SUVs. Segment and comfortable driving, sitting, stylish and good looking as well as good features and options for driving.", "The XUV 700 is the best SUV in its segment. The performance, comfort, and features are top-notch. The refinement of the engine is good. The build quality is the best, and it looks bold and stylish.", "Excellent SUV car in this segment, very comfortable and spacious, also good driving experience, and good looking car. ", "It is a great car in terms of power and performance. The look and feel of the vehicle are simply amazing. The build quality and mileage are also decent.", "The car is so fantastic as its driving pleasure can't be described in words. The engine is 2litre turbocharged yet the cabin is so silent as if I'm driving an EV. If you buy petrol then it will surely affect your pocket. Highly technical features like ADAS is mind-blowing it's interior gives you feel like you're driving Mercedes. Allover car is ver...", "This is an awesome vehicle, and the mileage is good. Its cruise control is also good, and the sunroof is very large, which is too good. I like very much this type of vehicle. My driving experience is superb with it. All things are good in this car. Overall this is an amazing car.", "It is the best budget car with good looks and mileage. Its comfort and safety are also good.", "Best car in the SUV segment right now. Safety, features, design, class this car has everything. The best product of Mahindra in recent times.", "Well, it's simply the best in class with features like ADAS, 200 hp engine and comfortable ride, a good amount of ground clearance, and the electric blue and midnight black are one of the best colors to buy the car, being a Mahindra car it is easy to maintain. The best part is the sleek infotainment system in the dashboard which is neatly inte...", "The car is very powerful and very safe to ride because of its auto pilot mode. The auto mode is very helpful on the highway. Good car. ", "Nice and convenient car better than Fortuner, you get the best safety features as well as you get the best technology ( Tesla of India ).", "Nice performance with decent mileage and looks are great. The features are also amazing.", "Best in Its features, engine performance is excellent, looking awesome, low maintenance cost, high-security system, cruise control, adaptive cruise control is mind-blowing.", "This is a very good car and everyone can afford it. It gives good mileage in the city and highway also. It offered a great derive quality, this is a great car in this price range.", "The third-row comfort is not good in fact bad. If the middle row can slideable like Safari then we can manage space for the third row. The mileage is good according to the segment of this SUV. While driving at high speeds the suspension of this car makes an irritating sound. And the break pads were not of good quality. Its breaking is awe...", "It is a great car in terms of looking, attractive features, and performance is also good. Overall, fully functional car.", "The overall performance of XUV is fantastic. The mileage of the car is excellent, value for money, safety measures are also good, exterior of car is beautifully designed. ", "I actually like this car but it has a less millage in my opinion. I also tested this car, it has a hyperpower in this segment and of course, its Ultra-wide sunroof, all led light, and 3D surround sound it is massive according to Tata Safari it is a budget-friendly full-size all-wheel-drive SUV it is very good.", "Mahindra XUV 700 became very popular with the launch. It is currently priced between Rs 13.18 lakh to Rs 24.58 lakh (ex-showroom). My friend has taken a test drive of this car, It is spacious from the inside and gives great mileage.", "This car should be an example of a perfect 7-seater car for the family. Since Mahindra's new super smooth engine has taken this beast car to another level of performance it's smooth, it's reliable, stylish, and most important its comfort and features are next level. You can purchase this car blindly, if you don't want to purchase a car for the...", "Amazing style and comfort with mind-blowing performance. ADAS Technology is great. Best in class. Much better than Fortuner.", "Overall, the car is fantastic with a new look and comfort. The features are just more than what you expect in a car with a budget below 30L. Well, I personally liked the car, hope this review helps most of them who were thinking about whether to buy this car or not... well hurry because you'll have to wait, there's a long queue ahead of y...", "AWESOME STYLE, AWESOME ROAD PRESENCE, AWESOME FEATURES LIKE HANDLING, SITTING, DASHBOARD AND PANORAMIC SUNROOF. ROAD PRESENCE IS GREAT, GOOD HEIGHT OF SUV, LOW MILEAGE, HIGH MAINTAINANCE. COMFORT AND AWESOME UNDER THIS SEGMENT, OVERALL FANTASTIC SUV WITH POWER AND STYLE. ", "Proud owner of XUV 700 petrol Automatic Luxury model. Except for mileage Everything is 5/5. A different and top experience, power, comfort, reliability, and safety. Expect mileage of 7kmpl in traffic/city and 13 to 14kmpl on better roads/highways. Sunroof and driving pleasure is top class.", "Such a nice car, and value for money.  The variant which I have purchased according to my budget is AX5. Such a nice SUV, this car has nice features and has good mileage. ", "The best SUV car ever with the most comfortable seats luggage space and with lots of features. You can buy this SUV car for family purposes with blind eyes, look wise this is awesome but I am giving it 4 out of 5. The sunroof/moonroof is also big. ", "Very comfortable and safe, it has a very cool sound system and software with very nice performance. Mileage is wonderful, and worth buying", "Also very well other than company also very good service Mahindra to old and new XUV and comfortable.", "Very good car at 29 lakh with a ton of features and safety. It is very stable and good to drive, a very comfortable car.", "Mahindra is the most popular brand and the new logo is awesome, door handle is the most creative thing. The sunroof and rail roof is so big this is feel awesome and the interior is great. The boot space is great. ", "The best car as ever seen best in mileage speed features good in size colour and one best thing in this car is auto drive.", "It is a very comfortable and luxurious car. It has a fantastic interior with many safety features. Music infotainment is awesome. It has lovely sunroof features that make it so cool. Its display is so big that makes this car awesome in comparison to other cars. In this car, space is much sufficient that making it so comfortable during the journey.", "Best car in this segment because of its feature, safety, and performance. The new logo is hilarious and has amazing looks. Autopilot feature is comparable with Tesla with low cost, Affordable and efficient for middle-class families, especially in India. Its door handle is amazing like a Range Rover. It is a complete package for middle-class familie...", "Most beautiful car in the world, Affordable price for Indians, Next level features are provided in this segment. The electric blue colour look is very attractive and bright. ", "With 5 Star safety rating and important Additional Features such as Central Locking, Reverse Camera, Cruise Control, Hill Hold Control, Etc. This is the best SUV that you can buy for under Rs 30 Lakh But It is missing something, and that is ventilated seats, as we know without ventilated seats it's hard to travel very long distances.", "What a fantastic car. It has amazing and nice features it is a very comfortable car the interior design is top-notch.", "I like its design and specially speaking the new logo. The performance is also good at this price range. Although it is lacking in some fields. Its luxurious model is the best among all. At the end it's very satisfying model.", "Great design, It has amazing colour and features with drive assistance. It comes with the good infotainment system and the panoramic sunroof is just amazing. ", "In my opinion, I must appreciate that choosing a car symbolizes great rich taste because it's unique in mid-range money. It has lots of features at that price. The safety, security, comfort, convenience, air conditioner, light type - LED, Instrumentation and communication. Distance to empty, entertainment,&amp;nb...", "It is an amazing car in this price range. Its features, space, and sound quality are awesome.", "The new Mahindra xuv700 is just an amazing car introduced by Mahindra. Equipped with just jaw-dropping features. With top of the line features the drive quality and the comfort are just amazing. The car has a very good road presence. I would recommend it to buy it. It is great value for money.", "It's a huge car with a big engine. This is the safest car in India. The Mahindra XUV700 clutch is very comfortable. The best thing which I liked is that even after the 7 seats are raised the boot space is 200 litre and needs to improve 3rd row.", "The Mahindra XUV 700 is an amazing car that is one of the best in its price segment. Even though its mileage is decent, the power we can get at this price is amazing along with the stylish looks it offers.", "Best of best in budget and super automatically drive. And the feeling of control and comfort is awesome.", "Awesome car. Bought the top model with great features 5-star NCAP rating, best interior design. Good for Indian road, great looking, luxurious car. Low maintenance cost.", "Mahindra XUV700 is one of the most elegant and luxurious cars in its segment. The maintenance is pretty standard and affordable.", "BEST CAR FOR A FAMILY REQUIREMENTS, STYLISH, AWESOME PERFORMANCE, LOVE TO OWN IT, BEST 7 SEATER SUV IN MARKET. ", "I love Mahindra XUV 700 this is soo cool. The look is awesome and I think it has unlimited features. I say only one thing this is the best SUV. ", "Have all the class exceeding features and looks with smart safety too. Have a great road presence and feels like a king on the road.", "This is a very comfortable car with familiar features, the best car ever. Mahindra is doing amazing. This car is stylish and the features are also pretty good. ", "Car with a great amount of space with great safety features, which makes you feel great. The rugged feeling of having a front grill with great overall dimensions with such a best wheelbase makes the rear passengers feel great. I like the road presence of 700 with great ground clearance. overall it is the best car in the SUV segment with t...", "This is a nice car, the driving experience is too good and value for money. This is very comfortable, easy to handle and it has enough space. ", "Excellent car performance &amp; looks. Good after-sales service. Pros: Very good road presence &amp; build quality, lots of build-in features ADAS is excellent with lane assist. Pickup is best in class &amp; seats are very comfortable. Cons: No electric ORVM mirror No second-row move option or bucket seats, No space in the third row &amp; no space ...", "Nice car, looks are really awesome and good. Features are also amazing and comfortable to drive. Safety is 100%", "This is a great car and looks very nice, it gives good mileage, its features are also good and best car in the price segment.  ", "It's an amazing car. It's very comfortable and packed with features. The ADAS(Advanced driver-assistance systems) lane assist is quite good and responsive.", "It's so comfortable and powerful vehicle in the segment. It looks more premium and fully features loaded.", "I own AX7 MT Petrol in white colour. Very comfortable to drive. Emergency brakes are very effective. Overall it's the best seven-seater for long and short journeys. I drove from Trivandrum to Chennai with 6 adults and two children. The back rows are also comfortable for adults.", "This is the beast no doubt with advanced features, steering like butter or better, the sunroof was amazing, headlamps are much lighter in the night for a comfortable ride, only one thing I want in this car that company must offer matt colours than its look unbeatable, seat adjuster is nice, and the 8 airbags provide the best safety in the segment.", "A great car. You should consider this as a beast in your collection. Nothing is more premium than this in this segment. This car will tick all your basics' checklist and then it will surprise you with first in segment features. ", "I own XUV700 AX5 MT Petrol 7seater black. It is really a beast on the road, which attracts a lot of many eyes towards it. Road presence is awesome. If you ask me about performance and comfort then it's one of the best one in the segment or we can say more than what other SUV offers. Mileage is a little low, but that's no bi...", "When you are thinking about an SUV, you should not think about its Mileage. It has a safety rating.", "High-Five for Mahindra! Pros: Feature-loaded, Freaking performance around this budget even petrol, VFM package! Safety and its build quality 5star GNCAP! Now coming to cons Cons: Third-row comfort! No 6 seater option. Overall: A Feature loaded and well-packaged car. Hats off to Mahindra!", "XUV 700 AX7 luxury pack mileage is somewhere between in 11-12 in petrol automatic in city and 13-15 in the highway whereas in diesel automatic 13 in the city and 16-17 in highway", "I bought XUV 700 petrol luxury pack model on 08/11/21. Without any bias beyond my expectations. I am really lucky. I thought I get this vehicle in the month of January to March. Since then I am experiencing this new avatar from our Indian soil and I will share it . This car is really awesome in the driving dynamics as well as pe...", "All ok. This is going to revolutionize the car market in India. It gives the best technology at a surprising price. Great performance.", "Very good performance, and superb features added with ADAS(Advanced driver-assistance systems) future and the most stylish car. It will definitely be a 5star rating.", "Nice car xuv 700 this is a heavy car and nice pickup and nice car all features are good in this car. The long drive is the best driving.", "Mileage point of view, it isn't useful for middle-class people, so in feature, it is going to get hurdles after in 2 months", "One of the best interior designs in the SUV segment. Best infotainment system. ", "Best in the class segment and stylish look. The friendly pricing for middle-class families. This is better than XL6 or any other SUVs out there. Just go for it. The king is back", "Very impressive SUV, and liked the design. All good features but missing with the following 1. Night view mirror. 2. Ventilated seats. 3. Curtain for rear seats.", "Mahindra XUV700 comfortable SUV. I must say. It's one of the best cars in Mahindra. It looks super, stylish, and bulky. XUV700 has a good feature list which makes it more attractive, and of course its price range.", "Mahindra XUV500 and XUV700 are the best Mahindra vehicles. I love it. Good in power, mileage, comfort, and a good vehicle for a price too.", "Excellent style and features in the segment at this price, real beauty, comfort, all disc, real SUV, space all excellent", "Looking very beautiful, and stylish price, also high range, luxury interiors, and five-star safety car", "I really appreciate Mahindra for this feature-loaded car in this budget with full safety and a real SUV car.", "This is the best in segment car feature loaded car, and car price is super, and car killer looks, Indian brand 🇮🇳🔥", "Muscular look, full of features without any compromise, powerful engine and I'm feeling ver proud this made in India car.", "Nice car with futuristic features. Low on real-life mileage, High on maintenance cost. Superb in looks, comfort, and ride quality", "Best SUV with best futures and price is also good.", "Mahindra Xuv700 looks stylish &amp; a bigger SUV. The price of Xuv700 is very affordable. Mahindra it's known for its safety &amp; features. Its gold edition looks amazing. I have been eagerly waiting for this car.", "Nice sporty look. Perfect for Indian families. It is going to give competition to big SUVs as well. Can wait to see it on road.", "Super SUV under this price. Also shown world-class safety features.", "Mahindra shows us again, what an Indian manufacturer can do. While cars like Creta, Hector will cost you more than 16lakh, XUV 700 7setr provides more than everything(like a luxury Sedan) under 15lakh ex-showroom. The price, engine power, design, interior looks, features are just making me mad. I can't wait.", "Awesome and dream SUV for every Indian. Performance, style, beat looks, features Indian SUV. Best price according to other SUVs", "Mahindra XUV700 seems a spacious and advanced feature-loaded cabin with amazing road presence, dominating view &amp; ride quality. I believe that the price of the car is pretty affordable in the segment as compared to available SUVs in the market.", "Mahindra XUV700 is finally in the market, looking super stylish &amp; sporty. Mahindra is known for its strong SUV car bodies. I was waiting for this car for the last 1 year.", "That was so an amazing car at this price. The car is so good locking and I waiting for a seven-seater of Mahindra XUV 700 is my best think to buy", "Nice car with great features and performance plus safety.👌🏻😍", "Mahindra XUV700 is going to launch this month. It looks spacious, bulky, and stylish with 7 seater SUV. I am excited to see its drive review. Hoping it will offer more features than XUV 500. Mahindra XUV 500 is the best in SUV and Mahindra Cars. So my expectation is much higher from this SUV.", "It is going beyond measures of the ongoing SUV segment. Excellent car high on safety and rich in features.", "Features and styling are absolutely futuristic and modern mileage, performance and space it will be a secret till the car unveiled but it just could be best and In the segment above also.", "Nice car, but required to change little bit look, after that I feel no one look about this price, nice car SUV 700", "The vehicle looks fantastic and overwhelming. Let's wait and see. The safety features are amazing and we can't believe an Indian car manufacturer can deliver such a futuristic car.", "Awesome. Very premium design. Good looking a car. Very advanced features are given in this car.", "This is the first Indian OEM ADAS (Advanced driver-assistance systems/) vehicle. and lots of advanced features at good prices also good look and a comfortable vehicle", "Amazing car in styling, features, and not the least, the driving experience must say it's awesome.", "Very good in pricing, and the car is good in performance and comfort, and styling. I like the car it's my opinion go for it.", "Very nice XUV and everyone like this car, it's comfortable for a long drive, and middle-class family is preferred for a new car in a low price, and all facilities available in this XUV.", "Very good in pricing, and the car is good in performance and comfort, and styling. I like the car it's my opinion go for it.", "Impressive vehicle. But the basic version lack functionality. You just get a tough engine with ample space for 5 people. At least 7 seats should have been provided in the basic version too, with 5 seater version on demand, security features that are been highlighted are just for the high-end version, so people who are willi...", "Mahindra is known for its tough body. XUV700 has a good ground clearance and is better looking. In this price range, it gives tough competition to Creta &amp; Seltos.", "Best in the segment. Love to see this in my home. I'm very excited to buy this car. It will be my dream.", "The vehicle looks great, stylish, and less priced. the very nice interior looks smart.", "We are waiting for the new model of XUV 500 for its comfort as its 2nd row was not much comfortable in previous models. If XUV 500 comes in the same look like shown on top then would be a game-changer for the company as well as customer points of view.", "Best for the middle-class family.", "Excellent SUV,perfect styling, great performance.A nice family car.", "XUV 500 looks very interesting with fully loaded features and latest technology. Waiting for this SUV from so long in Indian market", "SUV looks are very fine. And having smooth experience. A great vehicle for Family and adventure rides..", "Nice experience and a good car, more than satisfied, and it is one of the best car in the class, but the engine should be a thing company can look into.", "Mahindra XUV700 is the best in its class apart SUV. One of the most desired cars of the decade. The right time to launch this car where owners can drive for the next 10 years by the time EV starts picking up.", "Mahindra XUV is a luxury car and good performance of a car and good future of car and good features and auto modes Mahindra XUV looks like a luxury car compared to the luxury 700 Mercedes and Audi and Ducati and the color is beautiful very comfortable and safest car with good performance and power XUV 700 is amazing in all SUV car impressive vehicl...", "Great car with awesome comfort. You have to get used to the thud noise from a suspension that too in a brand new car. Features will be given to you after 1/2 year of delivery. You have to get used to an infotainment system which gets disconnected often, it gets blacked out sometimes.", "It looks good, stylish, and extremely huge, but with that, it all maintains its balance and commanding stance on road. The new logo design of a Mahindra is adding to its features, and the clutch feels so light and progressive. A few of the basic features are missing.", "It looks good, stylish, and extremely huge, but with that, it all maintains its balance and commanding stance on road. The new logo design of a Mahindra is adding to its features, and the clutch feels so light and progressive. A few of the basic features are missing.", "Very comfortable also the feel is also luxurious and the drive is the best mostly the rear passengers are also comfortable while driving on a bad road.", "This car is phenomenal and the first of its segment to carry the best features out there in any Indian car, but it lacks some basic features like auto-dimming IRVM, and the alloys don't look that good for a car of this price other than that, this car is just perfect for anyone out there looking for safety, performance, cool, and practical features", "The best car I have ever seen from India, but the price should be atleast 20 lakhs on-road for the AX5 diesel automatic 7-seater. The infotainment system, styling, features, design, and the new Mahindra logo are also good. The safety and the speakers of the car are also very good. The alloy wheels are the best in this car.", "Beautiful design and looks, good maintenance, smooth driving experience, very comfortable and spacious, good led headlight, good display and touch, big space for luggage. Value for mo0ney car.", "Overall I loved this car soo much and soon I'm gonna buy this car as soon as possible especially the top variant of this car this is my overall experience with a test drive and the information that I am sharing.", "I have purchased this and my family loves this because it is very smart in looks, performance, and safety. I would like to give it 5 stars but I am a middle-class person and its maintenance is a little bit worthwhile for me. Overall this is the best car.", "Outstanding SUV luxury car and comfort is outstanding and locking gorgeous, road presence is nice, and features are awesome. This is better for family safety and comfort India's best safety rating is there in Mahindra XUV700 only I hate mileage and etc all in one.", "Excellent SUV car in this segment, very comfortable and spacious, also good driving experience, and good looking car. It is a great car in terms of power and performance. The look and feel of the vehicle are simply amazing. The build quality and mileage are also decent.", "I am using this car for a year. it was a good and more comfortable car with good handling also. The mileage is less."], "5": ["At this price range, the car has not yet come from other companies like TATA, SUZUKI, etc. The features of Mahindra XUV 700 has more and more features loaded in this car. It has a feature of BMW, RANGE ROVER. This car cracked a 5-star rating by GLOBAL NCAP. ", "Mahindra Xuv 700 is a best seller car. The performance of the car is very good. The look of this car is very good. Its all features are also Good.", "The XUV 700 is a comfortable car for the family, and it has good features with automatic transmission, steering control is also good.", "Amazing car with execellant comfort level, functionality, looks and performance. ", "Great car with awesome features. ADAS works so well and is very much needed on Indian roads. Adaptive cruise control is so nice. It even detects bikes. Well-controlled body roll and excellent suspension setup compared to XUV 500. Excellent engineering by Mahindra. AT can be a bit jerky at times. The blind spot camera view could have been larger. An...", "The overall experience of Mahindra XUV 700 is excellent. The mileage is amazing, premium quality, maintenance cost is minimum and the foremost is features and engine power is breaking all records.", "The Interior is feature-rich, spacious, feels premium and even the 3rd row is usable. The seats are comfortable and offer good flexibility. It comprises two 10.25-inch screens, the infotainment system can be operated via touch, and also a joystick that sits on the center console that also doubles up as the volume knob. Touch response is fluid and t...", "This car is the best car. Its mileage is too better and its seats are very comfortable. This is the best car in India. This is a good car in this price range and the driving experience was good. This is a beautiful car which comes with a powerful engine.  ", "Very nice car in 7 seaters and it gives good mileage. It is good for a long journeys.", "The best car in performance, stylish interior, and classy look. Its ventilated comfortable seats are also good.", "The XUV700 AX7 L AWD is excellent, and its performance is exceptionally brilliant. I love to drive this impeccable vehicle. The pickup is simply best. It is very comfortable and the driving modes are fluently nice. This vehicle is good for long drives with family and friends. City driving is equally comfortable as its design really helps ...", "That is a beautiful car and its outstanding performance feels luxurious.  All features are very good with great power.", "Mahindra XUV 700 is a well-built SUV car with excellent performance. The high ground clearance gives you off-roading capability. It provides classy interiors with good safety features. It grabs a lot of attention because of its great styling and solid build quality.", "Mahindra XUV 700 is a well-built SUV car with excellent performance. The high ground clearance gives you off-roading capability. It provides classy interiors with good safety features. It grabs a lot of attention because of its handsome styling and solid build quality.", "The level of safety and build quality is phenomenal. It's a features-loaded car with good performance also.", "I was looking for a pre-owned vehicle on the lot. I was looking for a car with low mileage and had my type of interest in vehicles. I was placed in the perfect car. It looked brand new being a used car and my customer service rep handled me very well. He was very knowledgeable about the vehicles there, kind, and knew just what I wanted based on my ...", "Excellent Car. I am sharing my thoughts/review after driving for 2months. I have waited for this car for up to 1.5yrs, as I required this car (AX7) luxury pack in Mid black color. Overall Performance: excellent performance if we talk about its pickup level of comfort not so good if we have a long drive. The mileage we can get up to 13.5/km/l Overal...", "The power of XUV700 is awesome. When we are sitting in a car. We don't feel that the car goes to 100kmph. The auto-driving facility is also very nice.", "This is the best car in the world. This is the world's fastest car company, this car is very good in price and in look and features this is a Tesla model car. This is a very fast electric car and this is very fastest SUV car. ", "Wonderful car with a fantastic performance, I like it. It is very comfortable and it gives a luxurious feeling. Go for it. ", "This is a very comfortable car, it has a 5-star safety rating, and the look of the car is attractive, it is a family car near 7 people can seat in the car.", "I have never seen such a nice car to date. It has so many great features, and its look is so fabulous. At such a price no car can compete with XUV700.", "This is an excellent car, its look is very nice. its price is average, this car's sunroof and moon roof are mind-blowing and it offered a good drive quality. ", "A good family vehicle with all safety features and the driving experience is awesome also the features provided in XUV 700 were really useful. In addition, the riding experience in XUV 700 is unforgettable, I really enjoyed the drive.", "Excellent performance and fully comfortable, smooth-running, features are mind-blowing. I'm fully satisfied because everything is excellent.", "Mahindra XUV 700 ki kya tarif kru jitni tarif karu utni kam hai very beautiful look aur kya stylish car ko bnaya hai Mahindra ne iske samne badi badi luxury car bhi fail hai. ", "Overall it's a fantastic car, the most valuable vehicle in this segment, most famous and futuristic vehicle in its segment. ", "This car is seriously damn amazing, and the best part are it's door handles and roof system. Obviously the mileage and safety are great. Other than this, the sound system is crazy.", "Worth Buying, Best SUV I have ever seen. Mileage is a bit low but the power and luxury feel inside the car hit differently. Worth buying. ", "XUV 700 is the best car in the segment. It's full of technology, has soo many features, it's safety features and the most attractive it's touchscreen.  Just an amazing car in the segment. ", "Very good mileage, good comfort and features. The space and ADAS feature is also good. ", "It is a very fantastic product with safety and comfort. The car handles very well. The sound system is best. The sunroof is a stand-out. The mileage in the diesel automatic for such a powerful. It is really good.", "My buying experience is good. I shortlisted this only I waiting for this car for a long time. It plus point that it have all side sensor. Another plus point is the moonroof, it is comfortable, and boot space is good. Its performance is great. ", "This car has awesome features and many types of modes present there. Good sunroof, I love this car And my family was easily fit in this car. This colour is also awesome, l like her automatic braking system and good for the learner because this car has some new features.", "I really like this luxurious feels car, its safety is very good and comfortable, the sunroof is also really nice and its features are also good. ", "Good car for the safety and its colour is too good. It comes with the latest features and the music system is so nice. Good car in this segment.", "Nice car, great comfort, Hi-tech feature loaded car, bold look and design. And this car is only for the enthusiast drivers.", "It is the best car ever made in India, it is the world's best car I have seen at this time, awesome feature, speed and many more in this have I can't express them with my words.", "I love car this car, it looks good, mileage and features are good, other things are average but the car is a little expensive. Overall, it's a good car.", "Awesome car, great mileage and premium look. Its interiors and exteriors look perfect. It's good for off-roading and performance is top of the line.", "It has a dynamic look which shoots with present generation people and it has all new good features in it and even it is 5-star rating car in the crash test too.", "It is a very good car and I also like its looks and logo it is very safe at this cost I appreciate Mahindra for this car.", "This car looks very beautiful. Features are mindblowing and it's very comfortable and has good ground clearance.", "Best ever car in India. Which comes Under best features and design. Advanced technology is used in this car.", "The best car in this segment has features of higher segments and all safety. Auto braking and instrumental cluster are the highlights, 360* camera lane assist Camera.", "This is an awesome vehicle and the mileage is good. Its cruise control is also good and the sunroof is very large which is too good. I like very much this type of vehicle, my driving experience is superb. All things are good in this car. Overall this is an amazing car.", "It is a excellent car. It has superb engine with amazing interior and exterior. It feels very safe and smooth while driving. Value for money car.", "This car is the best car I have seen ever. Best budget, best looks, best mileage, best comfort, best safety ever. I love this car. This is not a car this is my dream car.", "I like this car, the features are really awesome. This car has everything and is one of the safest car in the segment. This is great for the family as well. ", "Most comfortable SUV car at this price. Incredible features and smooth driving experience.", "I had the pleasure of driving the all-new Mahindra XUV 700 on a road trip to Goa and Karnataka. Looks: Looks like a groomed beast from every angle, to appeal to the old school SUV lover as well as the modern urban guy! Its got really sharp and crisp edges and strong design elements which give it a beefy muscular look. The Drive Experience: Abs...", "this is a wonderful car. The car looks best and has good performance as the engine is punchy. The only problem is that the last row is very bad. It has a very minimal leg space and the middle row has much extra space.", "Excellent car, it comes with awesome features and design is also good. It gives a comfortable drive quality, massive sunroof, dream car, and mileage is just amazing. ", "The XUV 700 is the best car. Its comfort and performance are good. Its safety and mileage were also good. It is value for money car. It looks better than Innova.", "Its comfort and performance are good. Its safety and mileage were also good. It is value for money car. It looks better than Innova crysta.", "Beautifully designed SUVs at affordable prices for all classes of society. With the excellent infotainment system, excellent sound quality, and excellently loaded features, SUV is at an affordable price.", "There are many factors that make XUV700 popular in its segment. The long list of features is one of them. It is available with both 2WD and AWD variants and is now a commonly spotted SUV on our roads. Just like many other cars available in the market, XUV700 also has problems. This is the best SUV. ", "The XUV700 handles high-speed turns with confidence and on most occasions, it will leave you surprised with its capabilities. One of the key selling points of Mahindra is its safety offering and the Mahindra XUV 700 pushes the game further with first in the segment of Advanced Driver Assistance System. ", "The car is worth buying. Safety and looks very good. Compare to all other SUVs this car is valid for money.", "The appearance of this car is very nice and the seat is also very comfortable. My height is 6 feet but I can sit comfortably in this car and the special thing is that the auto-driver in this car is very good.", "It's the safest and most luxurious car. It has an apple car play, but it's looking like a Fortuner and its functions are smart. Its ADAS is very helpful and has an emergency brake that is helpful for us. It has a good sunroof and moonroof.", "XUV 700 is a wonderful car. Its safety and performance are also good.", "This is fun to drive with great power. It comes with a lot of features, and the styling is also great from the outside and inside.", "Mahindra XUV 700 is a best seller car. The performance of the car is very good. The look of this car is very good. Its all features are also Good. It is best car under 25 lakhs. ", "This car comes with new upgraded features in this competitive field.  This car has the best safety with top performance.", "Mahindra is a trustable company in India and Mahindra's all-new variants have good quality and new features and safety purposes Mahindra is good.", "It's a nice SUV car and its looks are very attractive and very nice XUV 700 is one of the best cars for Indian families and it has more space in a car. And the headlight was very beautiful and very nice and the backlight was also nice. and the interior looks lovely. The display is so beautiful and their sites are like we are sitting in an airplane....", "King of its segment and a segment above. Best value for money proposition in India. The ride quality is superb. I prefer it over the safari but not by much. Safari is tough and better to ride in. This however adds a layer of finesse and tech and the overall interior quality is top-notch. On the outside doesn't look as menacing as the safari but is ...", "My favourite SUV car. It's a family car mileage, pickup, comfort level and low maintenance are top-notch.", "It is a nice car overall, mileage is good and the interior is amazing. I liked it very much as the tail light is also looking good.", "Good car with all features and with stylish and overall its nice car. Also, its safety is top-notch and this car is worth one.", "Mahindra XUV 700 is the best premium car. This car has the best feature in this segment and I already use this car for my family. It has a five-star rating for its safety and this car is made for the family. I love Mahindra company for providing the best features and comfort in this car and this is the best SUV.", "This is a very safest and most beautiful car. The sunroof is so big, I love this car this drive is very smooth.", "Mahindra XUV 700 design is very awesome and the car is very comfortable. value of money car.", "Great Car, nice suspension, number of features. Drove 2000 km till now no issues. The display went off once for a moment. Rest is ok Its headlights will make you happy during night driving.", "This is a very styled SUV car with good comfort. Its mileage is also good.", "It's a very nice car. Mahindra xuv700 amazing looking, performance, safety, mileage. It is a good car in this price range.", "Best features among its segment. Fantastic look, safety, comfortable, excellent interior, and mileage are better than its rivals. Pickup amazing.", "XUV 700 is the best car in this price range, this car looks very cool and comfort wise it is so is nice to go through the features there are a lot of impressive features. And going through the drive comfort the engine is super and very smooth. Now finally safety is 5-star safety the body of the car is very tough to break.", "Very good car with features loaded and fully automatic, It has very good mileage and it has a sunroof that is also good. Best car in the price range.  ", "Awesome performance and good condition vehicle and very safe car in XUV series, ac is very smooth. Overall it's an amazing car.", "Best car I have ever seen till now with all the luxurious features to compete with luxury cars which is a good idea. I love the design and all the safety measures taken in this car. I hope that this car will reach the highest rank to compete with all of the other cars. Love from me and from my family Mahindra Team . \n \n", "All in one, the best SUV to buy for smooth performance, luxury look and comfort. Also, the features are amazing. ", "XUV 700 is a fantastic car I have ever seen in this segment. I always appreciate Mahindra for their safety rating and premium class. I always recommend customers to buy this fantastic SUV.", "It has got good looks, spacious interior exterior, it can beat Audi SUV's. The feel of luxurious comfort it provides. Love this car!!!", "I love this car, it is a comfortable SUV car for family and friends for the tour, it has good space, and it is better than other cars, I feel luxurious when I am in this car.", "It's like a superb monster car. It is the best car in the world. The panoramic sunroof is also very nice.", "Amazing car with great features, adaptive cruise control, overall safety and stylish look. It's the best Indian car. Go for it. ", "I love this car's performance. Because it has a mileage up to 21kmpl to 23kmpl. It has engine power. It is compared with luxury cars.", "Driving XUV 700 AX7 for the past 20 days and finding the vehicle value for money. Drive quality is good and features are helpful.", "Amazing car. The best car of 2021. It's such an amazing car with lots of amazing features and top-notch safety with an amazing design. I just love this one.", "This is a very good car with some really good segment-first features, if all the models had the blind-spot monitor and a few more features which are missing then it would have been really great.", "That was a very nice car, and good looks car was also a nice driving experience. I loved it 😀😊", "I have booked XUV700 earlier. But changed my mind without taking a test drive and trust me. I was surprised after driving it 900 km. Driving comfort awesome, massive look, superb interior and wonderful mileage 20.9kmpl, after driving 120 km on the highway.", "I have seen many vehicles, But not as good as this. Got my diesel AT and driving it for almost 3months OMG the power and torque keep me pumping all the time.", "Next level car design and features, Safety features come first amongst all new cars, The interior is so damn good and the bold and aggressive look from front is awesome It a proper luxury car.", "XUV700 is safe and driving is mind-blowing. The ADAS feature and sunroof are excellent.", "Within a week with this car. I'm absolutely in love with it. The sunroof is the largest in the segment. The Alexa is quite good, and the audio system is also good. The engine is an absolute beast. Enough to compete with cars out of its segment. The ADAS is also good and quite impressive. If you are looking for a 7 seater SUV.&amp;nb...", "Fantastic Car With Awesome Features PowerFul Engine And Good Mileage. Nice Interior And Amazing DRL Lights! Very High PickUp.", "Awesome car with great fun and driving. Best safety features, along with the ADAS(Advanced driver-assistance systems) technology, which is superb.", "I like this car with its amazing features and safety. It gives good comfort. I suggest to all to buy new Mahindra XUV700", "Most features are present, and features like AWD are not present. Even in 40 lakh range cars. The true value for money.", "This car is awesome and gave better performance. And better mileage and a high-class system. I like this car looks and design", "Driving Petrol Manual AX7 for the last 3 days. Mileage is around 10kmpl. Driven 80% in the city. Expect a much better mileage on highways and after the first service. The car offers tonnes of features. Might need a couple of days to get used to it. The driving experience has been fantastic. Even a very light foot on the pedal will take you beyond 8...", "Very good looking and better quality and 101%. So excellent further and the mind-blowing car only on Mahindra car teamwork", "The excellent car waited for it for 6 months to launch, and finally got it better than Innova, and Tata Safari", "Excellent product by Mahindra buys Indian brand only. Support to Indian manufacture. The petrol engine is more powerful in it.", "The best car has a 5-star, crash test result at a base model with 2 airbags. Mahindra is doing very great", "The car's mileage is also the best the features like ADAS touch screen 360 parking and 12 sony speaker the huge panoramic sunroof and performance. ", "Besat and wander full XUV 700 Selutabal and luxurious and fully safe, my life's best XUV.", "Super, I love it. In a test drive, I feel like a king of the road. it has an awesome pickup. Looking good, with great performance, It is mindblowing", "It's an amazing car with very intelligent manufacturing, very nice performance, safety, entertainment, luxury, ext.", "The car is fully loaded with features and looks good. And the new design is fully awesome, and the suspension is very good", "Looking forward has a Xuv700 car at the earliest. Its new-age features are really awesome. For comfort and safety, Xuv700 will be a top car in India very soon.", "Very good looking and attractive features, very best price option, not compare any other car in this segment.", "Best Suv for India. This car is fully loaded with features and ADAS(Advanced driver-assistance systems) technology, omg! Just love Hoping that they will also launch the 7 seater variant by Diwali under 15 to 22 lakh. Then it will be a market killer", "This car is amazingly unbelievable. Because at a very low price we can get this many facilities and luxury feel.", "Best car in this segment with luxury features and with excellent safety features. Good looking with AWD options.", "One of the best XUV ever, Mahindra has launched. As you take the performance, safety, engine quality is the best ever.", "You got to give it to Mahindra, they came up with a fantastic product for Indian buyers. Safety features like ADAS are unheard of in this segment and are kept only for premium car buyers, goes to show how badly the foreign manufacturers mint money from us and doesn't even give us the real deal. Homegrown manufacturers like Tata and Mahindra ar...", "Looking sexy, performance truly unbeatable, quality is improved, many colours are available and 5 seaters, and 7 seater idea was good", "Best a big size car and sunroof, digital screen for music, and monitoring my choice is best and what your choice", "The whole new look of XUV700 and its features are really mesmerized me. I am using XUV500 but XUV700 looks massive. Mahindra car's build quality is always top-notch. But this time the inside features are really very advanced as compared to any other car. Look forward to having this asap.", "7airbags mind-blowing under 14lakhs for a basic model. It's not even a basic model. Fully loaded with features. Hats off to Mahindra", "It's a beast best SUV and also good performance.", "Safety looks, giant, style, led lights, colours. Value for money car. This car will crack the market", "An SUV with comfort, features, and safety It is a beast in its segment, even better than many upper segment cars.", "First in segment features, better interiors and outside looks also appealing. Build quality really satisfying, power of this SUV is best in the segment even good competitor of Fortuner's segment also under 18 lakhs.", "Best in the class vehicle, Mahindra did it once again. Awesome looks both front and back. Great performance. ", "So I check the XUV700 MX diesel base model in just 1500000 with a lot of features like the moonroof and sunroof Best features for Indians. Tomorrow I\"ll booked ", "Mahindra New XUV700 has shockingly priced from Rs 11.99 lakh. Performance, powerpack. But I love ADAS (Advanced Driver Assistance Systems). So Overall It's a Good To Go SUV.", "Love you Mahindra. Love india is now changing more and more, it's cool looks. Good luck new car is the lowest price, and I'm very satisfied, performance was awesome", "Best Indian SUV in its segment to date. Tata Safari also has tough competition with XUV700 both are good, performance, safety, interior all good, but I think XUV will be the best so far now.", "Awesomeness. This car is the best in this price segment. looks great, powerful engine, safety features are good. I think it is above up to 20 lakh ", "That is Mahindra XUV 700 the boss is coming now. Good look, great performance, great power. All brands fall down. Never expected this price of an SUV.  XUV700 Starts at 11.99 lac. Thank you, Mahindra.", "THE NEW UPCOMING 2022 MAHINDRA XUV700 COMES WITH THE DIESEL AND PETROL VARIANTS, AND ALSO AVAILABLE ALL-WHEEL DRIVE IN HIGH-END VARIANT ALSO. THE DIESEL VARIANT COMES WITH 2.2 L &amp; THE PETROL VARIANT COMES WITH A 2.0 L ENGINE FINALLY. THE XUV700 COMES WITH THE MORE THAN 10 FIRST-IN-CLASS SEGMENT FEATURES LIKE AUTO BOOSTER HEADLAMPS, LARGE PANORA...", "Upcoming Mahindra XUV 700 is the best car than the xuv500 safety is good, and mileage is best to city and highway", "The car's look is awesomely designed, and the interior design is very good. Also, the sunroof in the car and car has front, and rear cameras and airbags are available. I have no word to say about the car.", "I like the car because it has lots of features. This is better than Toyota Land Cruiser. This car has mileage 19-24kmpl", "Best SUV, I have ever driven. I really liked the music system, smooth for off roads. I am enjoying every drive with my loved ones without any fear because it has the best safety measures. Loving every bit of it.", "It's too good in features and comfort. It has a lot of first-in-segment safety features. The looks of SUV are too Good", "Nice car, seats are good, space is also good. This car has good mileage, and a powerful engine, safety is good", "XUV700 comes with a sony sound system &amp; panoramic sunroof. It looks sporty &amp; bulky. It offers many safety features &amp; its strong body is an additional thing which should be considered while buying a new car. I am very much satisfied with my new SUV. Overall Performance is awesome", "Super product Mahindra's new products are super. Nice looking car, great features, rest all-new Mahindra value for many products.", "Just waiting for this beast! After XUV500, I want to upgrade to the best of the Mahindra! So many features as expected from Mahindra.", "Made in India, the best value, the longest experience of Indian roads and village roads, yet smartest technology that too as per Indian culture. It's the best valued Indian culture car.", "Nice car in India, most safety car in Mahindra, luxury looking, comfort smooth driving car, the car has a premium look. ", "I just have 1 comment which is the seats of XUV7OO, it has got no ventilated seats. Actually, I like the vehicle too much and I'm eager to get the vehicle as soon as possible.", "Super comfortable car, and its look also very good and it is very good torque producer, it is the best looking car also.", "I just love the style of the car. It is too attractive and stylish. The features are amazing.", "I own this beast since 2016. I am very satisfied rather mesmerized with its performance. I made multiple long trips of 600k (Bangalore Hyderabad) without a break and I had no issues. Recently, I made a trip of 1600km from Hyderabad to UP, no halts, almost consistent speed(thanks to new good roads), and I was amazed by the beast. Driving throug...", "This SUV is very muscular and the engine is very powerful.", "XUV 5OO is one of the best SUVs in this segment, features, looks, design, and trust of MAHINDRA, everything is embedded in just one car.There are so many SUVs in the market but XUV500 is different from them. 2020 Mahindra XUV500 will be the best SUV than others like Jeep Compass, Tata Harrier, MG Hector, and KIA Seltos. But the best will be th...", "  The car is awesome with very good features", "Mahindra XUV500 2020 is the best SUV in the segment. The car has great looks, design, interiors and it is a next-generation car of India.", "An Amazing car with the best control features, very spacious and available at an affordable price range.", "Comfortable with beautiful Interior. XUV is also good at mileage and power.", "Nice car, at this time the Indian market needs this type of cars. They are economically too affordable. It will definitely become a favorite of Indian middle-class family. Nice SUV, a Mahindra brand, Indian logo may hit the market in 2020, a very nice car can become Indian car of the year 2020.", "Mahindra XUV 700 is a good car with the best mileage and performance. I suggest buying this car at the best price.", "This is the best car in India, and no one can beat this car because of its features. The body build of this car is also good compared to other cars in this price range.", "XUV 700 is a fantastic vehicle, which an entire family will love. Having driven Harrier, Innova &amp; Fortuner in the past, I would say XUV is better than all of them in terms of power, space, comfort &amp; refinement as an overall package.", "Very good and comfortable car. It's looking so beautiful and has good features as compared to other SUVs.", "Looking amazing. The power is marvelous, the braking system is unbelievable, power steering is great. Totally unforgettable experience.", "Mind-blowing, excellent, good design, latest features, very strong car, best safety. This a perfect family car.", "Outstanding SUV at this price, comfort is outstanding, and locking is so gorgeous. The road presence is very nice, and the features are awesome. It is good for family purposes, this is India's best safest car. \n", "Very comfortable and safest car with good performance and power. XUV 700 is amazing in all SUV cars.", "It is a comfortable car for middle-class families at this price. Overall experience was very good.", "This is a very nice car with good comfort. I am very happy to see the car it looks very nice.", "This car is the best car for comfort. This car is the best for safe driving and I like its automatic system. I like its sunroof and other systems. Its performance off-road is comfortable.", "Yes, it's one of the best Mahindra XUV700 and is full of features. Best in milage, best in performance amazing look, and also the heart of every Indian."]}